Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/definemonitor/definemonitor_x10.po
Languages: ru

source: The X10 tab configures options for X10 Home Automation. This tab and its options will only appear if you have enabled X10 support in :guilabel:`Options` -> :guilabel:`X10` -> **OPT_X10**.
ru: Таб X10 настраивает параметры для домашней автоматизации X10. Эта таб и ее опции будут отображаться только в том случае, если вы активировали поддержку X10 в :guilabel:`Опции` -> :guilabel:`X10` -> **OPT_X10**.

source: **X10 Activation String**: The contents of this field determine when a monitor starts and/or stops being active when running in ‘Triggered' mode and with X10 triggers. The format of this string is as follows:
ru: **Строка активации X10**: Содержимое этого поля определяет, когда монитор начинает и/или прекращает быть активным при работе в режиме «Триггер» и с использованием X10-триггеров. Формат этой строки следующий:

source: **n**: If you simply enter a number then the monitor will be activated when an X10 ON signal for that unit code is detected and will be deactivated when an OFF signal is detected.
ru: **n**: Если вы просто введете число, монитор будет активирован при обнаружении сигнала X10 ON для этого кода устройства и будет деактивирован при обнаружении сигнала OFF.

source: **!n**: This inverts the previous mode, e.g. !5 means that the monitor is activated when an OFF signal for unit code 5 is detected and deactivated by an ON.
ru: **!n**: Это инвертирует предыдущий режим, например, !5 означает, что монитор активируется при обнаружении сигнала OFF для кода устройства 5 и деактивируется при обнаружении сигнала ON.

source: **n+**: Entering a unit code followed by + means that the monitor is activated on receipt of a ON signal for that unit code but will ignore the OFF signal and as such will not be deactivated by this instruction. If you prepend a '!' as per the previous definition it similarly inverts the mode, i.e. the ON signal deactivates the monitor.
ru: **n+**: Войдя в код единицы, за которым следует +, означает, что монитор активируется при получении сигнала ON для этого кода единицы, но игнорирует сигнал OFF и, таким образом, не деактивируется этим инструктажем. Если вы префиксируете '!' в соответствии с предыдущим определением, это аналогично переворачивает режим, т.е. сигнал ON деактивирует монитор.

source: **n+<seconds>**: As per the previous mode except that the monitor will deactivate itself after the given number of seconds.
ru: **n+<seconds>**: Как и в предыдущем режиме, за исключением того, что монитор деактивируется через заданное количество секунд.

source: **n-**: Entering a unit code followed by - means that the monitor is deactivated on receipt of a OFF signal for that unit code but will ignore the ON signal and as such will not be activated by this instruction. If you prepend a '!' as per the previous definition it similarly inverts the mode, i.e. the OFF signal activates the monitor.
ru: **n-**: Вход кода единицы, за которым следует знак дефиса, означает, что монитор деактивируется при получении сигнала OFF для этого кода единицы, но он игнорирует сигнал ON и, таким образом, не активируется этим инструктажем. Если вы префиксируете '!' в соответствии с предыдущим определением, это аналогично инверсии режима, т.е. сигнал OFF активирует монитор.

source: **n-<seconds>**: As per the previous mode except that the monitor will activate itself after the given number of seconds.
ru: **n-<seconds>**: Как и в предыдущем режиме, за исключением того, что монитор активируется сам через указанное количество секунд.

source: You can also combine several of these expressions to by separating them with a comma to create multiple circumstances of activation. However for now leave this blank.
ru: Вы также можете объединить несколько этих выражений, разделив их запятой, чтобы создать несколько условий активации. Однако пока оставьте это пустым.

source: **X10 Input Alarm String**: This has the same format as the previous field but instead of activating the monitor this will cause a forced alarm to be generated and an event recorded if the monitor is Active. The same definition as above applies except that for activated read alarmed and for deactivated read unalarmed(!). Again leave this blank for now.
ru: **Имя поля сигнала тревоги X10**: Это имеет ту же структуру, что и предыдущее поле, но вместо активации монитора это вызовет генерацию принудительной тревоги и запись события, если монитор активен. То же определение, что и выше, применяется за исключением того, что для активного чтения "тревога" и для деактивированного чтения "нетревога". Оставьте это пустым на данный момент.

source: **X10 Output Alarm String**: This X10 string also has the same format as the two above options. However it works in a slightly different way. Instead of ZoneMinder reacting to X10 events this option controls how ZoneMinder emits X10 signals when the current monitor goes into or comes out of the alarm state. Thus just entering a number will cause the ON signal for that unit code to be sent when going into alarm state and the OFF signal when coming out of alarm state. Similarly 7+30 will send the unit code 7 ON signal when going into alarm state and the OFF signal 30 seconds later regardless of state. The combination of the X10 instruction allows ZoneMinder to react intelligently to, and also assume control of, other devices when necessary. However the indiscriminate use of the Input Alarm and Output Alarm signals can cause some horrendous race conditions such as a light going on in response to an alarm which then causes an alarm itself and so on. Thus some circumspection is required here. Leave this blank for now.
ru: **Строка сигнала тревоги X10**: Эта строка X10 также имеет тот же формат, что и два вышеупомянутых варианта. Однако он работает немного иначе. Вместо того чтобы ZoneMinder реагировала на события X10, этот вариант контролирует, как ZoneMinder генерирует сигналы X10 при переходе текущего монитора в состояние тревоги или выхода из него. Таким образом, просто введя число, вы отправите сигнал ON для этого кода устройства, когда оно перейдет в состояние тревоги, и сигнал OFF, когда оно выйдет из состояния тревоги. Аналогично 7+30 отправит сигнал ON для кода устройства 7, когда оно перейдет в состояние тревоги, и сигнал OFF через 30 секунд независимо от состояния. Комбинация инструкции X10 позволяет ZoneMinder разумно реагировать на другие устройства и брать на себя управление ими, когда это необходимо. Однако неконтролируемое использование сигналов тревоги ввода и вывода может вызвать ужасные условия гонки, такие как включение света в ответ на тревогу, которое затем вызывает тревогу, и так далее. Таким образом, здесь требуется осмотрительность. Оставьте это пустым на данный момент.
