Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/definemonitor/definemonitor_analysis.po
Languages: ru

source: Analysis Tab
ru: Анализ Таб

source: The Analysis tab contains settings relating to motion detection.
ru: Таблица анализа содержит настройки, связанные с обнаружением движения.

source: Monitor Analysis Tab
ru: Таблица анализа монитора

source: **Motion Detection**
ru: **Датчик движения**

source: None: Do not perform motion detection. Recording can still be triggered manually.
ru: Не выполнять обнаружение движения. Запись все еще может быть запущена вручную.

source: Always: Perform motion detection.
ru: Всегда: Выполнить обнаружение движения.

source: **Analysis Image**
ru: **Анализ изображения**

source: Full Colour: Perform the detection using the full RGB image
ru: Полноцвет: Выполните обнаружение с использованием полного цветного изображения

source: Y-Channel: If the capture process results in an image in YUV format, the Y channel is a grey scale image. Performing motion detection on just Y channel uses 1/4 of processing compared to the full colour image.
ru: Y-Канал: Если процесс захвата приводит к изображению в формате YUV, канал Y представляет собой изображение в сером цвете. Выполнение обнаружения движения только по каналу Y использует 1/4 обработки по сравнению с полным цветным изображением.

source: **Analysis FPS**: Motion detection is not required on every frame captured. For a stream captured at 30 FPS, motion detection can be adequate at 5 FPS for most cases. Motion detection is very CPU intensive so reducing the Analysis FPS as low as possible allows more cameras to be added to the system.
ru: **Анализ FPS**: Для потока, захваченного со скоростью 30 кадров в секунду, обнаружение движения может быть достаточным со скоростью 5 кадров в секунду для большинства случаев. Обнаружение движения очень интенсивно для ЦП, поэтому снижение FPS анализа до минимума позволяет добавить больше камер в систему.

source: **Reference Image Blend %ge**: Each analysed image in ZoneMinder is a composite of previous images and is formed by applying the current image as a certain percentage of the previous reference image. Thus, if we entered the value of 10% here, each image’s part in the reference image will diminish by a factor of 0.9 each time round. So a typical reference image will be 10% of the previous image, 9% the one before that and then 8.1%, 7.2%, 6.5% and so on of the rest of the way. An image will effectively vanish around 25 images later than when it was added. This blend value is what is specified here and if higher will make slower progressing events less detectable as the reference image would change more quickly. Similarly, events will be deemed to be over much sooner as the reference image adapts to the new images more quickly. In signal processing terms the higher this value the steeper the event attack and decay of the signal. Default value is 6.25% for Indoor cameras and 12.5% for Outdoor cameras.
ru: **Процентное соотношение смешивания изображений**: Каждое проанализированное изображение в ZoneMinder является композицией предыдущих изображений и формируется путем применения текущего изображения как определенной доли предыдущего эталонного изображения. Таким образом, если мы введем значение 10% здесь, каждая часть изображения в эталонном изображении будет уменьшаться на коэффициент 0,9 каждый раз. Таким образом, типичное эталонное изображение будет составлять 10% от предыдущего изображения, 9% следующего и затем 8.1%, 7.2%, 6.5% и так далее до конца. Изображение будет эффективно исчезать примерно через 25 изображений после его добавления. Это значение смешивания определяется здесь и если оно выше, то менее заметные события будут менее заметны, поскольку эталонное изображение будет меняться быстрее. События также будут считаться завершенными намного раньше, поскольку эталонное изображение быстрее адаптируется к новым изображениям. В терминах обработки сигналов, чем выше это значение, тем круче атака и спад сигнала события. Значение по умолчанию составляет 6,25% для внутренних камер и 12,5% для наружных камер.

source: **Alarm Reference Image Blend %ge**: This is defined similar to Reference Image Blend but only applies during alarm states. This allows the alarm blend to be different than the reference blend.
ru: **Изображение ссылки для смешивания сигнала %ge**: Это определено аналогично Смешиванию изображения ссылки, но применяется только во время состояния тревоги. Это позволяет смешиванию сигнала тревоги отличаться от смешивания изображения ссылки.

source: **Linked Monitors**: This field allows you to select other monitors or zones on your system that act as triggers for this monitor. So if you have a camera covering one aspect of your property you can force all cameras to record when that camera detects motion or other events. You can either directly enter a comma separated list of monitor IDs or click on :guilabel:`Add Monitor Link` pulldown menu. Be careful not to create circular dependencies with this feature as it may cause infinitely persisting alarms. To unlink monitors you can ctrl-click. You can also enter logical operators here to create more complex logic ( | = OR, & = AND). So A | B means record if either A or B is alarmed. A & B means trigger if both A and B are alarmed.
ru: **Связанные мониторы**: Это поле позволяет вам выбрать другие мониторы или зоны на вашей системе, которые служат триггерами для этого монитора. Таким образом, если у вас есть камера, которая покрывает одну часть вашего имущества, вы можете заставить все камеры записывать, когда эта камера обнаруживает движение или другие события. Вы можете либо напрямую ввести список идентификаторов мониторов, разделенных запятыми, либо щелкнуть по раскрывающемуся списку :guilabel:`Добавить связь с монитором`. Будьте осторожны, чтобы не создавать циклические зависимости с этой функцией, так как это может привести к бесконечным сигналам тревоги. Чтобы разорвать связь между мониторами, вы можете использовать сочетание клавиш Ctrl. Вы также можете ввести здесь логические операторы, чтобы создать более сложную логику ( | = ИЛИ, & = И). Так, A | B означает запись, если либо A, либо B находится в состоянии тревоги. A & B означает срабатывание триггера, если оба A и B находятся в состоянии тревоги.
