Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/definemonitor/definemonitor_recording.po
Languages: ru

source: Recording Tab
ru: Запись Таб

source: The Recording tab contains settings for recording the video and audio streams. The video stream can be saved as JPEG, re-encoded to different standards or allowed to passthrough and save in the original form as created by the camera.
ru: Запись содержит настройки для записи видео- и аудиопотоков. Видеопоток можно сохранить в виде JPEG, перекодировать в разные стандарты или разрешить проходить через него и сохранять в оригинальном виде, как создано камерой.

source: Monitor Recording Tab
ru: Таблица записи монитора

source: **Recording**
ru: **Запись**

source: Always: Always record regardless of motion detection.
ru: Всегда: всегда записывайте независимо от обнаружения движения.

source: On Motion/Trigger/etc: Record only when motion is detected or otherwise triggered.
ru: На Motion/Trigger/etc: Записывать только при обнаружении движения или в других случаях срабатывания.

source: None: Do not record.
ru: !не записывать

source: **Storage Area**: Where to store the recordings. If writing to this area fails, others will be tried.
ru: **Секция хранения**: Где хранить записи. Если запись в эту область не удается, будут предприняты другие попытки.

source: **Save JPEGs**: Records video in individual JPEG frames. Storing JPEG frames requires more storage space than h.264 but it allows one to view an event anytime while it is being recorded.
ru: **Сохранение JPEG-файлов**: Записывает видео в отдельные кадры JPEG. Хранение кадров JPEG требует больше места для хранения, чем h.264, но позволяет просматривать событие в любое время во время записи.

source: Disabled: Video is not recorded as JPEG frames. If this setting is selected, then 'Video Writer' should be enabled otherwise no recording will take place.
ru: Отключено: Видео не записывается как кадры JPEG. Если этот параметр выбран, то "Видеозапись" должна быть включена, иначе запись не будет производиться.

source: Frames only: Video is recorded in individual JPEG frames.
ru: Видео записывается в виде отдельных JPEG-изображений.

source: Analysis images only (if available): Video is recorded in individual JPEG frames with an overlay of the motion detection analysis information. Note that this overlay remains permanently visible in the frames.
ru: Анализировать только изображения (если доступно): Видео записывается в виде отдельных кадров JPEG с наложением информации об анализе движения. Обратите внимание, что это наложение остается постоянно видимым в кадрах.

source: Frames + Analysis images (if available): Video is recorded twice, once as normal individual JPEG frames and once in individual JPEG frames with an overlay of motion detection analysis information.
ru: Изображения + анализ кадров (если доступно): Видео записывается дважды, один раз как обычные отдельные изображения в формате JPEG и один раз в виде отдельных изображений в формате JPEG с наложением информации об анализе движения.

source: **Video Writer**: Records video in real video format. It provides much better compression results than saving JPEGs, thus longer video history can be stored.
ru: **Видеоредактор**: Записывает видео в реальном формате видео. Он обеспечивает гораздо лучшие результаты сжатия по сравнению с сохранением JPEG, поэтому можно хранить более долгую историю видео.

source: Disabled: Video is not recorded in video format. If this setting is selected, then 'Save JPEGs' should be enabled otherwise there is no video recording at all.
ru: Отключено: Видео не записывается в формате видео. Если этот параметр выбран, то "Сохранить JPEG" должно быть разрешено, иначе нет никакой записи видео.

source: Encode: The video or picture frames received from the camera are transcoded into the selected codec and stored as a video. This option is useful if the camera cannot natively stream h.264.
ru: Кодирование: Видео- или фотоизображения, полученные от камеры, преобразуются в выбранный кодек и сохраняются как видео. Этот вариант полезен, если камера не может напрямую транслировать h.264.

source: Camera Passthrough: This option assumes that the camera is already sending an h.264 stream. Video will be recorded as is without any post-processing in ZoneMinder. Video characteristics such as bitrate, encoding mode, etc. should be set directly in the camera. The resulting video will not include the ZoneMinder timestamp overlay so it is important to have the camera include the date/time in the video.
ru: Пассивная камера: этот параметр предполагает, что камера уже отправляет поток h.264. Видео будет записываться как есть без какой-либо пост-обработки в ZoneMinder. Характеристики видео, такие как битрейт, режим кодирования и т. д., должны быть установлены непосредственно в камере. Результат видео не будет включать в себя временную метку ZoneMinder, поэтому важно, чтобы камера включала дату/время в видео.

source: **Output Codec**: This option is available when Video Writer is set to 'Encode'. If encoding, you can choose between h.264, h.265/hevc, vp9 or av1.
ru: **Кодек вывода**: Этот параметр доступен, когда Video Writer установлен в 'Кодировать'. Если кодирование, вы можете выбрать между h.264, h.265/hevc, vp9 или av1.

source: **Encoder**: This option is available when Video Writer is set to 'Encode'. If encoding you can choose which encoder will be used. This is where you can select a hardware accelerated encoder.
ru: **Кодировщик**: Этот параметр доступен, когда Video Writer установлен в 'Кодировать'. Если вы кодируете, вы можете выбрать, какой кодировщик будет использоваться. Здесь вы можете выбрать аппаратно ускоренный кодировщик.

source: **Output Container**: Leaving at Auto allows ZoneMinder to use mp4. Other choices are mkv and webm.
ru: **Контейнер для вывода**: Выход в автоматическом режиме позволяет ZoneMinder использовать mp4. Другие варианты - это mkv и webm.

source: **Optional Encoding Parameters**: Mostly useful when encoding as each encoder takes different parameters. Consult the `FFmpeg documentation <https://ffmpeg.org/ffmpeg-formats.html>`__ for available parameters for each encoder.
ru: **Дополнительные параметры кодирования**: В основном полезны при кодировании, поскольку каждый кодер принимает разные параметры. Обратитесь к документации `FFmpeg <https://ffmpeg.org/ffmpeg-formats.html>`__ для доступных параметров для каждого кодировщика.

source: **Recording Audio**: Check the box in order to save audio (if available) when events are recorded.
ru: **Запись аудио**: Установите флажок, чтобы сохранить аудио (если доступно), когда записываются события.

source: **Event Start Command**: When a recording event starts, you can run a system command. The parameters to the command will be the event id and the monitor id.
ru: **Команда начала события**: Когда начинается событие записи, вы можете выполнить системную команду. Параметры команды будут включать идентификатор события и идентификатор монитора.

source: **Event End Command**: When a recording event ends, you can run a system command. The parameters to the command will be the event id and the monitor id.
ru: **Команда окончания события**: Когда заканчивается запись события, вы можете запустить системную команду. Параметры команды будут включать идентификатор события и идентификатор монитора.
