Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/definemonitor/definemonitor_viewing.po
Languages: ru

source: Viewing Tab
ru: Таблица просмотра

source: ZoneMinder supplies its own RTSP server that can re-stream RTSP or attempt to convert the Monitor stream into RTSP. This is useful if you want to use the ZoneMinder Host machine resources instead of having multiple clients pulling from a single camera.
ru: ZoneMinder предоставляет собственный сервер RTSP, который может повторно транслировать RTSP или пытаться преобразовать поток Монитора в RTSP. Это полезно, если вы хотите использовать ресурсы хоста ZoneMinder вместо того, чтобы иметь несколько клиентов, извлекающих данные из одной камеры.

source: Monitor Viewing Tab
ru: Таблица просмотра монитора

source: **RTSP Server**: Makes the Monitor video stream available to the ZoneMinder RTSP Server.
ru: **RTSP-сервер**: Обеспечивает поток видеомонитора для RTSP-сервера ZoneMinder.

source: **RTSPStreamName**: The path part of the RTSP URL used for this Monitor. Must be unique. For example, if this is Monitor ID 6, **MIN_RTSP_PORT** =20000 and RTSPStreamName is set to 'my_camera', the stream can be accessed at ``rtsp://ZM_HOST:20006/my_camera``.
ru: **RTSPStreamName**: Часть пути в URL-адресе RTSP для этого Монитора. Должен быть уникальным. Например, если это Монитор ID 6, **MIN_RTSP_PORT** =20000 и **RTSPStreamName** установлено на 'my_camera', поток можно получить по адресу `rtsp://ZM_HOST:20006/my_camera`.

source: **RTSP2Web Live Stream**: Attempt to use RTSP2Web streaming server for h.264/h.265 live view. Experimental, but allows for significantly better performance.
ru: **RTSP2Web Live Stream**: Попытка использовать сервер RTSP2Web для потокового вещания в реальном времени с использованием формата h.264/h.265. Экспериментально, но позволяет значительно улучшить производительность.

source: **RTSP2Web Type**: Select video streaming protocol. Available choices are HLS (HTTP Live Streaming), MSE (Media Source Extensions) and WebRTC (Web Real Time Communications).
ru: **Тип RTSP2Web**: Выберите протокол потокового видео. Доступные варианты - HLS (HTTP Live Streaming), MSE (Media Source Extensions) и WebRTC (Web Real Time Communications).

source: **Janus Live Stream**: Enables Janus re-streaming of the video content. This uses WebRTC to view the stream in h.264 instead of a stream of JPEG images. It also enables audio in the live feed.
ru: **Янус прямая трансляция**: Позволяет Janus повторную трансляцию видеоконтента. Это использует WebRTC для просмотра потока в h.264 вместо потока JPEG изображений. Также это позволяет аудио в живом потоке.

source: **Default Rate**: When live viewing, you can watch at FPS slower than ZoneMinder is capturing at. This can be changed during viewing, but this sets the default.
ru: **Базовая скорость**: Когда вы смотрите в прямом эфире, вы можете смотреть со скоростью кадров, медленнее, чем ZoneMinder захватывает. Это можно изменить во время просмотра, но это устанавливает по умолчанию.

source: **Default Scale**: If your Monitor has been defined with a particularly large or small image size then you can choose a default scale here with which to view the monitor so it is easier or more visible from the web interface. A value of Auto will attempt to optimally fill the browser window.
ru: **Основной масштаб**: Если ваш монитор был определен с особенно большим или маленьким размером изображения, то вы можете выбрать здесь основной масштаб, с которым вы будете просматривать монитор, чтобы он был легче или более видимым через веб-интерфейс. Значение Auto попытается оптимально заполнить окно браузера.

source: **Default Method For Event View**
ru: **Основной метод для просмотра событий**

source: MP4: If the video is h.264 encoded MP4 file you can use the browser's built in video player.
ru: Если видео закодировано в файл MP4 с использованием формата h.264, вы можете использовать встроенный видеоплеер браузера.

source: MJPEG: If the video is h.265 encoded and can't play the video natively, we can use ZMS to convert it to MJPEG and view that.
ru: MJPEG: Если видео закодировано в h.265 и не может воспроизводиться напрямую, мы можем использовать ZMS для его преобразования в MJPEG и просмотра.
