Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/definemonitor/definemonitor_source.po
Languages: ru

source: The File source type is used for periodically loading an image file. This is useful for the case where a device or script writes single files instead of the more common stream that the other Source types handle. A description of this can be found in the `ZoneMinder wiki <https://wiki.zoneminder.com/index.php/How_to_use_ZoneMinder_with_cameras_it_may_not_directly_support>`__.
ru: Тип файла источника используется для периодической загрузки изображения. Это полезно в случае, когда устройство или скрипт записывает отдельные файлы вместо более распространенного потока, с которым работают другие типы источников. Описание этого можно найти в `вики ZoneMinder <https://wiki.zoneminder.com/index.php/How_to_use_ZoneMinder_with_cameras_it_may_not_directly_support>`__.

source: Listed below are the parameters unique to File Source. Please also see :ref:`common_source_parameters` section above for information related to the common source parameters which also need to be entered.
ru: Ниже приведены параметры, уникальные для источника файла. Пожалуйста, также см. раздел :ref:`общие параметры источника` выше для информации, относящейся к общим параметрам источника, которые также необходимо ввести.

source: **Source Path**: Enter a path from the file system such as ``/mnt/images/foo.jpg``.
ru: **Путь к файлу**: введите путь к файловой системе, например, `/mnt/images/foo.jpg`.

source: Source Tab for Web Site
ru: Таблица источников для веб-сайта

source: The Web Site Source Type allows one to configure an arbitrary website as a non-recordable, fully interactive Monitor in ZoneMinder. Note that sites with self-signed certificates will not display until the end user first manually navigates to the site and accepts the unsigned certificate. Also note that some sites will set an X-Frame option in the header, which discourages their site from being displayed within a frame. ZoneMinder will detect this condition and present a warning in the log. When this occurs, the end user can choose to install a browser plugin or extension to workaround this issue.
ru: Тип источника веб-сайта позволяет настроить произвольный веб-сайт как не записываемый, полностью интерактивный Монитор в ZoneMinder. Примечание: сайты с самоподписанными сертификатами не будут отображаться до тех пор, пока конечный пользователь сначала не вручную перейдет на сайт и не примет незаверенный сертификат. Также следует отметить, что некоторые сайты устанавливают опцию X-Frame в заголовке, которая отговаривает их сайт от отображения в рамке. ZoneMinder обнаружит это условие и представит предупреждение в журнале. Когда это произойдет, конечный пользователь может выбрать установку браузерного плагина или расширения для обхода этой проблемы.

source: Listed below are the parameters unique to Web Site Source. Please also see :ref:`common_source_parameters` section above for information related to the common source parameters which also need to be entered.
ru: Ниже приведены параметры, уникальные для источника веб-сайта. Пожалуйста, также см. раздел :ref:`общие параметры источника` выше для информации, относящейся к общим параметрам источника, которые также необходимо ввести.

source: **Website URL**: Enter full HTTP or HTTPS URL such as ``http://hostname.com``.
ru: **Веб-адрес**: Введите полный URL-адрес HTTP или HTTPS, например ``http://hostname.com``.

source: **Width (pixels)**: Enter page width in pixels. This may take some experimentation.
ru: **Ширина (пиксели)**: Введите ширину страницы в пикселях. Это может потребовать некоторых экспериментов.

source: **Height (pixels)**: Enter page height in pixels. This may take some experimentation.
ru: **Высота (пиксели)**: Введите высоту страницы в пикселях. Это может потребовать некоторых экспериментов.

source: **Web Site Refresh**: If the website in question has static content, optionally enter a time period in seconds for ZoneMinder to refresh the content.
ru: **Обновление веб-сайта**: Если веб-сайт содержит статический контент, по желанию укажите временной интервал в секундах для ZoneMinder для обновления контента.
