Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/definemonitor/definemonitor_control.po
Languages: ru

source: Control Tab
ru: !перевод Control Tab: "Табуляция управления"

source: The Control tab defines the parameters required for camera control. This tab and its options will only appear if you have selected the :guilabel:`Options` -> :guilabel:`System` -> :guilabel:`OPT_CONTROL` option to indicate that your system contains cameras which are able to be controlled via Pan/Tilt/Zoom or other mechanisms. See the :doc:`/userguide/cameracontrol` section for further details on camera control protocols and methods.
ru: Таба "Управление" определяет параметры, необходимые для управления камерой. Эта вкладка и ее опции будут отображаться только в том случае, если вы выбрали опцию :guilabel:`Options` -> :guilabel:`System` -> :guilabel:`OPT_CONTROL`, чтобы указать, что ваша система содержит камеры, которые могут быть управляемы с помощью Pan/Tilt/Zoom или других механизмов. См. раздел :doc:`/userguide/cameracontrol` для получения дополнительной информации о протоколах и методах управления камерами.

source: Monitor Control Tab
ru: Таблица управления монитором

source: **Controllable**: Check this box to indicate your camera can be controlled.
ru: **Контролируемый**: Отметьте этот флажок, чтобы указать, что ваша камера может быть контролируемой.

source: **Control Type**: Select the control type that is appropriate for your camera. ZoneMinder ships with a small number of predefined control protocols which will work with some cameras without modification but which may have to amended to function with others. Choose the :guilabel:`Edit` link to create new control types or to edit the existing ones.
ru: **Тип управления**: Выберите тип управления, который подходит для вашей камеры. ZoneMinder поставляется с небольшим количеством предварительно определенных протоколов управления, которые будут работать с некоторыми камерами без изменений, но могут потребоваться изменения для работы с другими. Выберите ссылку :guilabel:`Edit`, чтобы создать новые типы управления или отредактировать существующие.

source: **Control Device**: This is the device that is used to control your camera. This will normally be a serial or similar port. If your camera is a IP network camera, you will generally not need to specify a control device.
ru: **Устройство управления**: Это устройство используется для управления вашей камерой. Обычно это будет последовательный или аналогичный порт. Если ваша камера является камерой IP-сети, вам, как правило, не придется указывать устройство управления.

source: **Control Address**: This is the camera address. Some control protocols require that each camera is identified by a particular, usually numeric, ID. If the camera uses addressing then enter the ID of your camera here. For IP network cameras enter the hostname or IP address here. This is ordinarily the same as that given for the camera itself.
ru: **Управляемый адрес**: Это адрес камеры. Некоторые протоколы управления требуют, чтобы каждая камера была идентифицирована определенным, обычно числовым, идентификатором. Если камера использует адресацию, введите здесь идентификатор вашей камеры. Для сетевых камер введите здесь имя хоста или IP-адрес. Обычно это то же самое, что и адрес, указанный для самой камеры.

source: **Auto Stop Timeout**: Some cameras only support a continuous mode of movement. For instance you tell the camera to pan right and then when it is aligned correctly you tell it to stop. In some cases it is difficult to time this precisely over a web interface so this option allows you to specify an automatic timeout where the command will be automatically stopped. A value of 0.25 here tells the script to stop moving a quarter of a second after starting. This allows a more precise method of control. If this value is left blank or at zero it will be ignored. If this is set then it will be used as the timeout, however it will only be applied for the lower 25% of possible speed ranges. In other words if the camera has a pan speed range of 1 to 100 then selecting movement at 26 or over will be assumed to imply that you want a larger movement that you can control yourself and no timeout will be applied. Selecting motion at lower speeds will be interpreted as requiring finer control and the automatic timeout will be invoked.
ru: **Время автоматического останова**: Некоторые камеры поддерживают только непрерывный режим движения. Например, вы говорите камере двигаться вправо, а затем, когда она выровнена правильно, говорите ей остановиться. В некоторых случаях трудно точно рассчитать это через веб-интерфейс, поэтому эта опция позволяет указать автоматический таймаут, при котором команда будет автоматически остановлена. Значение 0,25 здесь означает, что скрипт остановится через четверть секунды после начала движения. Это обеспечивает более точный метод управления. Если это значение оставлено пустым или равно нулю, оно будет проигнорировано. Если это установлено, оно будет использоваться как время ожидания, однако оно будет применяться только для нижних 25% возможных скоростей движения. Другими словами, если камера имеет диапазон скорости панорамирования от 1 до 100, выбор движения со скоростью 26 или выше будет считаться подразумевающим, что вы хотите более крупное движение, которым вы можете управлять самостоятельно, и не будет применено время ожидания. Выбор движения на более низких скоростях будет интерпретироваться как требующее более точного управления, и автоматическое время ожидания будет вызвано.

source: **Track Motion**: Check this box to enable motion tracking. This and the following three options are used with the experimental motion function. This will only work if the camera supports mapped movement modes where a point on an image can be mapped to a control command. This is generally most common on IP network cameras but can be replicated to some degree on other cameras that support relative movement modes. See the :doc:`/userguide/cameracontrol` section for more details.
ru: **Трек движение**: Установите флажок, чтобы включить отслеживание движения. Этот и следующие три варианта используются с экспериментальной функцией движения. Это будет работать только в том случае, если камера поддерживает режимы перемещения, при которых точка изображения может быть связана с управляющим командам. Это обычно наиболее распространено на IP-камерах, но может быть воспроизведено в некоторой степени на других камерах, которые поддерживают относительные режимы перемещения. См. раздел :doc:`/userguide/cameracontrol` для получения дополнительной информации.

source: **Track Delay**: This is the number of seconds to suspend motion detection for following any movement that the camera may make to track motion.
ru: **Задержка трека**: Это количество секунд для приостановки обнаружения движения после любого движения, которое камера может сделать для отслеживания движения.

source: **Return Location**: If the camera supports a ‘home’ position or presets this selects which preset the camera should return to after tracking motion.
ru: **Точка возврата**: Если камера поддерживает позицию "дома" или имеет предустановки, это выбирает, какую предустановку должна использовать камера после отслеживания движения.

source: **Return Delay**: This is the delay, in seconds, once motion has stopped being detected, before the camera returns to any defined return location.
ru: **Задержка возврата**: Это задержка, в секундах, после того, как обнаружение движения прекращается, прежде чем камера вернется к любой определенной точке возврата.
