Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/definemonitor/definemonitor_source.po
Languages: ru

source: Source Tab
ru: !перевод

source: The Source tab contains parameters related to the video stream as well as selection of capture and decode methods. The parameters listed in the Source tab depend on the **Source Type** specified in the General tab.
ru: Таблица "Источник" содержит параметры, относящиеся к потоку видео, а также выбор методов захвата и декодирования. Параметры, указанные в таблице "Источник", зависят от типа источника, указанного в таблице "Общие".

source: For documentation purposes we have split the Source tab information into two parts:
ru: Для документирования мы разделили информацию о вкладке "Источник" на две части:

source: **Common Source Parameters**: All source types except Web Site contain these listed parameters. They are shown in the :ref:`common_source_parameters` section just below and can be entered first.
ru: **Общие параметры источника**: Все типы источников, за исключением веб-сайта, содержат эти параметры. Они показаны в разделе «Общие параметры источника» прямо под ним и могут быть введены первыми.

source: **Specific Source Parameters**: Each source type has a dedicated section that contains their unique parameters. The common source parameters are not listed again in these sections.
ru: **Специфические параметры источника**: Каждый тип источника имеет свою секцию, которая содержит их уникальные параметры. Общие параметры источника не перечисляются снова в этих разделах.

source: Common Source Parameters
ru: Общие параметры источника

source: Common Parameters for all Source Types (other than Web Site)
ru: Общие параметры для всех типов источников (кроме веб-сайта)

source: **Capturing**
ru: **Захват**

source: **None**: The ZoneMinder Capture daemon (zmc) is disabled. Event recording is not possible.
ru: **Ничего**: Демон захвата ZoneMinder (zmc) отключен. Запись событий невозможна.

source: **On Demand**: The ZoneMinder Capture daemon (zmc) is enabled but will wait for a viewer to start the stream capture. Viewer is defined as either a live view, thumbnail or RTSP server connection.
ru: **В режиме ожидания**: Демон захвата ZoneMinder (zmc) включен, но будет ждать начала потоковой передачи от зрителя. Зритель определяется как либо прямая трансляция, либо миниатюра, либо сервер RTSP.

source: **Always**: This is the normal mode of operation. A ZoneMinder Capture daemon (zmc) will run and constantly capture video.
ru: **Всегда**: Это обычный режим работы. ZoneMinder Капчер даймон (zmc) будет работать и постоянно записывать видео.

source: **Decoding**
ru: **Декодирование**

source: **None**: No frames will be decoded, live view and thumbnails will not be available.
ru: **None**: Не будут декодироваться кадры, прямой просмотр и превью недоступны.

source: **On Demand**: Only enable decoding when someone is watching.
ru: **По требованию**: Включайте декодирование только тогда, когда кто-то смотрит.

source: **KeyFrames**: Only keyframes will be decoded. Viewing frame rate will be very low depending on the keyframe interval set in the camera.
ru: **Кейфреймы**: Будут декодироваться только кейфреймы. Частота кадров при просмотре будет очень низкой в зависимости от установленного интервала кейфреймов в камере.

source: **KeyFrames + On Demand**: Keyframes will be decoded when someone is watching.
ru: **Кейфреймы + по требованию**: Кейфреймы будут декодироваться при просмотре.

source: **Always**: Every frame will be decoded, live view and thumbnails will be available.
ru: **Всегда**: Каждый кадр будет декодирован, живая картинка и миниатюры будут доступны.

source: **Target Colorspace**: Specify the color depth or bits per pixel in the captured image. Most modern cameras support 32 bit depth. This has no controlling effect on the camera.
ru: **Цель цветового пространства**: Укажите глубину цвета или количество бит на пиксель в захваченном изображении. Большинство современных камер поддерживают 32-битную глубину. Это не имеет контролирующего воздействия на камеру.

source: **32 bit colour**: The default setting. Most modern cameras support 32 bit color depth.
ru: **32-битная цветность**: Это стандартное значение. Большинство современных камер поддерживают 32-битную глубину цвета.

source: **24 bit colour**: Try this setting for older cameras if 32 bit is not supported.
ru: **24-битная цветность**: Попробуйте этот режим для старых камер, если 32-битный не поддерживается.

source: **8 bit greyscale**: For non-color streams. This can reduce both CPU and storage requirements.
ru: **8-битное серое изображение**: Для потоков без цвета. Это может снизить требования к ЦП и хранилищу.

source: **Capture Resolution**: Resolution is the dimensions in bits of the video stream provided by camera. It is important that the entered capture resolution matches the camera stream. The pulldown menu contains most commonly used resolutions up to 4K and is the recommended way to enter resolution. Resolution can also be entered manually if necessary.
ru: **Разрешение захвата**: Разрешение - это размеры в битах видеопотока, предоставляемого камерой. Важно, чтобы введенное разрешение захвата соответствовало потоку камеры. Меню со списком содержит наиболее часто используемые разрешения до 4K и является рекомендуемым способом ввода разрешения. Разрешение также можно ввести вручную, если необходимо.

source: **Preserve Aspect Ratio**: Enable this checkbox to ensure that the width preserves ratio to the height, or vice versa. Enter either width or height and the other dimension will be calculated. The default ratio is 4:3 but can be amended globally via the :guilabel:`Options` -> :guilabel:`Config` -> :guilabel:`DEFAULT_ASPECT_RATIO` setting.
ru: **Сохранение соотношения сторон**: Установите флажок для обеспечения того, что ширина сохраняет соотношение к высоте, или наоборот. Введите либо ширину, либо высоту, и другое измерение будет рассчитано. По умолчанию соотношение составляет 4:3, но его можно изменить глобально через настройку :guilabel:`Options` -> :guilabel:`Config` -> :guilabel:`DEFAULT_ASPECT_RATIO`.

source: **Orientation**: Use this option if the camera stream is not oriented as desired and cannot be changed directly in the camera firmware. Usually this is needed when the camera is not installed with correct physical orientation. This incurs an additional processing overhead in ZoneMinder. Remember to swap the height and width fields so that they apply correctly after rotation.
ru: **Ориентация**: Используйте этот параметр, если поток камеры не ориентирован так, как хотелось бы, и его нельзя изменить напрямую в прошивке камеры. Обычно это требуется, когда камера не установлена с правильной физической ориентацией. Это влечет за собой дополнительные затраты на обработку в ZoneMinder. Не забудьте поменять поля высоты и ширины так, чтобы они применялись правильно после поворота.

source: **Deinterlacing**: Only required for processing streams from interlaced sources so that the video is converted to progressive frames. Select the desired deinterlacing type from the dropdown menu.
ru: **Деинтерлейсинг**: Требуется только для обработки потоков из источников с интерлейсингом, чтобы видео было преобразовано в прогрессивные кадры. Выберите желаемый тип деинтерлейсинга из выпадающего меню.

source: **Maximum FPS**: For modern streaming IP cameras, *do not use this field to reduce the frame rate*. It is recommended to leave this blank which implies no Maximum FPS limit. ZoneMinder will use the FPS as provided from the camera stream. This option is only useful for local devices or older IP cameras that support snapshot mode.
ru: **Максимальное количество кадров в секунду**: Для современных потоковых IP-камер не используйте это поле для снижения частоты кадров. Рекомендуется оставить это поле пустым, что подразумевает отсутствие ограничения максимальной частоты кадров. ZoneMinder будет использовать частоту кадров, предоставленную из потока камеры. Этот параметр полезен только для локальных устройств или более старых IP-камер, которые поддерживают режим снимков.

source: **Alarm Maximum FPS**: For modern streaming IP cameras, *do not use this field to reduce the frame rate*. It is recommended to leave this blank which implies no Alarm Maximum FPS limit. ZoneMinder will use the FPS as provided from the camera stream. This option is only useful for local devices or older IP cameras that support snapshot mode.
ru: **Максимальная частота кадров тревоги**: Для современных потоковых IP-камер не используйте это поле для снижения частоты кадров. Рекомендуется оставить это пустым, что подразумевает отсутствие ограничения максимальной частоты кадров тревоги. ZoneMinder будет использовать частоту кадров, предоставленную из потока камеры. Этот вариант полезен только для локальных устройств или более старых IP-камер, которые поддерживают режим снимка.

source: Do not use the Maximum FPS parameters unless you know what you are doing. Setting these parameters may have undesirable results for network IP cameras.
ru: Не используйте параметр Maximum FPS, если вы не знаете, что делаете. Установка этих параметров может иметь нежелательные последствия для сетевых IP-камер.

source: Source Tab for FFmpeg
ru: Таблица источников для FFmpeg

source: This is the **recommended** source type for most modern networked IP cameras.
ru: Это рекомендуемый тип источника для большинства современных сетевых IP-камер.

source: Listed below are the parameters unique to FFmpeg Source. Please also see :ref:`common_source_parameters` section above for information related to the common source parameters which also need to be entered.
ru: Ниже приведены параметры, уникальные для FFmpeg Источник. Пожалуйста, также см. раздел :ref:`общие параметры источника` выше для информации, относящейся к общим параметрам источника, которые также необходимо ввести.

source: **Source Path**: Use this field to enter the full URL of the camera stream or file. There are several methods to learn this:
ru: **Путь к источнику**: Используйте это поле для ввода полного URL-адреса потока камеры или файла. Есть несколько способов узнать это:

source: Camera user manual or manufacturer support website
ru: Руководство пользователя камеры или веб-сайт поддержки производителя

source: Use ONVIF Probe feature in ZoneMinder by clicking on the related icon
ru: Используйте функцию "Проба ONVIF" в ZoneMinder, щелкнув по соответствующему значку

source: Look for the camera in the `ZoneMinder Hardware Compatibility wiki <https://wiki.zoneminder.com/Hardware_Compatibility_List>`__
ru: Ищите камеру в разделе `ZoneMinder совместимость с оборудованием wiki <https://wiki.zoneminder.com/Hardware_Compatibility_List>`__

source: Look for the camera or ask questions in the `ZoneMinder Hardware Compatibility Forum <https://forums.zoneminder.com/viewforum.php?f=10&sid=1778ce18ebd267e36da01158e502cd11>`__
ru: Поищите камеру или задайте вопросы в форуме `Зона наблюдения за оборудованием <https://forums.zoneminder.com/viewforum.php?f=10&sid=1778ce18ebd267e36da01158e502cd11>`__.

source: Use a third party website with camera database such as `Camera Connection Database <https://www.ispyconnect.com/cameras>`__
ru: Используйте сторонний веб-сайт с базой данных камер, такой как `Камера Коннект База Данных <https://www.ispyconnect.com/cameras>`__

source: **Username**: The username of camera stream. Note that if your URL contains camera authentication these may be automatically populated into the Username and Password fields.
ru: **Имя пользователя**: Имя пользователя потока камеры. Обратите внимание, что если ваш URL содержит аутентификацию камеры, эти данные могут автоматически заполняться в полях "Имя пользователя" и "Пароль".

source: **Password**: The password of camera stream. Note that if your URL contains camera authentication these may be automatically populated into the Username and Password fields.
ru: **Пароль**: Пароль потока камеры. Обратите внимание, что если ваш URL содержит аутентификацию камеры, эти данные могут автоматически заполнить поля Имя пользователя и Пароль.

source: **Method**:
ru: **Метод**:

source: **TCP**: This is the default and preferred option. TCP is a reliable but slower protocol as it has more overhead. Some older cameras do not support it.
ru: **TCP**: Это стандартный и предпочтительный вариант. TCP - надежный, но более медленный протокол, так как он имеет больше накладных расходов. Некоторые старые камеры его не поддерживают.

source: **UDP**: UDP is an faster but less reliable protocol. Some cameras will display smearing effects due to lost or out of order packets. These can be fixed by either using TCP, or specify ``reorder_queue_size=xx`` in Options.
ru: **UDP**: UDP является более быстрым, но менее надежным протоколом. Некоторые камеры будут отображать размытые эффекты из-за потерянных или пакетов в неправильном порядке. Эти проблемы можно решить, используя TCP, или указав "reorder_queue_size=xx" в опциях.

source: **UDP Multicast**: Multicast is when the camera broadcasts the video once on the network and ZoneMinder subscribes to and receives the video. This is more efficient when there are multiple viewers.
ru: **UDP Multicast**: Мультикастинг - это когда камера транслирует видео один раз по сети, а Zoneminder подписывается на него и получает. Это более эффективно, когда есть несколько зрителей.

source: **HTTP Tunnel**: Tunnel RTSP over HTTP.
ru: **HTTP Tunnel**: Туннелирование RTSP через HTTP.

source: **Options**: Here you can pass various settings to the FFmpeg libraries. Common options include ``reorder_queue_size`` and ``allowed_media_types``.
ru: **Варианты**: Здесь вы можете передать различные настройки библиотекам FFmpeg. Общие опции включают "размер очереди перестановки" и "разрешенные типы медиа".

source: **SourceSecondPath**: This can be used to define a second stream for this Monitor. Enter URL path for second stream. The target use case is for a low resolution substream to use for analysis which can trigger recording on the main high resolution stream.
ru: **Второй источник**: Это можно использовать для определения второго потока для этого Монитора. Введите путь URL для второго потока. Целью целевого случая является низкоразрешенный подпоток, который можно использовать для анализа, который может вызвать запись на основном высокоразрешенном потоке.

source: New Feature in ZoneMinder 1.37
ru: Новая функция в ZoneMinder 1.37

source: Note that the **SourceSecondPath** feature was added in ZoneMinder 1.37 and is not yet fully supported. Use at your own risk with expectation that functionality may change in the future.
ru: Обратите внимание, что функция **SourceSecondPath** была добавлена в ZoneMinder 1.37 и еще не полностью поддерживается. Используйте на свой страх и риск, с ожиданием того, что функциональность может измениться в будущем.

source: **Decoder**: Selection of the FFmpeg decoder. In most cases leave at default Auto setting. The pulldown menu lists the available decoders.
ru: **Декодер**: Выбор декодера FFmpeg. В большинстве случаев оставьте настройки по умолчанию Auto. Меню переключения предлагает доступные декодеры.

source: **DecoderHWAccelName**: Option to support GPU hardware acceleration. This is equivalent to the ``ffmpeg -hwaccels <device>`` command line option. With Intel graphics support, use ``vaapi``. For NVIDIA cuda support use ``cuda``. To check for support, run ``ffmpeg -hwaccels`` on the command line.
ru: **Имя аппаратного ускорителя декодера HWAccel**: Возможность поддержки аппаратного ускорения GPU. Это эквивалентно команде строки командной строки ``ffmpeg -hwaccels <устройство>``. С поддержкой графики Intel используйте ``vaapi``. Для поддержки NVIDIA CUDA используйте ``cuda``. Чтобы проверить поддержку, выполните команду ``ffmpeg -hwaccels`` в командной строке.

source: **DecoderHWAccelDevice**: Option to support GPU hardware acceleration. This is equivalent to the ``ffmpeg -hwaccels <device>`` command line option. You should only have to specify this if you have multiple GPUs. A typical value for Intel VAAPI would be ``/dev/dri/renderD128``.
ru: **ДекодерHWAccelDevice**: Возможность поддержки аппаратного ускорения GPU. Это эквивалентно команде `ffmpeg -hwaccels <устройство>` в строке командной строки. Вам следует указывать это только в том случае, если у вас есть несколько графических процессоров. Типичное значение для Intel VAAPI будет `/dev/dri/renderD128`.

source: Limited GPU support. Note that GPU support has not yet been fully implemented in ZoneMinder. Use at your own risk with expectation that functionality may change in the future.
ru: Поддержка ограниченная GPU. Обратите внимание, что поддержка GPU еще не полностью реализована в ZoneMinder. Используйте на свой страх и риск с ожиданием, что функциональность может измениться в будущем.

source: Source Tab for libVLC
ru: Таблица источников для libVLC

source: The fields for the LibVLC source type are configured the same way as the FFmpeg source type. We recommend only using this source type if issues are experienced with the FFmpeg type.
ru: Поля для типа источника LibVLC настраиваются так же, как и для типа источника FFmpeg. Мы рекомендуем использовать этот тип источника только в том случае, если возникают проблемы с типом источника FFmpeg.

source: Source Tab for Remote
ru: Таблица источников для удаленного доступа

source: The Remote source type is mainly used for older IP cameras that stream using HTTP protocol. Past use of this source type supported RTSP protocol. The Remote -> RTSP method is no longer being maintained and may be removed in the future. If camera supports RTSP we recommend using FFmpeg source type.
ru: Тип удаленного источника в основном используется для старых IP-камер, которые передают данные по протоколу HTTP. В прошлом использование этого типа источника поддерживало протокол RTSP. Метод "Удаленный -> RTSP" больше не поддерживается и может быть удален в будущем. Если камера поддерживает RTSP, мы рекомендуем использовать тип источника FFmpeg.

source: Listed below are the parameters unique to Remote Source. Please also see :ref:`common_source_parameters` section above for information related to the common source parameters which also need to be entered.
ru: Ниже приведены параметры, уникальные для удаленного источника. Пожалуйста, также см. раздел :ref:`общие параметры источника` выше для информации, относящейся к общим параметрам источника, которые также необходимо ввести.

source: **Username**: Enter username of remote device if one is needed for authentication.
ru: **Имя пользователя**: Введите имя пользователя удаленного устройства, если оно требуется для аутентификации.

source: **Password**: Enter password of remote device if one is needed for authentication.
ru: **Пароль**: Введите пароль удаленного устройства, если он требуется для аутентификации.

source: **Protocol**: Choices are currently HTTP and RTSP. Before RTSP became the industry standard, many IP cameras streamed directly from their web interface using HTTP. If the IP camera does not speak RTSP then choose HTTP here. *If the camera does speak RTSP then change your source type to FFmpeg instead of selecting RTSP here.* The Remote -> RTSP method is no longer being maintained and may be removed in the future.
ru: **Протокол**: На данный момент доступны только протоколы HTTP и RTSP. Перед тем как RTSP стал стандартом отрасли, многие IP-камеры транслировали напрямую через свой веб-интерфейс с использованием HTTP. Если IP-камера не говорит по-RTSP, выберите HTTP здесь. *Если камера говорит по-RTSP, измените тип источника на FFmpeg вместо выбора RTSP здесь*. Метод Remote -> RTSP больше не поддерживается и может быть удален в будущем.

source: **Method**: Choices are currently Simple and Regexp. Simple is the default and preferred method. Methods related to RTSP have been removed, please use FFmpeg for RTSP streaming support.
ru: **Метод**: В настоящее время доступны простые и регулярные выражения. Простой метод является по умолчанию и предпочтительным методом. Методы, связанные с RTSP, были удалены, пожалуйста, используйте FFmpeg для поддержки потокового вещания RTSP.

source: Example URL for Remote Source Type: ``http://username:password@hostname.com:port/videoMain``
ru: Пример URL для удаленного типа источника: ``http://username:password@hostname.com:port/videoMain``

source: **Host Name**: Enter the domain part of the URL which is ``hostname.com`` for this example.
ru: **Имя хоста**: Введите часть домена URL, которая является ``hostname.com`` для этого примера.

source: **Port**: Enter port part of the URL which is ``port`` (HTTP commonly uses 80).
ru: **Порт**: Введите часть URL, относящуюся к порту, который обычно используется как ``port`` (обычно используется 80 для HTTP).

source: **Path**: Enter path part of the URL which is ``videoMain`` for this example.
ru: **Путь**: Введите часть пути URL, которая в данном примере является ``videoMain``.

source: Todo
ru: Все

source: Check status of Remote RTSP support in ZoneMinder version 1.37+
ru: Проверьте статус удаленной поддержки RTSP в ZoneMinder версии 1.37+

source: Source Tab for Local
ru: Таблица источников для локального

source: The Local source type is mainly used for locally attached USB cameras or video capture cards.
ru: Тип локального источника в основном используется для локально подключенных USB-камер или карт видеозахвата.

source: Listed below are the parameters unique to Local Source. Please also see :ref:`common_source_parameters` section above for information related to the common source parameters which also need to be entered.
ru: Ниже приведены параметры, уникальные для локального источника. Пожалуйста, также см. раздел :ref:`общие параметры источника` выше для информации, относящейся к общим параметрам источника, которые также необходимо ввести.

source: **Device Path**: Enter the full path to the device file that your camera is attached. Most likely it will be one of ``/dev/video0`` through ``/dev/video63``. Look for the camera in the `ZoneMinder Hardware Compatibility wiki <https://wiki.zoneminder.com/Hardware_Compatibility_List>`__ to see if your capture card or USB webcam is supported or not and any extra settings that may be needed.
ru: **Путь устройства**: Введите полный путь к файлу устройства, к которому подключена ваша камера. Скорее всего, это будет один из `/dev/video0` через `/dev/video63`. Ищите камеру в `Wiki ZoneMinder Hardware Compatibility <https://wiki.zoneminder.com/Hardware_Compatibility_List>`__ , чтобы узнать, поддерживается ли вашей картой захвата или USB-веб-камерой и могут ли потребоваться дополнительные настройки.

source: **Capture Method**: Currently available selection is Video For Linux V2
ru: **Метод захвата**: На данный момент доступный выбор - это Video For Linux V2

source: **Multi Buffering**: Available choices are Yes, No and Use Config Value.
ru: **Мульти буферизация**: Доступные варианты - Да, Нет и Использовать значение конфигурации.

source: **Captures Per Frame**: Default is 1. Acts as a FPS divisor and is mainly useful for video capture cards connected to multiple cameras to slow FPS down.
ru: **Кадры в секунду**: По умолчанию 1. Действует как разделитель кадров и в основном полезен для видеокарт захвата, подключенных к нескольким камерам, чтобы замедлить частоту кадров.

source: Source Tab for File
ru: Таблица источников для файла
