Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/definemonitor/definemonitor_general.po
Languages: ru

source: General Tab
ru: Общий Таблица

source: The General tab contains basic information about the Monitor to help distinguish it to ZoneMinder and the user. One very important parameter to note is the **Source Type** which must match the specific Monitor one wants to add. The selection of source type determines the information required for entry in the Source tab.
ru: Закладка "Общее" содержит базовую информацию о Мониторе, которая поможет отличить его от ZoneMinder и пользователя. Очень важный параметр, на который следует обратить внимание, - это **Тип источника**, который должен соответствовать конкретному Монитору, который вы хотите добавить. Выбор типа источника определяет информацию, которую необходимо ввести в закладку "Источник".

source: Monitor General Tab
ru: Таблица общих мониторов

source: **Id**: ZoneMinder will automatically assign an Id number to each monitor. Leave blank to allow auto assignment. Manual assignment is allowed and can be specified here.
ru: **Id**: ЗонаМиндер автоматически присвоит каждому монитору идентификационный номер. Оставьте поле пустым, чтобы разрешить автоматическое присвоение. Ручное присвоение разрешено и может быть указано здесь.

source: **Name**: The name for your monitor. Anything can be entered here but a description of location, area or purpose is generally useful. Monitor names may only be comprised of alphanumeric characters (a-z,A-Z,0-9), special characters ()_-.: and whitespace.
ru: **Имя**: Имя для вашего монитора. Здесь можно ввести все что угодно, но описание местоположения, области или назначения обычно полезно. Названия мониторов могут состоять только из буквенно-цифровых символов (a-z, A-Z, 0-9), специальных символов (), _, .: и пробелов.

source: **Notes**: Enter any additional information related to this Monitor. This is a purely informational field.
ru: **Примечания**: Введите любую дополнительную информацию, относящуюся к этому Монитору. Это чисто информационное поле.

source: **Manufacturer**: The manufacturer of the camera. You can enter your own or select from the existing entries in the dropdown list. This is a purely informational field.
ru: **Производитель**: Производитель камеры. Вы можете ввести свой или выбрать из существующих записей в выпадающем списке. Это чисто информационное поле.

source: **Model**: The model of the camera. You can enter your own or select from the existing entries in the dropdown list. This is a purely informational field.
ru: **Модель**: Модель камеры. Вы можете ввести свой собственный или выбрать из существующих записей в выпадающем списке. Это чисто информационное поле.

source: **Source Type**: The type of video stream to capture. Depending on the Source type chosen, different parameter options will be available on the Source tab.
ru: **Source Type**: Тип видеопотока для захвата. В зависимости от выбранного типа источника будут доступны различные параметры на вкладке "Источник".

source: **FFmpeg**: For modern network IP cameras the Source type is FFmpeg.
ru: **FFmpeg**: Для современных сетевых IP-камер тип источника - FFmpeg.

source: **Remote**: For older cameras that stream HTTP choose Remote.
ru: **Удаленный**: Для старых камер, которые транслируют HTTP, выберите Удаленный.

source: **Local**: Locally attached USB cameras or capture cards use Local.
ru: **Локальный**: Локальные камеры USB или карты захвата используют Local.

source: **File**: Streaming from a file is possible using the File Source type.
ru: **Файл**: Загрузка из файла возможна с использованием типа источника файлов.

source: **Web Site**: Choose Web Site to use a video stream from the internet.
ru: **Веб-сайт**: Выберите веб-сайт для использования потокового видео из Интернета.

source: **VNC**: To stream from a VNC server choose VNC.
ru: **VNC**: Для стриминга с сервера VNC выберите VNC.

source: **Groups**: Monitors can be combined into groups. This allows a smaller set of Monitors to be viewed at one time in the web interface. This is useful for medium to large ZoneMinder installations. A Monitor can be members of multiple groups.
ru: **Группы**: Мониторы могут быть объединены в группы. Это позволяет просматривать меньшее количество мониторов одновременно в веб-интерфейсе. Это полезно для средних и крупных установок ZoneMinder. Монитор может быть членом нескольких групп.

source: **Triggers**: ZoneMinder can trigger actions based on X10 protocol. X10 support must first be enabled with :guilabel:`OPT_X10` in the Options menu. An alternative to Triggers is to use ``cron`` jobs or other mechanisms to control the camera and keep them completely outside of the ZoneMinder settings. The ``zmtrigger.pl`` script is also available to implement custom external triggering.
ru: **Триггеры**: ZoneMinder может запускать действия на основе протокола X10. Сначала должна быть включена поддержка X10 с помощью :guilabel:`OPT_X10` в меню настроек. Альтернативой триггерам является использование задач cron или других механизмов для управления камерой и полного их исключения из настроек ZoneMinder. Также доступен скрипт ``zmtrigger.pl``, который можно использовать для реализации внешнего триггирования по собственному усмотрению.
