Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/options/options_images.po
Languages: ru

source: Options - Images
ru: Опции - Изображения

source: This screen lets you control various image quality settings for live and recorded events. A partial screenshot is shown below:
ru: Этот экран позволяет управлять различными параметрами качества изображений для прямых и записанных событий. Ниже приведено частичное изображение экрана:

source: COLOUR_JPEG_FILES - Cameras that capture in greyscale can write their captured images to jpeg files with a corresponding greyscale colour space. This saves a small amount of disk space over colour ones. However some tools such as ffmpeg either fail to work with this colour space or have to convert it beforehand. Setting this option to yes uses up a little more space but makes creation of MPEG files much faster.
ru: COLOUR_JPEG_FILES - Камеры, которые снимают в градациях серого, могут записывать свои захваченные изображения в jpeg-файлы с соответствующим цветовым пространством в градациях серого. Это позволяет экономить немного места на диске по сравнению с цветными. Однако некоторые инструменты, такие как ffmpeg, либо не могут работать с этим цветовым пространством, либо должны конвертировать его заранее. Установка этой опции в значение 'да' использует немного больше места, но значительно ускоряет создание MPEG-файлов.

source: ADD_JPEG_COMMENTS - JPEG files may have a number of extra fields added to the file header. The comment field may have any kind of text added. This options allows you to have the same text that is used to annotate the image additionally included as a file header comment. If you archive event images to other locations this may help you locate images for particular events or times if you use software that can read comment headers.
ru: ADD_JPEG_COMMENTS - файлы JPEG могут иметь несколько дополнительных полей, добавленных к заголовку файла. Поле комментариев может содержать любой текст. Этот параметр позволяет иметь тот же текст, который используется для аннотации изображения, дополнительно включенный в комментарий заголовка файла. Если вы архивируете изображения событий в другие места, это может помочь вам найти изображения для конкретных событий или периодов времени, если вы используете программное обеспечение, которое может читать заголовки комментариев.

source: JPEG_FILE_QUALITY - When ZoneMinder detects an event it will save the images associated with that event to files. These files are in the JPEG format and can be viewed or streamed later. This option specifies what image quality should be used to save these files. A higher number means better quality but less compression so will take up more disk space and take longer to view over a slow connection. By contrast a low number means smaller, quicker to view, files but at the price of lower quality images. This setting applies to all images written except if the capture image has caused an alarm and the alarm file quality option is set at a higher value when that is used instead.
ru: JPEG_FILE_QUALITY - Когда ZoneMinder обнаруживает событие, он сохраняет изображения, связанные с этим событием, в файлы. Эти файлы в формате JPEG и их можно просматривать или транслировать позже. Этот параметр определяет, какое качество должно быть использовано для сохранения этих файлов. Более высокое значение означает лучшее качество, но меньшую компрессию, поэтому они будут занимать больше дискового пространства и займут больше времени для просмотра при медленном соединении. С другой стороны, низкое значение означает меньшие, более быстрые для просмотра файлы, но с ценой в виде изображений более низкого качества. Это значение применяется ко всем изображениям, записанным, за исключением случаев, когда кадр захвата вызвал тревогу, и качество файла тревоги установлено на более высоком уровне, когда это используется вместо этого.

source: JPEG_ALARM_FILE_QUALITY - This value is equivalent to the regular jpeg file quality setting above except that it only applies to images saved while in an alarm state and then only if this value is set to a higher quality setting than the ordinary file setting. If set to a lower value then it is ignored. Thus leaving it at the default of 0 effectively means to use the regular file quality setting for all saved images. This is to prevent accidentally saving important images at a worse quality setting.
ru: JPEG_ALARM_FILE_QUALITY - Это значение эквивалентно обычному параметру качества файла jpeg, за исключением того, что оно применяется только к изображениям, сохраненным в состоянии тревоги, и только если это значение установлено на более высокое качество, чем обычное значение файла. Если установлено значение ниже, оно игнорируется. Таким образом, оставление его по умолчанию в значении 0 означает использование обычного параметра качества файла для всех сохраненных изображений. Это делается для предотвращения случайного сохранения важных изображений с худшим качеством настройки.

source: JPEG_STREAM_QUALITY - When viewing a 'live' stream for a monitor ZoneMinder will grab an image from the buffer and encode it into JPEG format before sending it. This option specifies what image quality should be used to encode these images. A higher number means better quality but less compression so will take longer to view over a slow connection. By contrast a low number means quicker to view images but at the price of lower quality images. This option does not apply when viewing events or still images as these are usually just read from disk and so will be encoded at the quality specified by the previous options.
ru: JPEG_STREAM_QUALITY — при просмотре «живого» потока на мониторе ZoneMinder возьмет изображение из буфера и закодирует его в JPEG формат перед отправкой. Этот параметр определяет, какое качество изображения должно использоваться для кодирования этих изображений. Чем больше число, тем выше качество, но меньше сжатие, поэтому при медленном соединении загрузка займет больше времени. Обратное означает более быстрый просмотр изображений, но ценой более низкого качества изображения. Эта опция не применяется при просмотре событий или скриншотов, поскольку они обычно просто считываются с диска, и будут закодированы с качеством, указанным в предыдущих параметрах.

source: MPEG_TIMED_FRAMES - When using streamed MPEG based video, either for live monitor streams or events, ZoneMinder can send the streams in two ways. If this option is selected then the timestamp for each frame, taken from it's capture time, is included in the stream. This means that where the frame rate varies, for instance around an alarm, the stream will still maintain it's 'real' timing. If this option is not selected then an approximate frame rate is calculated and that is used to schedule frames instead. This option should be selected unless you encounter problems with your preferred streaming method.
ru: MPEG_TIMED_FRAMES - При использовании потокового видео на основе MPEG, будь то мониторинг в реальном времени или события, ZoneMinder может отправлять потоки двумя способами. Если этот параметр выбран, то для каждого кадра, взятого из его времени захвата, в поток включена временная метка. Это означает, что, если частота кадров варьируется, например, вокруг тревоги, поток все равно будет поддерживать свое "реальное" время. Если этот параметр не выбран, рассчитывается приблизительная частота кадров и используется для планирования кадров. Этот параметр следует выбирать, если вы не сталкиваетесь с проблемами при использовании предпочитаемого метода потоковой передачи.

source: MPEG_LIVE_FORMAT - When using MPEG mode ZoneMinder can output live video. However what formats are handled by the browser varies greatly between machines. This option allows you to specify a video format using a file extension format, so you would just enter the extension of the file type you would like and the rest is determined from that. The default of 'asf' works well under Windows with Windows Media Player but I'm currently not sure what, if anything, works on a Linux platform. If you find out please let me know! If this option is left blank then live streams will revert to being in motion jpeg format.
ru: MPEG_LIVE_FORMAT - При использовании режима MPEG ZoneMinder может выводить живую видеозапись. Однако формат, с которым работает браузер, сильно варьируется между машинами. Этот параметр позволяет указать формат видео с помощью расширения файла, поэтому вам просто нужно ввести расширение типа файла, который вы хотите использовать, а остальное определяется из этого. По умолчанию 'asf' хорошо работает под Windows с Windows Media Player, но я сейчас не уверен, что, если что-то вообще работает на платформе Linux. Если вы узнаете, пожалуйста, сообщите мне! Если этот параметр оставить пустым, живые потоки будут переведены в формат движущихся JPEG.

source: MPEG_REPLAY_FORMAT - When using MPEG mode ZoneMinder can replay events in encoded video format. However what formats are handled by the browser varies greatly between machines. This option allows you to specify a video format using a file extension format, so you would just enter the extension of the file type you would like and the rest is determined from that. The default of 'asf' works well under Windows with Windows Media Player and 'mpg', or 'avi' etc should work under Linux. If you know any more then please let me know! If this option is left blank then live streams will revert to being in motion jpeg format.
ru: MPEG_REPLAY_FORMAT - При использовании режима MPEG ZoneMinder может воспроизводить события в формате закодированного видео. Однако форматы, поддерживаемые браузером, сильно различаются между машинами. Этот параметр позволяет указать формат видео с использованием расширения файла, поэтому вам просто нужно ввести расширение типа файла, который вы хотите, а остальное определяется из этого. По умолчанию 'asf' хорошо работает под Windows с Windows Media Player и 'mpg', или 'avi' и т. д. должны работать под Linux. Если вы знаете еще какие-нибудь, пожалуйста, сообщите мне! Если этот параметр оставлен пустым, прямые трансляции будут переведены в формат движущихся JPEG.

source: RAND_STREAM - Some browsers can cache the streams used by ZoneMinder. In order to prevent this a harmless random string can be appended to the url to make each invocation of the stream appear unique.
ru: RAND_STREAM - Некоторые браузеры могут кэшировать потоки, используемые ZoneMinder. Чтобы предотвратить это, к URL можно добавить безобидную случайную строку, чтобы каждое обращение к потоку выглядело уникальным.

source: OPT_CAMBOZOLA - Cambozola is a handy low fat cheese flavoured Java applet that ZoneMinder uses to view image streams on browsers such as Internet Explorer that don't natively support this format. If you use this browser it is highly recommended to install this from `this link <http://www.charliemouse.com/code/cambozola/>`__ however if it is not installed still images at a lower refresh rate can still be viewed. Note that practically, if you are not using an old version of IE, you will likely not need this.
ru: OPT_CAMBOZOLA - Камбозола - это удобный низкокалорийный сырный аплет Java, который используется ZoneMinder для просмотра потоков изображений в браузерах, таких как Internet Explorer, которые не поддерживают этот формат по умолчанию. Если вы используете этот браузер, рекомендуется установить его по ссылке `http://www.charliemouse.com/code/cambozola/` однако даже если он не установлен, все еще можно просматривать статические изображения с более низкой частотой обновления. Примечание: практически говоря, если вы не используете старую версию IE, вам, вероятно, не понадобится это.

source: PATH_CAMBOZOLA - Leave this as 'cambozola.jar' if cambozola is installed in the same directory as the ZoneMinder web client files.
ru: PATH_CAMBOZOLA - Оставьте это как 'cambozola.jar', если cambozola установлен в той же директории, что и файлы веб-клиента ZoneMinder.

source: RELOAD_CAMBOZOLA - Cambozola allows for the viewing of streaming MJPEG however it caches the entire stream into cache space on the computer, setting this to a number > 0 will cause it to automatically reload after that many seconds to avoid filling up a hard drive.
ru: RELOAD_CAMBOZOLA - Cambozola позволяет просматривать потоковое MJPEG, однако она кэширует весь поток в пространство для хранения на компьютере, установив это значение больше 0, вы заставите его автоматически перезагружаться через определенное количество секунд, чтобы избежать заполнения жесткого диска.

source: OPT_FFMPEG - ZoneMinder can optionally encode a series of video images into an MPEG encoded movie file for viewing, downloading or storage. This option allows you to specify whether you have the ffmpeg tools installed. Note that creating MPEG files can be fairly CPU and disk intensive and is not a required option as events can still be reviewed as video streams without it.
ru: OPT_FFMPEG - ZoneMinder может опционально кодировать серию видеоизображений в файл MPEG-кодированного видео для просмотра, загрузки или хранения. Этот параметр позволяет вам указать, установлены ли у вас инструменты ffmpeg. Обратите внимание, что создание файлов MPEG может быть довольно интенсивным по процессору и диску и не является обязательным параметром, поскольку события все равно можно просматривать в виде потокового видео без него.

source: PATH_FFMPEG - This path should point to where ffmpeg has been installed.
ru: PATH_FFMPEG - Этот путь должен указывать на место установки ffmpeg.

source: FFMPEG_INPUT_OPTIONS - Ffmpeg can take many options on the command line to control the quality of video produced. This option allows you to specify your own set that apply to the input to ffmpeg (options that are given before the -i option). Check the ffmpeg documentation for a full list of options which may be used here.
ru: FFMPEG_INPUT_OPTIONS - Ffmpeg может принимать множество вариантов на командной строке для управления качеством видео, которое он производит. Этот параметр позволяет вам указать свой собственный набор, который применяется к входным данным ffmpeg (варианты, которые даются перед опцией -i). Проверьте документацию ffmpeg для полного списка опций, которые могут быть использованы здесь.

source: FFMPEG_OUTPUT_OPTIONS - Ffmpeg can take many options on the command line to control the quality of video produced. This option allows you to specify your own set that apply to the output from ffmpeg (options that are given after the -i option). Check the ffmpeg documentation for a full list of options which may be used here. The most common one will often be to force an output frame rate supported by the video encoder.
ru: FFMPEG_OUTPUT_OPTIONS - Ffmpeg может принимать множество опций на командной строке для управления качеством видео, которое производится. Эта опция позволяет вам указать свой собственный набор, который применяется к выходу из ffmpeg (опции, которые даются после опции -i). Проверьте документацию ffmpeg для полного списка опций, которые могут быть использованы здесь. Наиболее распространенной будет частота кадров выходного кадра, поддерживаемая видеокодером.

source: FFMPEG_FORMATS - Ffmpeg can generate video in many different formats. This option allows you to list the ones you want to be able to select. As new formats are supported by ffmpeg you can add them here and be able to use them immediately. Adding a '*' after a format indicates that this will be the default format used for web video, adding '**' defines the default format for phone video.
ru: FFMPEG_FORMATS - FFmpeg может генерировать видео в различных форматах. Этот параметр позволяет вам указать те, которые вы хотите иметь возможность выбирать. По мере того как новые форматы поддерживаются ffmpeg, вы можете добавлять их сюда и сразу же использовать. Добавление звездочки после формата указывает, что это будет основным форматом для веб-видео, добавление двух звездочек определяет основной формат для телефонного видео.

source: FFMPEG_OPEN_TIMEOUT - When Ffmpeg is opening a stream, it can take a long time before failing; certain circumstances even seem to be able to lock indefinitely. This option allows you to set a maximum time in seconds to pass before closing the stream and trying to reopen it again.
ru: OPEN_TIMEOUT_FFMPEG - Когда ffmpeg открывает поток, может пройти много времени, прежде чем он завершится неудачно; в определенных обстоятельствах даже кажется, что он может заблокироваться навсегда. Этот параметр позволяет вам установить максимальное время в секундах, которое должно пройти, прежде чем закрыть поток и попытаться снова его открыть.
