Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/options/options_system.po
Languages: ru

source: RUN_AUDIT - The zmaudit daemon exists to check that the saved information in the database and on the filesystem match and are consistent with each other. If an error occurs or if you are using 'fast deletes' it may be that database records are deleted but files remain. In this case, and similar, zmaudit will remove redundant information to synchronise the two data stores. This option controls whether zmaudit is run in the background and performs these checks and fixes continuously. It is recommended you keep this **OFF** in most systems and run it manually if needed after a system crash.
ru: RUN_AUDIT - Демон zmaudit существует для проверки того, что информация, сохраненная в базе данных и на файловой системе, совпадают и согласованы друг с другом. Если возникает ошибка или если вы используете 'быстрые удаления', возможно, записи в базе данных будут удалены, но файлы останутся. В этом случае, и аналогичном, zmaudit удалит избыточную информацию, чтобы синхронизировать два хранилища данных. Этот параметр контролирует, запускается ли zmaudit в фоновом режиме и выполняет эти проверки и исправления непрерывно. Рекомендуется, чтобы вы оставили этот **OFF** в большинстве систем и запускали его вручную, если это необходимо, после сбоя системы.

source: AUDIT_CHECK_INTERVAL - The zmaudit daemon exists to check that the saved information in the database and on the filesystem match and are consistent with each other. If an error occurs or if you are using 'fast deletes' it may be that database records are deleted but files remain. In this case, and similar, zmaudit will remove redundant information to synchronise the two data stores. The default check interval of 900 seconds (15 minutes) is fine for most systems however if you have a very large number of events the process of scanning the database and filesystem may take a long time and impact performance. In this case you may prefer to make this interval much larger to reduce the impact on your system. This option determines how often these checks are performed.
ru: AUDIT_CHECK_INTERVAL - Демон zmaudit существует для проверки того, что информация, сохраненная в базе данных и на файловой системе, совпадают и согласованы друг с другом. Если возникает ошибка или если вы используете 'быстрые удаления', возможно, что записи в базе данных будут удалены, но файлы останутся. В этом случае, и аналогичном, zmaudit удалит избыточную информацию, чтобы синхронизировать два хранилища данных. По умолчанию интервал проверки составляет 900 секунд (15 минут), что хорошо для большинства систем, однако, если у вас очень большое количество событий, процесс сканирования базы данных и файловой системы может занять много времени и повлиять на производительность. В этом случае вы можете предпочесть сделать этот интервал намного больше, чтобы снизить нагрузку на вашу систему. Этот параметр определяет, как часто будут выполняться эти проверки.

source: AUDIT_MIN_AGE - The zmaudit daemon exists to check that the saved information in the database and on the filesystem match and are consistent with each other. Event files or db records that are younger than this setting will not be deleted and a warning will be given
ru: AUDIT_MIN_AGE - Демон zmaudit существует для проверки того, что информация, сохраненная в базе данных и на файловой системе, совпадают и согласованы друг с другом. Файлы событий или записи в базе данных, которые моложе этого значения, не будут удалены, и будет дано предупреждение

source: OPT_CONTROL - ZoneMinder includes limited support for controllable cameras. A number of sample protocols are included and others can easily be added. If you wish to control your cameras via ZoneMinder then select this option otherwise if you only have static cameras or use other control methods then leave this option off.
ru: OPT_CONTROL - ЗонаМинер включает ограниченную поддержку управляемых камер. Включены несколько примеров протоколов, и другие могут легко быть добавлены. Если вы хотите управлять своими камерами через ЗонаМинер, выберите этот вариант, а если у вас только статические камеры или вы используете другие методы управления, оставьте этот вариант.

source: OPT_TRIGGERS - ZoneMinder can interact with external systems which prompt or cancel alarms. This is done via the zmtrigger.pl script. This option indicates whether you want to use these external triggers. Most people will say no here.
ru: OPT_TRIGGERS - ZoneMinder может взаимодействовать с внешними системами, которые вызывают или отменяют сигналы тревоги. Это делается с помощью скрипта zmtrigger.pl. Этот параметр указывает, хотите ли вы использовать эти внешние триггеры. Большинство людей скажут нет здесь.

source: CHECK_FOR_UPDATES - To save checking manually for each new version ZoneMinder can check with the zoneminder.com website to determine the most recent release. These checks are infrequent, about once per week, and no personal or system information is transmitted other than your current version number. If you do not wish these checks to take place or your ZoneMinder system has no internet access you can switch these check off with this configuration variable.
ru: ПРОВЕРКА НА ОБНОВЛЕНИЯ - Чтобы не проверять вручную каждую новую версию ZoneMinder, он может проверить веб-сайт ZoneMinder.com, чтобы определить самую последнюю версию. Эти проверки происходят редко, примерно раз в неделю, и не передается никакая личная или системная информация, кроме вашего текущего номера версии. Если вы не хотите, чтобы эти проверки происходили или у вашей системы ZoneMinder нет доступа в интернет, вы можете отключить эти проверки с помощью этого конфигурационного параметра.

source: TELEMETRY_DATA - Enable collection of usage information of the local system and send it to the ZoneMinder development team. This data will be used to determine things like who and where our customers are, how big their systems are, the underlying hardware and operating system, etc. This is being done for the sole purpose of creating a better product for our target audience. This script is intended to be completely transparent to the end user, and can be disabled from the web console under Options. For more details on what information we collect, please refer to Zoneminder's privacy statement (available in the contextual help of TELEMETRY_DATA on your installation).
ru: ТЕЛЕМЕТРИЯ_ДАННЫЕ - Включить сбор информации о использовании локальной системы и отправку ее в команду разработчиков ZoneMinder. Эта информация будет использоваться для определения таких вещей, как кто и где наши клиенты, насколько велики их системы, аппаратное и программное обеспечение, и т.д. Это делается исключительно для создания лучшего продукта для нашей целевой аудитории. Этот скрипт предназначен для полной прозрачности для конечного пользователя и может быть отключен через веб-консоль под опциями. Для получения более подробной информации о том, какую информацию мы собираем, пожалуйста, обратитесь к заявлению о конфиденциальности ZoneMinder (доступно в контекстной помощи TELEMETRY_DATA на вашей установке).

source: UPDATE_CHECK_PROXY - If you use a proxy to access the internet then ZoneMinder needs to know so it can access zoneminder.com to check for updates. If you do use a proxy enter the full proxy url here in the form of ``http://<proxy host>:<proxy port>/``.
ru: UPDATE_CHECK_PROXY - Если вы используете прокси для доступа в интернет, ZoneMinder должен знать об этом, чтобы иметь возможность проверить наличие обновлений на zoneminder.com. Если вы все же используете прокси, введите полный URL-адрес прокси в виде ``http://<хост прокси>:<порт прокси>``.

source: SHM_KEY - ZoneMinder uses shared memory to speed up communication between modules. To identify the right area to use shared memory keys are used. This option controls what the base key is, each monitor will have it's Id or'ed with this to get the actual key used. You will not normally need to change this value unless it clashes with another instance of ZoneMinder on the same machine. Only the first four hex digits are used, the lower four will be masked out and ignored.
ru: SHM_KEY - Зонд Зонд использует общую память для ускорения обмена данными между модулями. Для определения правильной области используются ключи общей памяти. Этот параметр контролирует, какой базовый ключ используется, каждый монитор будет иметь свой идентификатор или объединенный с этим для получения фактического ключа, используемого. Вы обычно не будете менять это значение, если оно конфликтует с другой копией ZoneMinder на том же компьютере. Используются только первые четыре шестнадцатеричных цифры, нижние четыре будут маскироваться и игнорироваться.

source: COOKIE_LIFETIME - This will affect how long a session will be valid for since the last request. Keeping this short helps prevent session hijacking. Keeping it long allows you to stay logged in longer without refreshing the view. We recommend you keep this to the default of ``3600`` if you are not sure.
ru: COOKIE_LIFETIME - Это повлияет на то, как долго сессия будет действительна с момента последнего запроса. Удержание этого коротким помогает предотвратить захват сессии. Удержание его длинным позволяет оставаться авторизованным дольше без обновления представления. Мы рекомендуем вам держать это на уровне по умолчанию "3600", если вы не уверены.
