Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/options/options_bw.po
Languages: ru

source: Options - High, Medium and Low B/W
ru: Варианты - Высокий, Средний и Низкий Ч/Б

source: There are a number of options that are grouped into bandwidth categories, this allows you to configure the ZoneMinder client to work optimally over the various access methods you might to access the client. You may want to use different modes depending on your network to preserve bandwidth.
ru: Есть несколько вариантов, которые объединены в категории пропускной способности, что позволяет вам настроить клиент ZoneMinder для работы оптимально через различные методы доступа, которыми вы можете воспользоваться. Вы можете захотеть использовать разные режимы в зависимости от вашей сети, чтобы экономить пропускную способность.

source: A partial screenshot is shown below:
ru: Представлен снимок экрана:

source: The following options are available in H, M and L options. These 3 groups control what happens when the client is running in 'high', 'medium' and 'low' bandwidth mode respectively. In most cases the default values will be suitable as a starting point.
ru: Следующие варианты доступны в группах H, M и L. Эти 3 группы контролируют, что происходит, когда клиент работает в режиме высокой, средней и низкой пропускной способности соответственно. В большинстве случаев начальные значения по умолчанию будут подходящими.

source: High - You should set these options for when accessing the ZoneMinder client over a local network or high speed link.
ru: Высокий - Вам следует установить эти параметры при доступе к клиенту ZoneMinder через локальную сеть или высокоскоростную связь.

source: Medium - You should set these options for when accessing the ZoneMinder client over a slower cable or DSL link.
ru: Средний - Вам следует установить эти параметры при доступе к клиенту ZoneMinder через медленный кабель или модем DSL.

source: Slow - You should set these options for when accessing Zoneminder client over a slow network link.
ru: Медленный - Вам следует установить эти параметры при доступе к клиенту Zoneminder через медленную сетевую связь.

source: WEB_H_REFRESH_MAIN, WEB_M_REFRESH_MAIN, WEB_L_REFRESH_MAIN - How often (in seconds) the main console window should refresh itself. The main console window lists a general status and the event totals for all monitors. This is not a trivial task and should not be repeated too frequently or it may affect the performance of the rest of the system.
ru: WEB_H_REFRESH_MAIN, WEB_M_REFRESH_MAIN, WEB_L_REFRESH_MAIN - Как часто (в секундах) главная консольная окно должно обновляться само по себе. Главная консольная окно отображает общий статус и общее количество событий для всех мониторов. Это не тривиальная задача и не должна повторяться слишком часто, иначе это может повлиять на производительность остальной системы.

source: WEB_H_REFRESH_CYCLE, WEB_M_REFRESH_CYCLE, WEB_L_REFRESH_CYCLE - How often (in seconds) the cycle watch window swaps to the next monitor. The cycle watch window is a method of continuously cycling between images from all of your monitors. This option determines how often to refresh with a new image.
ru: WEB_H_REFRESH_CYCLE, WEB_M_REFRESH_CYCLE, WEB_L_REFRESH_CYCLE - Как часто (в секундах) цикл обновления окна просмотра переключается на следующий монитор. Цикл просмотра окна - это метод непрерывного переключения между изображениями со всех ваших мониторов. Этот параметр определяет, как часто следует обновлять с новым изображением.

source: WEB_H_REFRESH_IMAGE, WEB_M_REFRESH_IMAGE, WEB_L_REFRESH_IMAGE - How often (in seconds) the watched image is refreshed (if not streaming). The live images from a monitor can be viewed in either streamed or stills mode. This option determines how often a stills image is refreshed, it has no effect if streaming is selected.
ru: WEB_H_REFRESH_IMAGE, WEB_M_REFRESH_IMAGE, WEB_L_REFRESH_IMAGE - Как часто (в секундах) обновляется просматриваемое изображение (если не транслируется в реальном времени). Изображения с монитора можно просматривать в режиме потокового вещания или в режиме неподвижных изображений. Этот параметр определяет, как часто обновляется неподвижное изображение, он не влияет, если выбран режим потокового вещания.

source: WEB_H_REFRESH_STATUS, WEB_M_REFRESH_STATUS, WEB_L_REFRESH_STATUS - How often (in seconds) the status refreshes itself in the watch window. The monitor window is actually made from several frames. The one in the middle merely contains a monitor status which needs to refresh fairly frequently to give a true indication. This option determines that frequency.
ru: WEB_H_REFRESH_STATUS, WEB_M_REFRESH_STATUS, WEB_L_REFRESH_STATUS - Как часто (в секундах) статус обновляется сам по себе в окне просмотра. Мониторное окно на самом деле состоит из нескольких рамок. Одна в центре содержит только статус монитора, который должен обновляться довольно часто, чтобы дать истинное представление. Этот параметр определяет эту частоту.

source: WEB_H_REFRESH_EVENTS, WEB_M_REFRESH_EVENTS, WEB_L_REFRESH_EVENTS - How often (in seconds) the event listing is refreshed in the watch window. The monitor window is actually made from several frames. The lower framme contains a listing of the last few events for easy access. This option determines how often this is refreshed.
ru: WEB_H_REFRESH_EVENTS, WEB_M_REFRESH_EVENTS, WEB_L_REFRESH_EVENTS - Как часто (в секундах) обновляется список событий в окне просмотра. На самом деле мониторное окно состоит из нескольких рамок. Нижняя рамка содержит список последних событий для удобного доступа. Этот параметр определяет, как часто это обновляется.

source: WEB_H_CAN_STREAM, WEB_M_CAN_STREAM, WEB_L_CAN_STREAM - If you know that your browser can handle image streams of the type 'multipart/x-mixed-replace' but ZoneMinder does not detect this correctly you can set this option to ensure that the stream is delivered with or without the use of the Cambozola plugin. Selecting 'yes' will tell ZoneMinder that your browser can handle the streams nativ
ru: WEB_H_CAN_STREAM, WEB_M_CAN_STREAM, WEB_L_CAN_STREAM - Если вы знаете, что ваш браузер может обрабатывать потоки изображений типа 'multipart/x-mixed-replace', но Zoneminder не обнаруживает это правильно, вы можете установить этот параметр, чтобы убедиться, что поток доставляется с использованием или без использования плагина Cambozola. Выбрав 'да', вы сообщите Zoneminder, что ваш браузер может обрабатывать потоки нативно

source: WEB_H_STREAM_METHOD, WEB_M_STREAM_METHOD, WEB_H_STREAM_METHOD - ZoneMinder can be configured to use either mpeg encoded video or a series or still jpeg images when sending video streams. This option defines which is used. If you choose mpeg you should ensure that you have the appropriate plugins available on your browser whereas choosing jpeg will work natively on Mozilla and related browsers and with a Java applet on Internet Explorer
ru: WEB_H_STREAM_METHOD, WEB_M_STREAM_METHOD, WEB_H_STREAM_METHOD - ZoneMinder может быть сконфигурирована для использования либо видео в формате mpeg, либо серии или статических изображений JPEG при отправке потоков видео. Этот параметр определяет, что используется. Если вы выбираете mpeg, убедитесь, что у вас есть соответствующие плагины на вашем браузере, а выбор JPEG будет работать нативно в Mozilla и связанных браузерах и с Java-апплетом в Internet Explorer

source: WEB_H_DEFAULT_SCALE, WEB_M_DEFAULT_SCALE, WEB_L_DEFAULT_SCALE - Normally ZoneMinder will display 'live' or 'event' streams in their native size. However if you have monitors with large dimensions or a slow link you may prefer to reduce this size, alternatively for small monitors you can enlarge it. This options lets you specify what the default scaling factor will be. It is expressed as a percentage so 100 is normal size, 200 is double size etc.
ru: WEB_H_DEFAULT_SCALE, WEB_M_DEFAULT_SCALE, WEB_L_DEFAULT_SCALE - Обычно ЗонаЗейдер будет отображать 'живые' или 'событийные' потоки в их исходном размере. Однако, если у вас есть мониторы с большими размерами или медленным соединением, вы можете предпочесть уменьшить этот размер, альтернативно для маленьких мониторов вы можете увеличить его. Этот параметр позволяет вам определить, какое будет значение по умолчанию для масштабирования. Оно выражается в процентах, поэтому 100 - это нормальный размер, 200 - это размер в два раза больше и т.д.

source: WEB_H_DEFAULT_RATE, WEB_M_DEFAULT_RATE, WEB_L_DEFAULT_RATE - Normally ZoneMinder will display 'event' streams at their native rate, i.e. as close to real-time as possible. However if you have long events it is often convenient to replay them at a faster rate for review. This option lets you specify what the default replay rate will be. It is expressed as a percentage so 100 is normal rate, 200 is double speed etc.
ru: WEB_H_DEFAULT_RATE, WEB_M_DEFAULT_RATE, WEB_L_DEFAULT_RATE - Обычно ZoneMinder отображает 'события' в их родном темпе, т.е. как можно ближе к реальному времени. Однако, если у вас длинные события, часто бывает удобно воспроизводить их с более высокой скоростью для обзора. Этот параметр позволяет указать, какое будет значение по умолчанию для повтора. Он выражается в процентах, поэтому 100 - это нормальный темп, 200 - это в два раза быстрее и т.д.

source: WEB_H_VIDEO_BITRATE, WEB_M_VIDEO_BITRATE, WEB_L_VIDEO_BITRATE - When encoding real video via the ffmpeg library a bit rate can be specified which roughly corresponds to the available bandwidth used for the stream. This setting effectively corresponds to a 'quality' setting for the video. A low value will result in a blocky image whereas a high value will produce a clearer view. Note that this setting does not control the frame rate of the video however the quality of the video produced is affected both by this setting and the frame rate that the video is produced at. A higher frame rate at a particular bit rate result in individual frames being at a lower quality.
ru: WEB_H_VIDEO_BITRATE, WEB_M_VIDEO_BITRATE, WEB_L_VIDEO_BITRATE - При кодировании реального видео через библиотеку ffmpeg можно указать битрейт, который примерно соответствует пропускной способности канала, используемого для потока. Это значение фактически соответствует параметру качества видео. Низкое значение приведет к появлению блочного изображения, а высокое - к более четкому изображению. Обратите внимание, что это значение не контролирует частоту кадров видеоролика, однако качество видео, которое получается, зависит как от этого значения, так и от частоты кадров, при которой видео создается. Более высокая частота кадров при определенном битрейте приводит к тому, что отдельные кадры имеют более низкое качество.

source: WEB_H_VIDEO_MAXFPS, WEB_M_VIDEO_MAXFPS, WEB_L_VIDEO_MAXFPS - When using streamed video the main control is the bitrate which determines how much data can be transmitted. However a lower bitrate at high frame rates results in a lower quality image. This option allows you to limit the maximum frame rate to ensure that video quality is maintained. An additional advantage is that encoding video at high frame rates is a processor intensive task when for the most part a very high frame rate offers little perceptible improvement over one that has a more manageable resource requirement. Note, this option is implemented as a cap beyond which binary reduction takes place. So if you have a device capturing at 15fps and set this option to 10fps then the video is not produced at 10fps, but rather at 7.5fps (15 divided by 2) as the final frame rate must be the original divided by a power of 2.
ru: WEB_H_VIDEO_MAXFPS, WEB_M_VIDEO_MAXFPS, WEB_L_VIDEO_MAXFPS - При использовании потокового видео основным контролем является битрейт, который определяет, сколько данных может быть передано. Однако при низком битрейте при высоких скоростях кадров получается изображение низкого качества. Этот параметр позволяет ограничить максимальную скорость кадров, чтобы обеспечить поддержание качества видео. Дополнительным преимуществом является то, что кодирование видео при высоких скоростях кадров - это ресурсоемкая задача для процессора, когда в большинстве случаев очень высокая скорость кадров предлагает мало заметное улучшение по сравнению с той, которая имеет более разумные требования к ресурсам. Обратите внимание, что этот параметр реализован как предел, за которым происходит бинарное сокращение. Таким образом, если устройство записывает со скоростью 15 кадров в секунду и установило этот параметр на 10 кадров в секунду, видео не будет производиться со скоростью 10 кадров в секунду, а скорее со скоростью 7,5 кадров в секунду (15, деленное на 2), поскольку конечная скорость кадров должна быть исходной, разделенной на степень двойки.

source: WEB_H_SCALE_THUMBS, WEB_M_SCALE_THUMBS, WEB_L_SCALE_THUMBS - If unset, this option sends the whole image to the browser which resizes it in the window. If set the image is scaled down on the server before sending a reduced size image to the browser to conserve bandwidth at the cost of cpu on the server. Note that ZM can only perform the resizing if the appropriate PHP graphics functionality is installed. This is usually available in the php-gd package.
ru: WEB_H_SCALE_THUMBS, WEB_M_SCALE_THUMBS, WEB_L_SCALE_THUMBS - Если этот параметр не установлен, он отправляет весь файл изображения в браузер, который затем масштабирует его в окне. Если установлен, изображение масштабируется на сервере перед отправкой уменьшенного размера изображения в браузер для экономии полосы пропускания за счет использования ресурсов процессора на сервере. Обратите внимание, что ZM может выполнять масштабирование только в том случае, если на сервере установлена соответствующая функциональность графики PHP. Это обычно доступно в пакете php-gd.

source: WEB_H_EVENTS_VIEW, WEB_M_EVENTS_VIEW, WEB_L_EVENTS_VIEW - Stored events can be viewed in either an events list format or in a timeline based one. This option sets the default view that will be used. Choosing one view here does not prevent the other view being used as it will always be selectable from whichever view is currently being used.
ru: WEB_H_EVENTS_VIEW, WEB_M_EVENTS_VIEW, WEB_L_EVENTS_VIEW - Сохраненные события можно просматривать в формате списка событий или в формате временной шкалы. Этот параметр устанавливает по умолчанию вид, который будет использоваться. Выбор одного вида здесь не препятствует использованию другого вида, так как он всегда будет доступен для выбора из того вида, который используется в данный момент.

source: WEB_H_SHOW_PROGRESS, WEB_M_SHOW_PROGRESS, WEB_L_SHOW_PROGRESS - When viewing events an event navigation panel and progress bar is shown below the event itself. This allows you to jump to specific points in the event, but can can also dynamically update to display the current progress of the event replay itself. This progress is calculated from the actual event duration and is not directly linked to the replay itself, so on limited bandwidth connections may be out of step with the replay. This option allows you to turn off the progress display, whilst still keeping the navigation aspect, where bandwidth prevents it functioning effectively.
ru: WEB_H_SHOW_PROGRESS, WEB_M_SHOW_PROGRESS, WEB_L_SHOW_PROGRESS - При просмотре событий панель навигации по событиям и ползунок прогресса отображаются под самим событием. Это позволяет перейти к конкретным точкам в событии, но также может динамически обновляться для отображения текущего прогресса воспроизведения самого события. Этот прогресс рассчитывается на основе фактической продолжительности события и не напрямую связан с воспроизведением, поэтому на ограниченных каналах связи он может отставать от воспроизведения. Эта опция позволяет отключить отображение прогресса, при этом сохраняя навигационную функцию, когда пропускная способность не позволяет ей эффективно функционировать.

source: WEB_H_AJAX_TIMEOUT, WEB_M_AJAX_TIMEOUT, WEB_L_AJAX_TIMEOUT - The newer versions of the live feed and event views use Ajax to request information from the server and populate the views dynamically. This option allows you to specify a timeout if required after which requests are abandoned. A timeout may be necessary if requests would otherwise hang such as on a slow connection. This would tend to consume a lot of browser memory and make the interface unresponsive. Ordinarily no requests should timeout so this setting should be set to a value greater than the slowest expected response. This value is in milliseconds but if set to zero then no timeout will be used.
ru: WEB_H_AJAX_TIMEOUT, WEB_M_AJAX_TIMEOUT, WEB_L_AJAX_TIMEOUT - Более новые версии живого потока и просмотра событий используют Ajax для запроса информации с сервера и динамического заполнения представлений. Этот параметр позволяет вам указать время ожидания, если это необходимо, после которого запросы будут отменены. Время ожидания может потребоваться, если запросы иначе будут висеть, например, при медленном соединении. Это приведет к потреблению большого количества памяти браузера и сделает интерфейс невосприимчивым. Обычно никаких запросов не должно быть сброшено, поэтому этот параметр должен быть установлен на значение больше, чем самое медленное ожидаемое время ответа. Это значение в миллисекундах, но если установить его равным нулю, то время ожидания использоваться не будет.
