Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/options/options_storage.po
Languages: ru

source: Options - Storage
ru: Варианты - хранилище

source: Storage tab is used to setup storage areas for recorded Events. To add a new area use the Add New Storage button.
ru: Таблица "Хранилище" используется для настройки областей хранения для записанных событий. Чтобы добавить новую область, используйте кнопку "Добавить новое хранилище".

source: By default storage on local drive is automatically set up on installation. When no area is specified events will be stored to a default built-in location, which for example on Ubuntu is /var/cache/zoneminder/events.
ru: По умолчанию хранилище на локальном диске автоматически настраивается при установке. Когда не указывается область, события будут сохраняться в стандартное встроенное местоположение по умолчанию, которое, например, для Ubuntu находится по адресу /var/cache/zoneminder/events.

source: Name: Storage names - can be anything
ru: Имя: Названия хранилищ - могут быть чем угодно

source: Path: String path to storage location for example /media/Videos
ru: Путь: строка, указывающая место хранения, например, /медиа/Видео

source: Url: Used for S3 communication - format ``s3fs://ACCESS_KEY_ID:SECRET_ACCESS_KEY@s3.ca-central-1.amazonaws.com/bucket-name/events``
ru: URL: Используется для коммуникации с S3 - формат "s3fs://ACCESS_KEY_ID:SECRET_ACCESS_KEY@s3.ca-central-1.amazonaws.com/bucket-name/events"

source: Supported storage types:
ru: Поддерживаемые типы хранилищ:

source: Local - Local/mounted or network storage in local network
ru: Локальный - локальный или сетевой накопитель в локальной сети

source: s3fs - S3 mounted drive
ru: s3fs - подключенное к S3 устройство хранения данных

source: Some users may require more advanced storage such as S3 provided by amazon or others.
ru: Некоторые пользователи могут потребовать более продвинутого хранения, такого как S3, предоставляемого Amazon или другими.

source: S3 storage setup
ru: Настройка хранилища S3

source: You must use s3fs to mount the S3 bucket in your fs tree. Telling ZoneMinder that the location is S3 will let it use more efficient code to send and delete the event data. The Do Deletes option tells ZoneMinder whether to actually perform delete operations when deleting events. S3fs systems often do deletes in a cron job or other background task and doing the deletes can overload an S3 system.
ru: Вам следует использовать s3fs для монтирования S3-хранилища в вашей файловой системе. Уведомление ZoneMinder о том, что местоположение является S3, позволит ему использовать более эффективный код для отправки и удаления данных событий. Опция Do Deletes сообщает ZoneMinder, следует ли фактически выполнять операции удаления при удалении событий. Системы s3fs часто выполняют удаления в фоновом задании cron или другой фоновой задаче, и выполнение удалений может перегрузить систему S3.

source: Refer to this guide for installation and configuration of s3fs - https://github.com/s3fs-fuse/s3fs-fuse
ru: Обратитесь к этому руководству для установки и конфигурации s3fs - https://github.com/s3fs-fuse/s3fs-fuse

source: Adding credentials to passwd_file
ru: Добавление учетных данных в файл паролей

source: Create credentials file ``echo ACCESS_KEY_ID:SECRET_ACCESS_KEY > /etc/passwd-s3fs``
ru: Создайте файл с учетными данными «echo ACCESS_KEY_ID:SECRET_ACCESS_KEY > /etc/passwd-s3fs»

source: Set file permissions ``chmod 600 /etc/passwd-s3fs``
ru: Установите разрешения файла "chmod 600 /etc/passwd-s3fs"

source: S3 mounting with fstab
ru: Монтирование S3 с помощью fstab

source: Setting up storage.
ru: Настройка хранилища.

source: Click on Add new Storage
ru: Нажмите Добавить новое хранилище

source: Set path to ``/media/S3``
ru: Установите путь к ``/media/S3``

source: Add Url ``s3fs://username:password@s3.ca-central-1.amazonaws.com/bucket-name/events``
ru: Добавить URL `s3fs://username:password@s3.ca-central-1.amazonaws.com/bucket-name/events`

source: Set type to s3fs
ru: Установите тип в s3fs

source: Save settings and monitor logs for errors
ru: Сохранить настройки и отслеживать журналы ошибок
