Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/options/options_config.po
Languages: ru

source: Options - Config
ru: Опции - Настройка

source: The config screen allows the admin to change various configuration parameters related to image capturing and storage.
ru: Настройка экрана позволяет администратору изменять различные параметры конфигурации, относящиеся к захвату изображений и их хранению.

source: A partial screenshot is shown below:
ru: Представлен снимок экрана:

source: TIMESTAMP_ON_CAPTURE - ZoneMinder can add a timestamp to images in two ways. The default method, when this option is set, is that each image is timestamped immediately when captured and so the image held in memory is marked right away. The second method does not timestamp the images until they are either saved as part of an event or accessed over the web. The timestamp used in both methods will contain the same time as this is preserved along with the image. The first method ensures that an image is timestamped regardless of any other circumstances but will result in all images being timestamped even those never saved or viewed. The second method necessitates that saved images are copied before being saved otherwise two timestamps perhaps at different scales may be applied. This has the (perhaps) desirable side effect that the timestamp is always applied at the same resolution so an image that has scaling applied will still have a legible and correctly scaled timestamp.
ru: TIMESTAMP_ON_CAPTURE - Зонд Зонеминдера может добавлять временную метку к изображениям двумя способами. По умолчанию, когда эта опция установлена, каждое изображение маркируется сразу после захвата, и поэтому изображение, хранящееся в памяти, отмечается сразу же. Второй метод не добавляет временные метки к изображениям до тех пор, пока они не будут сохранены как часть события или не будут доступны через веб-интерфейс. Временная метка, используемая в обоих методах, будет содержать одно и то же время, поскольку оно сохраняется вместе с изображением. Первый метод гарантирует, что изображение будет помечено независимо от любых других обстоятельств, но приведет к тому, что все изображения будут помечены, даже те, которые никогда не сохраняются или не просматриваются. Второй метод требует, чтобы изображения, которые должны быть помечены, были скопированы перед их сохранением, иначе могут быть применены две временные метки разного масштаба. Это имеет (возможно) желательное побочное действие, заключающееся в том, что метка времени всегда применяется с одинаковым разрешением, так что изображение, которое масштабируется, все еще будет иметь читаемую и правильно масштабированную временную метку.

source: TIMESTAMP_CODE_CHAR - There are a few codes one can use to tell ZoneMinder to insert data into the timestamp of each image. Traditionally, the percent (%) character has been used to identify these codes since the current character codes do not conflict with the strftime codes, which can also be used in the timestamp. While this works well for Linux, this does not work well for BSD operating systems. Changing the default character to something else, such as an exclamation point (!), resolves the issue. Note this only affects the timestamp codes built into ZoneMinder. It has no effect on the family of strftime codes one can use.
ru: TIMESTAMP_CODE_CHAR - Есть несколько кодов, которые можно использовать для того, чтобы ZoneMinder вставлял данные в таймштамп каждого изображения. Традиционно используется символ процента (%) для обозначения этих кодов, поскольку текущие коды символов не конфликтуют с кодами strftime, которые также могут быть использованы в таймштампе. Хотя это работает хорошо для операционных систем Linux, это не работает хорошо для операционных систем BSD. Изменение стандартного символа на что-то другое, например, на восклицательный знак (!), решает эту проблему. Обратите внимание, что это влияет только на коды таймштампа, встроенные в ZoneMinder. Это не влияет на семейство кодов strftime, которые можно использовать.

source: CPU_EXTENSIONS - When advanced processor extensions such as SSE2 or SSSE3 are available, ZoneMinder can use them, which should increase performance and reduce system load. Enabling this option on processors that do not support the advanced processors extensions used by ZoneMinder is harmless and will have no effect.
ru: CPU_EXTENSIONS - Когда продвинутые процессорные расширения, такие как SSE2 или SSSE3, доступны, ZoneMinder может их использовать, что должно повысить производительность и снизить нагрузку на систему. Включение этой опции на процессорах, которые не поддерживают продвинутые процессорные расширения, используемые ZoneMinder, безопасно и не окажет никакого эффекта.

source: FAST_IMAGE_BLENDS - To detect alarms ZoneMinder needs to blend the captured image with the stored reference image to update it for comparison with the next image. The reference blend percentage specified for the monitor controls how much the new image affects the reference image. There are two methods that are available for this. If this option is set then fast calculation which does not use any multiplication or division is used. This calculation is extremely fast, however it limits the possible blend percentages to 50%, 25%, 12.5%, 6.25%, 3.25% and 1.5%. Any other blend percentage will be rounded to the nearest possible one. The alternative is to switch this option off and use standard blending instead, which is slower.
ru: FAST_IMAGE_BLENDS - Для обнаружения сигналов ZoneMinder необходимо объединить захваченное изображение с хранящимся эталонным изображением для обновления его для сравнения с последующим изображением. Процентное соотношение, указанное в качестве эталона для монитора, определяет, насколько новое изображение влияет на эталонное изображение. Существует два метода, которые можно использовать для этого. Если этот параметр установлен, используется быстрая расчетная операция, которая не использует никакое умножение или деление. Этот расчет чрезвычайно быстрый, однако он ограничивает возможные процентные соотношения до 50%, 25%, 12.5%, 6.25%, 3.25% и 1.5%. Любое другое процентное соотношение будет округлено до ближайшего возможного. Альтернативный вариант - отключить эту опцию и использовать стандартное объединение вместо нее, что медленнее.

source: OPT_ADAPTIVE_SKIP - In previous versions of ZoneMinder the analysis daemon would attempt to keep up with the capture daemon by processing the last captured frame on each pass. This would sometimes have the undesirable side-effect of missing a chunk of the initial activity that caused the alarm because the pre-alarm frames would all have to be written to disk and the database before processing the next frame, leading to some delay between the first and second event frames. Setting this option enables a newer adaptive algorithm where the analysis daemon attempts to process as many captured frames as possible, only skipping frames when in danger of the capture daemon overwriting yet to be processed frames. This skip is variable depending on the size of the ring buffer and the amount of space left in it. Enabling this option will give you much better coverage of the beginning of alarms whilst biasing out any skipped frames towards the middle or end of the event. However you should be aware that this will have the effect of making the analysis daemon run somewhat behind the capture daemon during events and for particularly fast rates of capture it is possible for the adaptive algorithm to be overwhelmed and not have time to react to a rapid build up of pending frames and thus for a buffer overrun condition to occur.
ru: OPT_ADAPTIVE_SKIP - В предыдущих версиях ZoneMinder анализатор пытался поддерживать темп захвата, обрабатывая последний кадр на каждом проходе. Это иногда приводило к нежелательному побочному эффекту пропуска начальной активности, которая вызывала тревогу, поскольку пре-тревожные кадры должны были быть записаны на диск и в базу данных перед обработкой следующего кадра, что приводило к некоторой задержке между первым и вторым событием. Установка этого параметра позволяет использовать более новый адаптивный алгоритм, при котором анализатор пытается обработать как можно больше захваченных кадров, пропуская кадры только в том случае, если существует риск перезаписи еще не обработанных кадров. Этот пропуск является переменным в зависимости от размера буфера кольцевого буфера и оставшегося в нем места. Включение этого параметра обеспечит вам гораздо лучшее покрытие начала тревог, но при этом будут исключены пропущенные кадры ближе к середине или концу события. Однако следует помнить, что это приведет к тому, что анализатор будет немного отставать от захвата во время событий, и для особенно быстрых скоростей захвата возможно, что адаптивный алгоритм будет перегружен и не успеет отреагировать на резкое накопление ожидающих кадров, что может привести к переполнению буфера.

source: MAX_SUSPEND_TIME - ZoneMinder allows monitors to have motion detection to be suspended, for instance while panning a camera. Ordinarily this relies on the operator resuming motion detection afterwards as failure to do so can leave a monitor in a permanently suspended state. This setting allows you to set a maximum time which a camera may be suspended for before it automatically resumes motion detection. This time can be extended by subsequent suspend indications after the first so continuous camera movement will also occur while the monitor is suspended.
ru: MAX_SUSPEND_TIME - ЗонаМиндер позволяет мониторам иметь детектор движения, например, при панорамировании камеры. Обычно это зависит от оператора возобновления детектора движения после этого, поскольку отказ от этого может оставить монитор в постоянном состоянии ожидания. Этот параметр позволяет установить максимальное время, в течение которого камера может быть приостановлена, прежде чем она автоматически возобновит детектор движения. Это время можно продлить последующими сигналами о приостановке после первого, поэтому непрерывное движение камеры также будет происходить во время приостановки монитора.

source: STRICT_VIDEO_CONFIG - With some video devices errors can be reported in setting the various video attributes when in fact the operation was successful. Switching this option off will still allow these errors to be reported but will not cause them to kill the video capture daemon. Note however that doing this will cause all errors to be ignored including those which are genuine and which may cause the video capture to not function correctly. Use this option with caution.
ru: STRICT_VIDEO_CONFIG - При некоторых видеоустройствах ошибки могут быть сообщены при установке различных видеоатрибутов, когда на самом деле операция была успешной. Отключение этого параметра все еще позволит сообщать эти ошибки, но они не будут вызывать их смерть видеодемона захвата. Однако следует отметить, что это приведет к тому, что все ошибки будут проигнорированы, включая те, которые являются подлинными и которые могут привести к неправильной работе видеозахвата. Используйте этот параметр с осторожностью.

source: LD_PRELOAD - Some older cameras require the use of the v4l1 compat library. This setting allows the setting of the path to the library, so that it can be loaded by zmdc.pl before launching zmc.
ru: LD_PRELOAD - Некоторые старые камеры требуют использования библиотеки v4l1 compat. Этот параметр позволяет установить путь к библиотеке, чтобы она могла быть загружена перед запуском zmdc.pl.

source: V4L_MULTI_BUFFER - Performance when using Video 4 Linux devices is usually best if multiple buffers are used allowing the next image to be captured while the previous one is being processed. If you have multiple devices on a card sharing one input that requires switching then this approach can sometimes cause frames from one source to be mixed up with frames from another. Switching this option off prevents multi buffering resulting in slower but more stable image capture. This option is ignored for non-local cameras or if only one input is present on a capture chip. This option addresses a similar problem to the ZM_CAPTURES_PER_FRAME option and you should normally change the value of only one of the options at a time. If you have different capture cards that need different values you can override them in each individual monitor on the source page.
ru: V4L_MULTI_BUFFER - Производительность при использовании устройств Video 4 Linux обычно лучше, если используется несколько буферов, позволяющих захватить следующий кадр, пока обрабатывается предыдущий. Если у вас есть несколько устройств на карте, которые делят один вход, требующий переключения, этот подход иногда может привести к смешиванию кадров от одного источника с кадрами от другого. Отключение этого параметра предотвращает многопоточность, что приводит к более медленному, но более стабильному захвату изображений. Этот параметр игнорируется для нелокальных камер или если на устройстве захвата присутствует только один вход. Этот параметр решает аналогичную проблему, что и параметр ZM_CAPTURES_PER_FRAME, и вы обычно должны изменять значение только одного из параметров за раз. Если у вас разные карты захвата, требующие разных значений, вы можете переопределить их в каждом отдельном мониторе на странице источника.

source: CAPTURES_PER_FRAME - If you are using cameras attached to a video capture card which forces multiple inputs to share one capture chip, it can sometimes produce images with interlaced frames reversed resulting in poor image quality and a distinctive comb edge appearance. Increasing this setting allows you to force additional image captures before one is selected as the captured frame. This allows the capture hardware to 'settle down' and produce better quality images at the price of lesser capture rates. This option has no effect on (a) network cameras, or (b) where multiple inputs do not share a capture chip. This option addresses a similar problem to the ZM_V4L_MULTI_BUFFER option and you should normally change the value of only one of the options at a time. If you have different capture cards that need different values you can override them in each individual monitor on the source page.
ru: CAPTURES_PER_FRAME - Если вы используете камеры, подключенные к видеокарте захвата, которая вынуждает несколько входов делиться одним чипом захвата, это может иногда привести к появлению изображений с обратными интерполированными кадрами, что приводит к низкому качеству изображения и характерному виду зубчатого края. Увеличение этого параметра позволяет вам принудительно захватывать дополнительные изображения перед тем, как одно из них будет выбрано в качестве захваченного кадра. Это позволяет аппаратуре захвата "успокоиться" и производить более качественные изображения за счет более низкой скорости захвата. Этот параметр не влияет на (а) сетевые камеры или (б) где несколько входов не делятся чипом захвата. Этот параметр решает аналогичную проблему, что и опция ZM_V4L_MULTI_BUFFER, и обычно вы должны изменять значение только одного из параметров за раз. Если у вас разные карты захвата, которым требуются разные значения, вы можете переопределить их в каждом отдельном мониторе на странице источника.

source: FORCED_ALARM_SCORE - The 'zmu' utility can be used to force an alarm on a monitor rather than rely on the motion detection algorithms. This option determines what score to give these alarms to distinguish them from regular ones. It must be 255 or less.
ru: FORCED_ALARM_SCORE - Утилита 'zmu' может использоваться для принудительного срабатывания сигнала тревоги на мониторе, а не полагаться на алгоритмы обнаружения движения. Этот параметр определяет, какой балл следует присваивать этим сигналам тревоги, чтобы отличать их от обычных. Он должен быть меньше или равен 255.

source: BULK_FRAME_INTERVAL - Traditionally ZoneMinder writes an entry into the Frames database table for each frame that is captured and saved. This works well in motion detection scenarios but when in a DVR situation ('Record' or 'Mocord' mode) this results in a huge number of frame writes and a lot of database and disk bandwidth for very little additional information. Setting this to a non-zero value will enabled ZoneMinder to group these non-alarm frames into one 'bulk' frame entry which saves a lot of bandwidth and space. The only disadvantage of this is that timing information for individual frames is lost but in constant frame rate situations this is usually not significant. This setting is ignored in Modect mode and individual frames are still written if an alarm occurs in Mocord mode also.
ru: BULK_FRAME_INTERVAL - Традиционно ZoneMinder записывает запись в базу данных таблицы кадров для каждого захваченного и сохраненного кадра. Это работает хорошо в сценариях обнаружения движения, но когда в ситуации DVR ('Запись' или 'Мокорд' режим), это приводит к большому количеству записей кадров и большому объему дискового пространства и пропускной способности базы данных для очень малой дополнительной информации. Установка этого значения в ноль позволит ZoneMinder группировать эти неаварийные кадры в одну запись 'пакетов', что экономит много трафика и места. Единственным недостатком этого является потеря информации о времени для отдельных кадров, но в постоянных условиях частоты кадров это обычно не имеет большого значения. Этот параметр игнорируется в режиме Modect и отдельные кадры все еще записываются, если срабатывает сигнал тревоги в режиме Mocord.

source: EVENT_CLOSE_MODE - When a monitor is running in a continuous recording mode (Record or Mocord) events are usually closed after a fixed period of time (the section length). However in Mocord mode it is possible that motion detection may occur near the end of a section. This option controls what happens when an alarm occurs in Mocord mode. The 'time' setting means that the event will be closed at the end of the section regardless of alarm activity. The 'idle' setting means that the event will be closed at the end of the section if there is no alarm activity occurring at the time otherwise it will be closed once the alarm is over meaning the event may end up being longer than the normal section length. The 'alarm' setting means that if an alarm occurs during the event, the event will be closed once the alarm is over regardless of when this occurs. This has the effect of limiting the number of alarms to one per event and the events will be shorter than the section length if an alarm has occurred.
ru: EVENT_CLOSE_MODE - Когда монитор работает в режиме непрерывной записи (Запись или Мокорд), события обычно закрываются через фиксированный период времени (длина раздела). Однако в режиме Мокорд возможно, что обнаружение движения может произойти в конце раздела. Этот параметр контролирует, что происходит, когда срабатывает сигнал тревоги в режиме Мокорд. Настройка 'время' означает, что событие будет закрыто в конце раздела независимо от активности тревоги. Настройка 'бездействие' означает, что событие будет закрыто в конце раздела, если нет активности тревоги в данный момент, иначе оно будет закрыто после того, как тревога закончится, что означает, что событие может оказаться длиннее обычной длины раздела. Настройка 'тревога' означает, что если тревога срабатывает во время события, событие будет закрыто после того, как тревога закончится, независимо от того, когда это происходит. Это имеет эффект ограничения количества тревог до одной на событие, и события будут короче длины раздела, если сработала тревога.

source: WEIGHTED_ALARM_CENTRES - ZoneMinder will always calculate the centre point of an alarm in a zone to give some indication of where on the screen it is. This can be used by the experimental motion tracking feature or your own custom extensions. In the alarmed or filtered pixels mode this is a simple midpoint between the extents of the detected pxiesl. However in the blob method this can instead be calculated using weighted pixel locations to give more accurate positioning for irregularly shaped blobs. This method, while more precise is also slower and so is turned off by default.
ru: ВЕСОМЫЕ ЦЕНТРЫ БУДУТ - ЗонаЗейдер всегда будет рассчитывать центр тревоги в зоне, чтобы дать некоторое представление о том, где на экране она находится. Это может быть использовано экспериментальной функцией отслеживания движения или вашими собственными пользовательскими расширениями. В режиме тревожных или отфильтрованных пикселей это простой средний пункт между пределами обнаруженных пикселей. Однако в методе "облако" это может быть рассчитано с использованием весовых пиксельных положений, чтобы обеспечить более точное позиционирование для неправильной формы облаков. Этот метод, хотя и более точен, также медленнее и поэтому по умолчанию отключен.

source: EVENT_IMAGE_DIGITS - As event images are captured they are stored to the filesystem with a numerical index. By default this index has three digits so the numbers start 001, 002 etc. This works works for most scenarios as events with more than 999 frames are rarely captured. However if you have extremely long events and use external applications then you may wish to increase this to ensure correct sorting of images in listings etc. Warning, increasing this value on a live system may render existing events unviewable as the event will have been saved with the previous scheme. Decreasing this value should have no ill effects.
ru: EVENT_IMAGE_DIGITS - Как только изображения событий захватываются, они сохраняются в файловой системе с числовым индексом. По умолчанию этот индекс имеет три цифры, поэтому числа начинаются с 001, 002 и т. д. Это работает для большинства сценариев, так как события с более чем 999 кадрами редко захватываются. Однако, если у вас очень длинные события и вы используете внешние приложения, вам может захотеться увеличить это значение, чтобы обеспечить правильную сортировку изображений в списках и т. д. Предупреждение: увеличение этого значения на работающей системе может сделать существующие события недоступными для просмотра, поскольку событие было сохранено по предыдущей схеме. Уменьшение этого значения не должно иметь никаких негативных последствий.

source: DEFAULT_ASPECT_RATIO - When specifying the dimensions of monitors you can click a checkbox to ensure that the width stays in the correct ratio to the height, or vice versa. This setting allows you to indicate what the ratio of these settings should be. This should be specified in the format <width value>:<height value> and the default of 4:3 normally be acceptable but 11:9 is another common setting. If the checkbox is not clicked when specifying monitor dimensions this setting has no effect.
ru: DEFAULT_ASPECT_RATIO - При указании размеров мониторов можно щелкнуть флажок, чтобы убедиться, что ширина остается в правильном соотношении к высоте, или наоборот. Это настройка позволяет указать, какое соотношение должны иметь эти настройки. Это должно быть указано в формате <ширина значения>:<высота значения>, и обычно значение по умолчанию 4:3 является приемлемым, но 11:9 - это еще одна распространенная настройка. Если при указании размеров монитора флажок не отмечен, эта настройка не имеет никакого эффекта.

source: USER_SELF_EDIT - Ordinarily only users with system edit privilege are able to change users details. Switching this option on allows ordinary users to change their passwords and their language settings
ru: USER_SELF_EDIT - Обычно только пользователи с привилегией системного редактирования могут изменять детали пользователей. Включение этого параметра позволяет обычным пользователям изменять свои пароли и настройки языка
