Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/options/options_upload.po
Languages: ru

source: Options - Upload
ru: Варианты - Загрузить

source: A partial screenshot of the upload options is shown below:
ru: Представлен скриншот части экрана с опциями загрузки:

source: OPT_UPLOAD - In ZoneMinder you can create event filters that specify whether events that match certain criteria should be uploaded to a remote server for archiving. This option specifies whether this functionality should be available.
ru: OPT_UPLOAD - В ZoneMinder вы можете создавать фильтры событий, которые определяют, должны ли события, соответствующие определенным критериям, загружаться на удаленный сервер для архивации. Этот параметр определяет, должна ли быть доступна эта функциональность.

source: UPLOAD_ARCH_FORMAT - Uploaded events may be stored in either .tar or .zip format, this option specifies which. Note that to use this you will need to have the Archive::Tar and/or Archive::Zip perl modules installed.
ru: ФОРМАТ_АРХ_ЗАГРУЗКИ - Загруженные события могут быть сохранены в формате .tar или .zip, этот параметр определяет, какой из них. Обратите внимание, что для использования этого вам потребуется установить модули Perl Archive::Tar и/или Archive::Zip.

source: UPLOAD_ARCH_COMPRESS - When the archive files are created they can be compressed. However in general since the images are compressed already this saves only a minimal amount of space versus utilising more CPU in their creation. Only enable if you have CPU to waste and are limited in disk space on your remote server or bandwidth.
ru: UPLOAD_ARCH_COMPRESS - Когда создаются архивные файлы, они могут быть сжаты. Однако в целом, поскольку изображения уже сжаты, это экономит только минимальное количество места по сравнению с использованием большего количества ЦП при их создании. Включайте только в том случае, если у вас есть ЦП, которым можно пожертвовать, и у вас мало места на удаленном сервере или пропускной способности.

source: UPLOAD_ARCH_ANALYSE - When the archive files are created they can contain either just the captured frames or both the captured frames and, for frames that caused an alarm, the analysed image with the changed area highlighted. This option controls files are included. Only include analysed frames if you have a high bandwidth connection to the remote server or if you need help in figuring out what caused an alarm in the first place as archives with these files in can be considerably larger.
ru: UPLOAD_ARCH_ANALYSE - Когда создаются архивные файлы, они могут содержать либо только захваченные кадры, либо как захваченные кадры, так и, для кадров, вызвавших тревогу, проанализированное изображение с выделенной измененной областью. Этот параметр контролирует включение файлов. Включайте только проанализированные кадры, если у вас высокоскоростное соединение с удаленным сервером или если вам нужна помощь в определении того, что вызвало тревогу в первую очередь, поскольку архивы с этими файлами могут быть значительно больше.

source: UPLOAD_PROTOCOL - ZoneMinder can upload events to a remote server using either FTP or SFTP. Regular FTP is widely supported but not necessarily very secure whereas SFTP (Secure FTP) runs over an ssh connection and so is encrypted and uses regular ssh ports. Note that to use this you will need to have the appropriate perl module, either Net::FTP or Net::SFTP installed depending on your choice.
ru: ПРОТОКОЛ ЗАГРУЗКИ - Зонд Минер может загружать события на удаленный сервер с использованием либо FTP, либо SFTP. Обычный FTP широко поддерживается, но не обязательно очень безопасен, в то время как SFTP (Безопасный FTP) работает через соединение ssh и поэтому зашифрован и использует обычные порты ssh. Обратите внимание, что для использования этого вам потребуется иметь соответствующий модуль Perl, либо Net::FTP, либо Net::SFTP, в зависимости от вашего выбора.

source: UPLOAD_HOST - You can use filters to instruct ZoneMinder to upload events to a remote server. This option indicates the name, or ip address, of the server to use.
ru: UPLOAD_HOST - Вы можете использовать фильтры для инструкции ZoneMinder о загрузке событий на удаленный сервер. Этот параметр указывает имя, или IP-адрес, сервера, который следует использовать.

source: UPLOAD_PORT - You can use filters to instruct ZoneMinder to upload events to a remote server. If you are using the SFTP protocol then this option allows you to specify a particular port to use for connection. If this option is left blank then the default, port 22, is used. This option is ignored for FTP uploads.
ru: PORT - Вы можете использовать фильтры для инструкции ZoneMinder о загрузке событий на удаленный сервер. Если вы используете протокол SFTP, то этот параметр позволяет вам указать конкретный порт, который следует использовать для подключения. Если этот параметр остается пустым, то используется по умолчанию порт 22. Этот параметр игнорируется при загрузке через FTP.

source: UPLOAD_USER - You can use filters to instruct ZoneMinder to upload events to a remote server. This option indicates the username that ZoneMinder should use to log in for transfer.
ru: UPLOAD_USER - Вы можете использовать фильтры для инструкции ZoneMinder о загрузке событий на удаленный сервер. Этот параметр указывает имя пользователя, которое ZoneMinder должен использовать для входа в систему для передачи.

source: UPLOAD_PASS - You can use filters to instruct ZoneMinder to upload events to a remote server. This option indicates the password that ZoneMinder should use to log in for transfer. If you are using certificate based logins for SFTP servers you can leave this option blank.
ru: UPLOAD_PASS - Вы можете использовать фильтры для инструкции ZoneMinder о загрузке событий на удаленный сервер. Этот параметр указывает пароль, который ZoneMinder должен использовать для входа для передачи. Если вы используете сертификаты для логинов SFTP-серверов, вы можете оставить этот параметр пустым.

source: UPLOAD_LOC_DIR - You can use filters to instruct ZoneMinder to upload events to a remote server. This option indicates the local directory that ZoneMinder should use for temporary upload files. These are files that are created from events, uploaded and then deleted.
ru: UPLOAD_LOC_DIR - Вы можете использовать фильтры для инструкции ZoneMinder о загрузке событий на удаленный сервер. Этот параметр указывает на локальную директорию, которую ZoneMinder должен использовать для временных файлов загрузки. Это файлы, которые создаются из событий, загружаются и затем удаляются.

source: UPLOAD_REM_DIR - You can use filters to instruct ZoneMinder to upload events to a remote server. This option indicates the remote directory that ZoneMinder should use to upload event files to.
ru: UPLOAD_REM_DIR - Вы можете использовать фильтры для инструкции ZoneMinder о загрузке событий на удаленный сервер. Этот параметр указывает на удаленную директорию, которую ZoneMinder должен использовать для загрузки файлов событий.

source: UPLOAD_TIMEOUT - You can use filters to instruct ZoneMinder to upload events to a remote server. This option indicates the maximum inactivity timeout (in seconds) that should be tolerated before ZoneMinder determines that the transfer has failed and closes down the connection.
ru: TIMEOUT_UPLOAD - Вы можете использовать фильтры для инструкции ZoneMinder о загрузке событий на удаленный сервер. Этот параметр указывает максимальный период бездействия (в секундах), который должен быть терпимым перед тем, как ZoneMinder определит, что передача не удалась, и закроет соединение.

source: UPLOAD_STRICT - You can require SFTP uploads to verify the host key of the remote server for protection against man-in-the-middle attacks. You will need to add the server's key to the known_hosts file. On most systems, this will be ``~/.ssh/known_hosts``, where ``~`` is the home directory of the web server running ZoneMinder.
ru: UPLOAD_STRICT - Вы можете требовать загрузки по протоколу SFTP для проверки ключа хоста удаленного сервера с целью защиты от атак типа "человек посередине". Вам потребуется добавить ключ сервера в файл known_hosts. На большинстве систем это будет "~/.ssh/known_hosts", где "~" - это домашняя директория веб-сервера, на котором работает ZoneMinder.

source: UPLOAD_FTP_PASSIVE - You can use filters to instruct ZoneMinder to upload events to a remote ftp server. This option indicates that ftp transfers should be done in passive mode. This uses a single connection for all ftp activity and, whilst slower than active transfers, is more robust and likely to work from behind filewalls. This option is ignored for SFTP transfers.
ru: UPLOAD_FTP_PASSIVE - Вы можете использовать фильтры для инструкции ZoneMinder о загрузке событий на удаленный FTP-сервер. Этот параметр указывает, что передачи по FTP должны выполняться в пассивном режиме. Это использует единую связь для всех действий FTP и, хотя медленнее, чем активные передачи, более надежно и, вероятно, будет работать из-за файрволов. Этот параметр игнорируется для SFTP-передач.

source: UPLOAD_DEBUG - You can use filters to instruct ZoneMinder to upload events to a remote server. If you are having (or expecting) troubles with uploading events then setting this to 'yes' permits additional information to be generated by the underlying transfer modules and included in the logs.
ru: UPLOAD_DEBUG - Вы можете использовать фильтры для инструкции ZoneMinder о загрузке событий на удаленный сервер. Если у вас возникают (или ожидаются) проблемы с загрузкой событий, установка этого в 'да' позволяет дополнительной информации генерироваться подключаемыми модулями передачи и включаться в журналы.
