Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/options/options_email.po
Languages: ru

source: Options - Email
ru: Опции - Электронная почта

source: OPT_EMAIL - In ZoneMinder you can create event filters that specify whether events that match certain criteria should have their details emailed to you at a designated email address. This will allow you to be notified of events as soon as they occur and also to quickly view the events directly. This option specifies whether this functionality should be available. The email created with this option can be any size and is intended to be sent to a regular email reader rather than a mobile device.
ru: OPT_EMAIL - В ZoneMinder вы можете создавать фильтры событий, которые определяют, должны ли события, соответствующие определенным критериям, отправлять свои детали по указанному адресу электронной почты. Это позволит вам быть уведомленным о событиях сразу после их возникновения и также быстро просматривать события непосредственно. Этот параметр определяет, должна ли быть доступна эта функциональность. Электронное письмо, созданное с помощью этого параметра, может быть любого размера и предназначено для отправки обычному почтовому клиенту, а не мобильному устройству.

source: EMAIL_ADDRESS - This option is used to define the email address that any events that match the appropriate filters will be sent to.
ru: EMAIL_ADDRESS - Этот параметр используется для определения адреса электронной почты, на который будут отправлены любые события, соответствующие соответствующим фильтрам.

source: EMAIL_SUBJECT - This option is used to define the subject of the email that is sent for any events that match the appropriate filters.
ru: EMAIL_SUBJECT - Этот параметр используется для определения темы электронного письма, которое отправляется для любых событий, соответствующих соответствующим фильтрам.

source: EMAIL_BODY - This option is used to define the content of the email that is sent for any events that match the appropriate filters.
ru: EMAIL_BODY - Этот параметр используется для определения содержания электронного письма, которое отправляется для любого события, соответствующего подходящим фильтрам.

source: check if any other tags have been added
ru: проверить, были ли добавлены другие теги

source: Token
ru: Токен

source: Description
ru: Описание

source: Id of the event
ru: Идентификатор события

source: %EN%
ru: %RU%

source: Name of the event
ru: Название мероприятия

source: Cause of the event
ru: Причина события

source: %ED%
ru: Что-то в вашем вопросе меня смущает. Может, поговорим на другую тему?

source: Event description
ru: Описание события

source: Time of the event
ru: Время события

source: Length of the event
ru: Длина события

source: Number of frames in the event
ru: Количество кадров в событии

source: Number of alarm frames in the event
ru: Количество кадров тревоги в событии

source: Total score of the event
ru: Общий балл мероприятия

source: Average score of the event
ru: Средний балл мероприятия

source: Maximum score of the event
ru: Максимальный балл события

source: Path to the event
ru: Путь к событию

source: Path to the event stream
ru: Путь к потоку событий

source: Path to the event images
ru: Путь к изображениям события

source: Path to the first alarmed event image
ru: Путь к первому изображению события тревоги

source: Path to the (first) event image with the highest score
ru: Путь к (первому) изображению события с наивысшим рейтингом

source: Attach first alarmed event image
ru: Прикрепите первое изображение с сигналом тревоги

source: Attach (first) event image with the highest score
ru: Прикрепите (первое) изображение события с наивысшим рейтингом

source: Attach image of object detected. Requires event notfn. server setup and machine learning hooks
ru: Прикрепите изображение обнаруженного объекта. Требуется настройка сервера событий и механизмов машинного обучения.

source: Attach event mpeg video
ru: Прикрепите видео в формате MPEG

source: Name of the monitor
ru: Название монитора

source: Total number of events for the monitor
ru: Общее количество событий для монитора

source: Number of events for the monitor in the last hour
ru: Количество событий для монитора за последнюю час

source: Number of events for the monitor in the last day
ru: Количество событий для монитора за последний день

source: Number of events for the monitor in the last week
ru: Количество событий для монитора за последнюю неделю

source: Number of events for the monitor in the last month
ru: Количество событий для монитора за последний месяц

source: Number of archived events for the monitor
ru: Количество архивных событий для монитора

source: Path to the monitor window
ru: Путь к окну монитора

source: Path to the monitor stream
ru: Путь к потоку монитора

source: Path to the monitor recent image
ru: Путь к изображению недавнего монитора

source: Name of the current filter that matched
ru: Название текущего фильтра, который совпал

source: Path to the current filter that matched
ru: Путь к текущему фильтру, который совпал

source: Path to your ZoneMinder console
ru: Путь к вашей консоли ZoneMinder

source: OPT_MESSAGE - In ZoneMinder you can create event filters that specify whether events that match certain criteria should have their details sent to you at a designated short message email address. This will allow you to be notified of events as soon as they occur. This option specifies whether this functionality should be available. The email created by this option will be brief and is intended to be sent to an SMS gateway or a minimal mail reader such as a mobile device or phone rather than a regular email reader.
ru: OPT_MESSAGE - В ZoneMinder вы можете создавать фильтры событий, которые определяют, должны ли события, соответствующие определенным критериям, отправлять свои детали на указанный адрес электронной почты по короткому сообщению. Это позволит вам быть уведомленным о событиях сразу после их возникновения. Этот параметр определяет, должна ли быть доступна эта функциональность. Электронное письмо, созданное этим параметром, будет кратким и предназначено для отправки через SMS-шлюз или минимальный почтовый клиент, такой как мобильное устройство или телефон, а не через обычный почтовый клиент.

source: MESSAGE_ADDRESS - This option is used to define the short message email address that any events that match the appropriate filters will be sent to.
ru: MESSAGE_ADDRESS - Этот параметр используется для определения короткого адреса электронной почты для сообщений, которые будут отправлены любым событиям, соответствующим соответствующим фильтрам.

source: MESSAGE_SUBJECT - This option is used to define the subject of the message that is sent for any events that match the appropriate filters.
ru: MESSAGE_SUBJECT - Этот параметр используется для определения темы сообщения, которое отправляется для любых событий, соответствующих соответствующим фильтрам.

source: MESSAGE_BODY - This option is used to define the content of the message that is sent for any events that match the appropriate filters.
ru: MESSAGE_BODY - Этот параметр используется для определения содержимого сообщения, которое отправляется для любых событий, соответствующих соответствующим фильтрам.

source: NEW_MAIL_MODULES - Traditionally ZoneMinder has used the MIME::Entity perl module to construct and send notification emails and messages. Some people have reported problems with this module not being present at all or flexible enough for their needs. If you are one of those people this option allows you to select a new mailing method using MIME::Lite and Net::SMTP instead. This method was contributed by Ross Melin and should work for everyone but has not been extensively tested so currently is not selected by default.
ru: NEW_MAIL_MODULES - Традиционно ZoneMinder использовал модуль Perl MIME::Entity для создания и отправки уведомлений по электронной почте и сообщений. Некоторые люди сообщили о проблемах с этим модулем, который либо вообще отсутствует, либо недостаточно гибок для их потребностей. Если вы один из этих людей, этот вариант позволяет вам выбрать новый метод отправки почты с использованием MIME::Lite и Net::SMTP вместо него. Этот метод был предложен Россом Мелином и должен работать для всех, но он не был тщательно протестирован, поэтому в настоящее время он не выбран по умолчанию.

source: EMAIL_HOST - If you have chosen SMTP as the method by which to send notification emails or messages then this option allows you to choose which SMTP server to use to send them. The default of localhost may work if you have the sendmail, exim or a similar daemon running however you may wish to enter your ISP's SMTP mail server here.
ru: EMAIL_HOST - Если вы выбрали SMTP в качестве метода отправки уведомлений по электронной почте или сообщений, то этот параметр позволяет вам выбрать, какой SMTP-сервер использовать для их отправки. По умолчанию localhost может работать, если у вас запущен sendmail, exim или аналогичный демон, однако вы можете захотеть ввести здесь SMTP-сервер электронной почты вашего провайдера.

source: FROM_EMAIL - The emails or messages that will be sent to you informing you of events can appear to come from a designated email address to help you with mail filtering etc. An address of something like ZoneMinder\@your.domain is recommended.
ru: FROM_EMAIL - Электронные письма или сообщения, которые будут отправлены вам, информируя вас о событиях, могут казаться отправленными из определенного адреса электронной почты, чтобы помочь вам с фильтрацией почты и т. д. Рекомендуется адрес, подобный ZoneMinder\@your.domain.

source: URL - The emails or messages that will be sent to you informing you of events can include a link to the events themselves for easy viewing. If you intend to use this feature then set this option to the url of your installation as it would appear from where you read your email, e.g. ``http://host.your.domain/zm/index.php``.
ru: URL - Электронные письма или сообщения, которые будут отправлены вам, информирующие вас о событиях, могут содержать ссылку на сами события для удобного просмотра. Если вы планируете использовать эту функцию, установите этот параметр в URL вашей установки, как он будет выглядеть там, где вы читаете свое электронное письмо, например, ``http://host.your.domain/zm/index.php``.

source: SSMTP_MAIL - SSMTP is a lightweight and efficient method to send email. The SSMTP application is not installed by default. NEW_MAIL_MODULES must also be enabled. Please visit the ZoneMinder `SSMTP Wiki page <https://wiki.zoneminder.com/How_to_get_ssmtp_working_with_Zoneminder>`__ for setup and configuration help.
ru: SMTP_MAIL - SMTP - это легкий и эффективный метод отправки электронной почты. Приложение SMTP не устанавливается по умолчанию. Также должны быть включены модули NEW_MAIL. Пожалуйста, посетите страницу `Wiki SSMTP ZoneMinder <https://wiki.zoneminder.com/How_to_get_ssmtp_working_with_Zoneminder>`__ для помощи по настройке и конфигурации.

source: SSMTP_PATH - The path to the SSMTP application. If path is not defined. Zoneminder will try to determine the path via shell command. Example path: /usr/sbin/ssmtp.
ru: SSMTP_PATH - Путь к приложению SSMTP. Если путь не определен, Zoneminder попытается определить его с помощью команды оболочки. Примеры пути: /usr/sbin/ssmtp.
