Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: ru

source: Note that if you are investigating why events 'do not' happen then these will not be saved and so won't be accessible. The best thing to do in that circumstance is to make your zone more sensitive so that it captures all events (perhap even ones you don't want) so you can get an idea of what values are being generated and then start to adjust back to less sensitive settings if necessary. You should make sure you test your settings under a variety of lighting conditions (e.g. day and night, sunny or dull) to get the best feel for that works and what doesn't.
ru: Обратите внимание, что если вы исследуете, почему события "не происходят", то они не будут сохранены и, следовательно, не будут доступны. Лучшим решением в этой ситуации будет сделать вашу зону более чувствительной, чтобы она захватывала все события (возможно, даже те, которые вам не нужны), чтобы вы могли получить представление о том, какие значения генерируются, а затем начать корректировать настройки до менее чувствительных, если это необходимо. Убедитесь, что вы протестировали свои настройки при различных условиях освещения (например, днем и ночью, солнечные или тусклые) для получения наилучшего представления о том, что работает и что не работает.

source: Using statistics will slow your system down to a small degree and use a little extra disk space in the DB so once you are happy you can switch them off again. However it is perfectly feasible to keep them permanently on if your system is able to cope which will allow you to review your setting periodically.
ru: Использование статистики замедлит работу вашей системы на небольшую величину и займет немного дополнительного дискового пространства в базе данных, поэтому, когда вы будете довольны, вы можете снова отключить их. Однако вполне возможно оставить их постоянно включенными, если ваша система может справиться с этим, что позволит вам периодически пересматривать свои настройки.

source: Diagnostic Images along with FIFO
ru: Диагностические изображения вместе с FIFO

source: The second approach is to use diagnostic images which are saved copies of the intermediate images that ZM uses when determining motion detection. These are switched on and off using ``Options->Logging->RECORD_DIAG_IMAGES``.
ru: Второй подход - использование диагностических изображений, которые являются сохраненными копиями промежуточных изображений, используемых ZM при определении обнаружения движения. Они включаются и выключаются с помощью ``Настройки->Логирование->RECORD_DIAG_IMAGES``.

source: In addition to the detailed explanation below, a recently added ``RECORD_DIAG_IMAGES_FIFO`` option, also available in ``Options->Logging`` can be an invaluable tool to see how your current motion settings are affecting motion detection. The ``delta`` stream along with the ``raw`` (json output) stream can be invaluable to see the effect in real time. Please refer to the explanation of this feature in :doc:`/userguide/options/options_logging`
ru: Кроме подробного объяснения ниже, недавно добавленная опция ``RECORD_DIAG_IMAGES_FIFO``, также доступная в ``Options->Logging``, может стать незаменимым инструментом для просмотра того, как текущие настройки движения влияют на обнаружение движения. Поток ``delta`` вместе с потоком ``raw`` (json-выход) может быть бесценным для наблюдения за эффектом в реальном времени. Пожалуйста, обратитесь к объяснению этой функции в :doc:`/userguide/options/options_logging`

source: There are two kinds of diagnostic images which are and are written (and continuously overwritten) to the top level monitor event directory. If an event occurs then the files are additionally copied to the event directory and renamed with the appropriate frame number as a prefix.
ru: Существует два типа диагностических изображений, которые записываются (и постоянно перезаписываются) в корневую директорию монитора событий. Если происходит событие, файлы дополнительно копируются в директорию события и переименовываются с использованием соответствующего номера кадра в качестве префикса.

source: The first set are produced by the monitor on the image as a whole. The ``diag-r.jpg`` image is the current reference image against which all individual frames are compared and the ``diag-d.jpg`` image is the delta image highlighting the difference between the reference image and the last analysed image. In this images identical pixels will be black and the more different a pixel is the whiter it will be. Viewing this image and determining the colour of the pixels is a good way of getting a feel for the pixel differences you might expect (often more than you think).
ru: Первый набор изображений создается монитором в целом. Изображение ``diag-r.jpg`` является текущим эталонным изображением, по которому сравниваются все отдельные кадры, а изображение ``diag-d.jpg`` - это изображение разницы между эталонным изображением и последним проанализированным изображением. В этом изображении пиксели с одинаковыми цветами будут черными, а чем больше разница в цвете пикселя, тем белее он будет. Просмотр этого изображения и определение цвета пикселей - хороший способ получить представление о различиях в пикселях, которые вы можете ожидать (часто больше, чем вы думаете).

source: The second set of diag images are labelled as ``diag-<zoneid>-<stage>.jpg`` where zoneid is the id of the zone in question (Smile) and the stage is where in the alarm check process the image is generated from. So if you have several zones you can expect to see multiple files. Also these files are only interested in what is happening in their zone only and will ignore anything else outside of the zone. The stages that each number represents are as follows,
ru: Второй набор изображений диаграмм помечены как ``diag-<zoneid>-<stage>.jpg``, где zoneid - это идентификатор зоны, о которой идет речь (Улыбка), а стадия - это этап процесса проверки тревоги, на котором генерируется изображение. Таким образом, если у вас есть несколько зон, вы можете ожидать увидеть несколько файлов. Кроме того, эти файлы интересуются только тем, что происходит в их зоне, и игнорируют все остальное за пределами зоны. Этапы, которые каждый номер представляет, следующие,

source: Alarmed Pixels - This image shows all pixels in the zone that are considered to be alarmed as white pixels and all other pixels as black.
ru: Тревожные пиксели - На этом изображении показаны все пиксели в зоне, которые считаются тревожными, как белые пиксели, а все остальные пиксели - черными.

source: Filtered Pixels - This is as stage one except that all pixels removed by the filters are now black. The white pixels represent the pixels that are candidates to generate an event.
ru: Фильтрованные Пиксели - Как в первом случае, за исключением того, что все пиксели, удаленные фильтрами, теперь черные. Белые пиксели представляют пиксели, которые являются кандидатами на генерацию события.

source: Raw Blobs - This image contains all alarmed pixels from stage 2 but aggrageted into blobs. Each blob will have a different greyscale value (between 1 and 254) so they can be difficult to spot with the naked eye but using a colour picker or photoshop will make it easier to see what blob is what.
ru: Необработанные Блобы - На этом изображении содержатся все пиксели, находящиеся в стадии 2, но объединенные в блоки. Каждый блок будет иметь разное значение серого (от 1 до 254), поэтому их трудно заметить невооруженным глазом, но с помощью цветового пинцета или фотошопа будет легче определить, какой блок что представляет.

source: Filtered Blobs - This image is as stage 3 but under (or over) sized blobs have been removed. This is the final step before determining if an event has occurred, just prior to the number of blobs being counted. Thus this image forms the basis for determining whether an event is generated and outlining on alarmed images is done from the blobs in this image.
ru: Фильтрованные Блобы - Это изображение находится на стадии 3, но под (или над) размерными блобами были удалены. Это последний шаг перед определением, произошло ли событие, непосредственно перед подсчетом количества блобов. Таким образом, это изображение служит основой для определения того, было ли сгенерировано событие и выделение на сигнализированных изображениях выполняется из блобов этого изображения.

source: Using the above images you should be able to tell at all stages what ZM is doing to determine if an event should happen or not. They are useful diagnostic tools but as is mentioned elsewhere they will massively slow your system down and take up a great deal more space. You should never leave ZM running for any length of time with diagnostic images on.
ru: Используя приведенные выше изображения, вы должны быть в состоянии определить на всех этапах, что делает ZM для определения того, должно ли произойти событие или нет. Они полезны как диагностические инструменты, но, как упоминалось ранее, они значительно замедлят вашу систему и займут много больше места. Никогда не оставляйте ZM работающим в течение любого периода времени с диагностическими изображениями.

source: Why can't ZoneMinder capture images (either at all or just particularly fast) when I can see my camera just fine in xawtv or similar?
ru: Почему ZoneMinder не может захватывать изображения (полностью или только особенно быстро), когда я могу видеть свою камеру просто в xawtv или аналогичной программе?

source: With capture cards ZoneMinder will pull images as fast as it possibly can unless limited by configuration. ZoneMinder (and any similar application) uses the frame grabber interface to copy frames from video memory into user memory. This takes some time, plus if you have several inputs sharing one capture chip it has to switch between inputs between captures which further slows things down.
ru: С картами захвата ZoneMinder будет извлекать изображения так быстро, как только возможно, за исключением случаев, когда это ограничено конфигурацией. ZoneMinder (и любое аналогичное приложение) использует интерфейс захвата кадров для копирования кадров из видеопамяти в пользовательскую память. Это занимает некоторое время, плюс, если у вас несколько входов, использующих один чип захвата, ему приходится переключаться между входами между захватами, что еще больше замедляет процесс.

source: On average a card that can capture at 25fps per chip PAL for one input will do maybe 6-10fps for two, 1-4fps for three and 1-2 for four. For a 30fps NTSC chip the figures will be correspondingly higher. However sometimes it is necessary to slow down capture even further as after an input switch it may take a short while for the new image to settle before it can be captured without corruption.
ru: В среднем карта, способная захватывать 25 кадров в секунду на чипе PAL для одного входа, может делать от 6 до 10 кадров в секунду для двух, от 1 до 4 кадров в секунду для трех и от 1 до 2 кадров в секунду для четырех. Для чипа NTSC с частотой 30 кадров в секунду цифры будут соответственно выше. Однако иногда требуется замедлить захват даже больше, так как после переключения входа может пройти короткое время, прежде чем новое изображение установится, прежде чем его можно будет захватить без искажений.

source: When using xawtv etc to view the stream you are not looking at an image captured using the frame grabber but the card's video memory mapped onto your screen. This requires no capture or processing unless you do an explicit capture via the J or ctrl-J keys for instance. Some cards or drivers do not support the frame grabber interface at all so may not work with ZoneMinder even though you can view the stream in xawtv. If you can grab a still using the grab functionality of xawtv then in general your card will work with ZoneMinder.
ru: Когда вы используете xawtv и т.д. для просмотра потока, вы не смотрите изображение, захваченное с помощью захватчика кадров, а видеопамять карты отображается на вашем экране. Это требует никакого захвата или обработки, если только вы не делаете явную запись с помощью клавиш J или ctrl-J, например. Некоторые карты или драйверы вообще не поддерживают интерфейс захвата кадров, поэтому они могут не работать с ZoneMinder, даже если вы можете просматривать поток в xawtv. Если вы можете захватить неподвижное изображение с помощью функциональности захвата xawtv, то в общем случае ваша карта будет работать с ZoneMinder.

source: Why can't I see streamed images when I can see stills in the zone window etc?
ru: Почему я не могу видеть потоковые изображения, когда я могу видеть неподвижные изображения в окне зоны и т.д.?

source: This issue is normally down to one of two causes
ru: Эта проблема обычно вызвана одной из двух причин

source: You are using Internet Explorer and are trying to view multi-part jpeg streams. IE does not support these streams directly, unlike most other browsers. You will need to install Cambozola or another multi-part jpeg aware plugin to view them. To do this you will need to obtain the applet from the Downloads page and install the cambozola.jar file in the same directory as the ZoneMinder php files. Then find the ZoneMinder Options->Images page and enable ``OPT_CAMBOZOLA`` and enter the web path to the .jar file in ``PATH_CAMBOZOLA``. This will ordinarily just be cambozola.jar. Provided (Options / B/W tabs) ``WEB_H_CAN_STREAM`` is set to auto and ``WEB_H_STREAM_METHOD`` is set to jpeg then Cambozola should be loaded next time you try and view a stream.
ru: Вы используете Internet Explorer и пытаетесь просматривать многочастные потоки JPEG. IE не поддерживает эти потоки напрямую, в отличие от большинства других браузеров. Вам потребуется установить Cambozola или другой плагин, поддерживающий многочастные потоки JPEG, чтобы просматривать их. Для этого вам потребуется загрузить приложение с страницы загрузок и установить файл cambozola.jar в ту же папку, что и файлы ZoneMinder PHP. Затем найдите страницу настроек ZoneMinder -> Изображения и включите опцию ``OPT_CAMBOZOLA`` и введите путь к файлу .jar в ``PATH_CAMBOZOLA``. Обычно это просто cambozola.jar. Если (Настройки / Таблица цветов) ``WEB_H_CAN_STREAM`` установлен в автоматический режим и ``WEB_H_STREAM_METHOD`` установлен в JPEG, то Cambozola должна быть загружена при следующей попытке просмотра потока.

source: **NOTE**: If you find that the Cambozola applet loads in IE but the applet just displays the version of Cambozola and the author's name (as opposed to seeing the streaming images), you may need to chmod (``-rwxrwxr-x``) your (``usr/share/zoneminder/``) cambozola.jar:
ru: **ОТМЕТКА**: Если вы обнаружите, что приложение Cambozola загружается в IE, но вместо потокового изображения отображается только версия Cambozola и имя автора, возможно, вам потребуется выполнить команду chmod (``-rwxrwxr-x``) для файла (``usr/share/zoneminder/``) cambozola.jar:

source: Once I did this, images started to stream for me.
ru: После этого изображения начали поступать для меня.

source: The other common cause for being unable to view streams is that you have installed the ZoneMinder cgi binaries (zms and nph-zms) in a different directory than your web server is expecting. Make sure that the --with-cgidir option you use to the ZoneMinder configure script is the same as the CGI directory configure for your web server. If you are using Apache, which is the most common one, then in your httpd.conf file there should be a line like ``ScriptAlias /cgi-bin/ "/var/www/cgi-bin/"`` where the last directory in the quotes is the one you have specified. If not then change one or the other to match. Be warned that configuring apache can be complex so changing the one passed to the ZoneMinder configure (and then rebuilding and reinstalling) is recommended in the first instance. If you change the apache config you will need to restart apache for the changes to take effect. If you still cannot see stream reliably then try changing ``ZM_PATH_ZMS`` in your ``/etc/zm/config`` directory to just use zms if nph-zms is specified, or vice versa. Also check in your apache error logs.
ru: Другой распространенной причиной невозможности просмотра потоков является то, что вы установили библиотеки cgi ZoneMinder (zms и nph-zms) в другую директорию, чем ожидает ваш веб-сервер. Убедитесь, что опция --with-cgidir, которую вы используете в скрипте конфигурации ZoneMinder, такая же, как и директория CGI для вашего веб-сервера. Если вы используете Apache, который является наиболее распространенным, то в файле конфигурации httpd.conf должна быть строка, подобная ``ScriptAlias /cgi-bin/ "/var/www/cgi-bin/"``, где последняя директория в кавычках - это та, которую вы указали. Если нет, то измените один или другой, чтобы они соответствовали. Предупреждение: настройка Apache может быть сложной, поэтому рекомендуется сначала изменить одну из них, пересобрать и переустановить ZoneMinder. Если вы измените конфигурацию Apache, вам потребуется перезапустить Apache, чтобы изменения вступили в силу. Если вы все еще не можете надежно просматривать потоки, попробуйте изменить ``ZM_PATH_ZMS`` в вашей директории ``/etc/zm/config`` на использование только zms, если указано nph-zms, или наоборот. Также проверьте в журналах ошибок Apache.

source: Lastly, please look for errors created by the zmc processes. If zmc isn't running, then zms will not be able to get an image from it and will exit.
ru: Наконец, пожалуйста, ищите ошибки, создаваемые процессами zmc. Если zmc не запущен, zms не сможет получить изображение из него и выйдет из строя.

source: I have several monitors configured but when I load the Montage view why can I only see two? or, Why don't all my cameras display when I use the Montage view?
ru: У меня несколько мониторов, но когда я открываю вид "Мозаика", почему я могу видеть только два? Или, почему не все мои камеры отображаются, когда я использую вид "Мозаика"?

source: By default most browsers only support a small number of simultaneous connections to any given server. Using the montage view usually requires one persistent connection for each camera plus intermittent connections for other information such as statuses.
ru: По умолчанию большинство браузеров поддерживают только небольшое количество одновременных соединений с любым сервером. Использование виджета мозаики обычно требует одного постоянного соединения для каждой камеры, а также периодических соединений для другой информации, такой как статусы.

source: In firefox you can increase the limit, but other browsers are not configurable in this way.
ru: В Firefox можно увеличить ограничение, но другие браузеры не настраиваются таким образом.

source: A solution for all browsers is something we call multi-port. We reconfigure apache to operate on ports other than the default of 80(http) or 443(https). You need to pick a range, let's say 30000 to 30010 in order to support 10 cameras. We add lines to your zoneminder apache config file as follows:
ru: Решение для всех браузеров - это то, что мы называем мультипорт. Мы переконфигурируем Apache для работы на портах, отличных от стандартных 80 (HTTP) или 443 (HTTPS). Вам нужно выбрать диапазон, скажем, с 30000 по 30010, чтобы поддерживать 10 камер. Мы добавляем строки в файл конфигурации Apache для вашей ZoneMinder следующим образом:

source: If you are using virtualhosts, you will have to add these to the VirtualHost directive as well.
ru: Если вы используете виртуальные хосты, вам придется добавить их в директиву VirtualHost.

source: Then in ZoneMinder config, Go Options -> Network and set MIN_STREAMING_PORT to 30000. Now when generating urls to stream images from ZoneMinder a port will be appended that is 30000 + MonitorId, so Monitor 1 will stream from 30001 and so on. This will allow Montage to stream from all monitors.
ru: Затем в конфигурации ZoneMinder перейдите в раздел "Настройки" -> "Сеть" и установите значение MIN_STREAMING_PORT равным 30000. Теперь при генерации URL для потоковой передачи изображений из ZoneMinder к порту будет добавлен порт, который равен 30000 + Id монитора, поэтому монитор 1 будет транслировать с 30001 и так далее. Это позволит Montage транслировать со всех мониторов.

source: Alternatively if you are in fact using only Firefox, you can increase the limit as follows:
ru: Наоборот, если вы на самом деле используете только Firefox, вы можете увеличить ограничение следующим образом:

source: Enter ``about:config`` in the address bar
ru: Введите ``about:config`` в адресную строку

source: scroll down to ``browser.cache.check_doc_frequency 3`` change the 3 to a 1
ru: прокрутите вниз до ``browser.cache.check_doc_frequency 3`` измените 3 на 1

source: I can't see more than 6 monitors in montage on my browser
ru: Я могу видеть только 6 мониторов в монтаже в моем браузере

source: Browsers such a Chrome and Safari only support up to 6 streams from the same domain. To work around that, take a look at the multi-port configuration discussed in the ``MIN_STREAMING_PORT`` configuration in :doc:`/userguide/options/options_network`
ru: Браузеры, такие как Chrome и Safari, поддерживают только до 6 потоков от одного домена. Чтобы обойти это, ознакомьтесь с многопортовой конфигурацией, обсуждаемой в конфигурации ``MIN_STREAMING_PORT`` в :doc:`/userguide/options/options_network`

source: Why is ZoneMinder using so much CPU?
ru: Почему ZoneMinder использует так много ЦП?

source: The various elements of ZoneMinder can be involved in some pretty intensive activity, especially while analysing images for motion. However generally this should not overwhelm your machine unless it is very old or underpowered.
ru: Различные элементы ZoneMinder могут быть вовлечены в довольно интенсивную деятельность, особенно при анализе изображений на движение. Однако, как правило, это не должно перегружать ваше устройство, за исключением случаев, когда оно очень старое или недостаточно мощное.

source: There are a number of specific reasons why processor loads can be high either by design or by accident. To figure out exactly what is causing it in your circumstances requires a bit of experimentation.
ru: Существует ряд специфических причин, по которым загрузка процессора может быть высокой как по дизайну, так и по ошибке. Чтобы точно определить, что вызывает это в ваших обстоятельствах, требуется немного экспериментировать.

source: The main causes are.
ru: Основные причины - это.

source: Using a video palette other than greyscale or RGB24. This can cause a relatively minor performance hit, though still significant. Although some cameras and cards require using planar palettes ZM currently doesn't support this format internally and each frame is converted to an RGB representation prior to processing. Unless you have compelling reasons for using YUV or reduced RGB type palettes such as hitting USB transfer limits I would experiment to see if RGB24 or greyscale is quicker. Put your monitors into 'Monitor' mode so that only the capture daemons are running and monitor the process load of these (the 'zmc' processes) using top. Try it with various palettes to see if it makes a difference.
ru: Используя палитру видео, отличную от серого или RGB24. Это может вызвать относительно небольшой сбой производительности, хотя все еще значительный. Хотя некоторые камеры и карты требуют использования планарных палитр ZM в настоящее время не поддерживает этот формат внутренне и каждый кадр преобразуется в представление RGB перед обработкой. Если у вас есть веские причины для использования YUV или уменьшенных палитр RGB, таких как достижение ограничений USB передачи, я бы экспериментировал, чтобы увидеть, быстрее ли RGB24 или серая. Установите свои мониторы в режим "Монитор", чтобы работали только демоны захвата, и отслеживайте загрузку этих процессов (процессы 'zmc') с помощью top. Попробуйте это с различными палитрами, чтобы увидеть, делает ли это разницу.
