Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: ru

source: Big image sizes. A image of 640x480 requires at least four times the processing of a 320x240 image. Experiment with different sizes to see what effect it may have. Sometimes a large image is just two interlaced smaller frames so has no real benefit anyway. This is especially true for analog cameras/cards as image height over 320 (NTSC) or 352 PAL) are invariably interlaced.
ru: Большие размеры изображений. Изображение размером 640x480 требует как минимум четырехкратной обработки по сравнению с изображением размером 320x240. Поэкспериментируйте с разными размерами, чтобы увидеть, какой эффект это может иметь. Иногда большое изображение - это просто два перекрывающихся меньших кадра, поэтому оно не имеет реальной пользы вообще. Это особенно верно для аналоговых камер/карт, так как высота изображения более 320 (NTSC) или 352 (PAL) являются неизменно интерполированными.

source: Capture frame rates. Unless there's a compelling reason in your case there is often little benefit in running cameras at 25fps when 5-10fps would often get you results just as good. Try changing your monitor settings to limit your cameras to lower frame rates. You can still configure ZM to ignore these limits and capture as fast as possible when motion is detected.
ru: Зафиксируйте частоту кадров. За исключением убедительной причины в вашем случае, часто есть мало пользы от работы камер со скоростью 25 кадров в секунду, когда 5-10 кадров в секунду часто дают результаты, которые так же хороши. Попробуйте изменить настройки монитора, чтобы ограничить работу ваших камер более низкой частотой кадров. Вы все еще можете настроить ZM для игнорирования этих ограничений и захвата с максимально возможной скоростью при обнаружении движения.

source: Run function. Obviously running in Record or Mocord modes or in Modect with lots of events generates a lot of DB and file activity and so CPU and load will increase.
ru: Запустите функцию. Очевидно, что при запуске в режиме записи или Mocord, а также в режиме Modect с большим количеством событий генерируется много активности базы данных и файлов, что приводит к увеличению ЦП и нагрузки.

source: Basic default detection zones. By default when a camera is added one detection zone is added which covers the whole image with a default set of parameters. If your camera covers a view in which various regions are unlikely to generate a valid alarm (ie the sky) then I would experiment with reducing the zone sizes or adding inactive zones to blank out areas you don't want to monitor. Additionally the actual settings of the zone themselves may not be optimal. When doing motion detection the number of changed pixels above a threshold is examined, then this is filter, then contiguous regions are calculated to see if an alarm is generated. If any maximum or minimum threshold is exceeded according to your zone settings at any time the calculation stops. If your settings always result in the calculations going through to the last stage before being failed then additional CPU time is used unnecessarily. Make sure your maximum and minimumzone thresholds are set to sensible values and experiment by switching ``RECORD_EVENT_STATS`` on and seeing what the actual values of alarmed pixels etc are during sample events.
ru: Базовые зоны обнаружения. По умолчанию, когда к камере добавляется одна зона обнаружения, она добавляется, которая покрывает все изображение с набором параметров по умолчанию. Если ваша камера охватывает вид, в котором различные области маловероятно будут генерировать действительный сигнал тревоги (например, небо), то я бы экспериментировал с уменьшением размеров зон или добавлением неактивных зон для затемнения областей, которые вы не хотите отслеживать. Кроме того, настройки самих зон могут быть не оптимальными. При обнаружении движения количество измененных пикселей выше порогового значения анализируется, затем фильтруется, затем рассчитываются непрерывные области, чтобы увидеть, генерируется ли сигнал тревоги. Если любое максимальное или минимальное пороговое значение превышено согласно вашим настройкам зоны в любое время расчет останавливается. Если ваши настройки всегда приводят к тому, что расчеты проходят до последней стадии перед неудачей, излишне используется дополнительное время ЦП. Убедитесь, что ваши пороговые значения максимальной и минимальной зоны установлены на разумные значения и экспериментируйте, включая ``RECORD_EVENT_STATS``, чтобы увидеть фактические значения пикселей, сгенерировавших тревогу, и т. д. во время тестовых событий.

source: Optimise your settings. After you've got some settings you're happy with then switching off ``RECORD_EVENT_STATS`` will prevent the statistics being written to the database which saves some time. Other settings which might make a difference are ``ZM_FAST_RGB_DIFFS`` and the ``JPEG_xxx_QUALITY`` ones.
ru: Оптимизируйте свои настройки. После того как у вас есть некоторые настройки, которые вам нравятся, отключение ``RECORD_EVENT_STATS`` предотвратит запись статистики в базу данных, что экономит время. Другие настройки, которые могут иметь значение, это ``ZM_FAST_RGB_DIFFS`` и ``JPEG_xxx_QUALITY``.

source: I'm sure there are other things which might make a difference such as what else you have running on the box and memory sizes (make sure there's no swapping going on). Also speed of disk etc will make some difference during event capture and also if you are watching the whole time then you may have a bunch of zms processes running also.
ru: Я уверен, что есть и другие вещи, которые могут иметь значение, такие как то, что еще работает на коробке, и размеры памяти (убедитесь, что нет свопинга). Также скорость диска и т. д. будут иметь некоторое значение при захвате событий и также, если вы смотрите все время, у вас может быть куча процессов zm.

source: I think the biggest factors are image size, colour depth and capture rate. Having said that I also don't always know why you get certains results from 'top'. For instance if I have a 'zma' daemon running for a monitor that is capturing an image. I've commented out the actual analysis so all it's doing is blending the image with the previous one. In colour mode this takes ~11 milliseconds per frame on my system and the camera is capturing at ~10fps. Using 'top' this reports the process as using ~5% of CPU and permanently in R(un) state. Changing to greyscale mode the blending takes ~4msec (as you would expect as this is roughly a third of 11) but top reports the process as now with 0% CPU and permanently in S(leep) state. So an actual CPU resource usage change of a factor of 3 causes huge differences in reported CPU usage. I have yet to get to the bottom of this but I suspect it's to do with scheduling somewhere along the line and that maybe the greyscale processing will fit into one scheduling time slice whereas the colour one won't but I have no evidence of this yet!
ru: Я думаю, что самыми большими факторами являются размер изображения, глубина цвета и скорость захвата. Говоря об этом, я также не всегда знаю, почему вы получаете определенные результаты от 'top'. Например, если у меня запущен демон 'zma' для монитора, который захватывает изображение. Я отключил анализ, так что все, что он делает, это смешивает изображение с предыдущим. В цветном режиме это занимает около 11 миллисекунд на кадр на моей системе, а камера захватывает со скоростью около 10 кадров в секунду. С помощью 'top' это сообщает о процессе, использующем около 5% ЦП и постоянно находящемся в состоянии R(un). Переключение в черно-белый режим приводит к смешиванию за 4 миллисекунды (как вы ожидаете, поскольку это примерно треть от 11), но 'top' теперь сообщает о процессе с нулевым использованием ЦП и постоянно находящимся в состоянии S(leep). Таким образом, изменение использования реального ЦП в три раза приводит к огромным различиям в отчете о использовании ЦП. Мне еще предстоит докопаться до сути этого, но я подозреваю, что это связано с планированием где-то по пути, и возможно, что черно-белая обработка может поместиться в одну временную ячейку планировщика, в то время как цветная - нет, но у меня пока нет доказательств этого!

source: Why is the timeline view all messed up?
ru: Почему вид временной шкалы весь перекошен?

source: The timeline view is a new view allowing you to see a graph of alarm activity over time and to quickly scan and home in on events of interest. However this feature is highly complex and still in beta. It is based extensively on HTML div tags, sometimes lots of them. Whilst FireFox is able to render this view successfully other browsers, particular Internet Explorer do not seem able to cope and so present a messed up view, either always or when there are a lot of events. Using the timeline view is only recommended when using FireFox, however even then there may be issues.
ru: Вид временной шкалы - это новый вид, позволяющий увидеть график активности сигналов во времени и быстро просмотреть и сосредоточиться на интересующих событиях. Однако эта функция очень сложна и все еще находится в бета-версии. Она основана в значительной степени на тегах div HTML, иногда их много. Хотя Firefox может успешно отображать этот вид, другие браузеры, особенно Internet Explorer, не кажутся способными справиться с этим и поэтому представляют искаженный вид, либо всегда, либо когда происходит много событий. Рекомендуется использовать вид временной шкалы только при использовании Firefox, однако даже тогда могут возникнуть проблемы.

source: This function has from time to time been corrupted in the SVN release or in the stable releases, try and reinstall from a fresh download.
ru: Эта функция иногда повреждается в выпуске SVN или в стабильных выпусках, попробуйте переустановить ее с новой загрузки.

source: How much Hard Disk Space / Bandwidth do I need for ZM?
ru: Сколько места на жестком диске / полосы пропускания мне нужно для ZM?

source: Please see `this online excel sheet <https://docs.google.com/spreadsheets/d/1iPMCGwlXiW8WnQuewgFhUqBs7ZaPKqXDkBtCQVHR6H0/edit?usp=sharing>`__. Note that this is just an estimate
ru: Пожалуйста, ознакомьтесь с этой онлайн-таблицей Excel `<https://docs.google.com/spreadsheets/d/1iPMCGwlXiW8WnQuewgFhUqBs7ZaPKqXDkBtCQVHR6H0/edit?usp=sharing>`__. Обратите внимание, что это всего лишь оценка

source: Or go to `this link <http://www.axis.com/products/video/design_tool/v2/>`__ for the Axis bandwidth calculator. Although this is aimed at Axis cameras it still produces valid results for any kind of IP camera.
ru: Или перейдите по этой ссылке `<http://www.axis.com/products/video/design_tool/v2/>`__ для калькулятора пропускной способности Axis. Хотя это предназначено для камер Axis, оно все еще дает действительные результаты для любой модели IP-камеры.

source: As a quick guide I have 4 cameras at 320x240 storing 1 fps except during alarm events. After 1 week 60GB of space in the volume where the events are stored (/var/www/html/zm) has been used.
ru: В качестве быстрого руководства у меня есть 4 камеры с разрешением 320x240 и скоростью записи 1 кадр в секунду, за исключением событий тревоги. После одной недели в объеме, где хранятся события (/var/www/html/zm), было использовано 60 ГБ дискового пространства.

source: When I try and run ZoneMinder I get lots of audit permission errors in the logs and it won't start
ru: Когда я пытаюсь запустить ZoneMinder, в журналах появляется много ошибок разрешений аудита, и он не запускается

source: Many Linux distributions nowadays are built with security in mind. One of the latest methods of achieving this is via SELinux (Secure Linux) which controls who is able to run what in a more precise way then traditional accounting and file based permissions (`link <https://en.wikipedia.org/wiki/Selinux>`__). If you are seeing entries in your system log like:
ru: Многие дистрибутивы Linux сегодня разрабатываются с учетом безопасности. Один из последних методов достижения этого - с помощью SELinux (Безопасный Linux), который контролирует, кто может запускать что в более точном порядке, чем традиционные учетные записи и файловые разрешения (`ссылка <https://en.wikipedia.org/wiki/Selinux>`__). Если вы видите записи в журнале системы, подобные следующим:

source: then it is likely that your system has SELinux enabled and it is preventing ZoneMinder from performaing certain activities. You then have two choices. You can either tune SELinux to permit the required operations or you can disable SELinux entirely which will permit ZoneMinder to run unhindered. Disabling SELinux is usually performed by editing its configuration file (e.g., ``/etc/selinux/config``) and then rebooting. However if you run a public server you should read up on the risks associated with disabled Secure Linux before disabling it.
ru: Затем вероятно, что ваша система имеет включенный SELinux, который предотвращает выполнение определенных операций ZoneMinder. У вас есть два выбора. Вы можете либо настроить SELinux для разрешения требуемых операций, либо полностью отключить SELinux, что позволит ZoneMinder работать без помех. Отключение SELinux обычно выполняется путем редактирования его конфигурационного файла (например, ``/etc/selinux/config``) и последующим перезапуском. Однако если вы управляете общедоступным сервером, вам следует ознакомиться с рисками, связанными с отключением Secure Linux, перед его отключением.

source: Note that SELinux may cause errors other than those listed above. If you are in any doubt then it can be worth disabling SELinux experimentally to see if it fixes your problem before trying other solutions.
ru: Обратите внимание, что SELinux может вызывать ошибки, отличные от тех, которые перечислены выше. Если у вас есть какие-либо сомнения, то стоит экспериментально отключить SELinux, чтобы увидеть, решит ли это вашу проблему, прежде чем пробовать другие решения.

source: How do I enable ZoneMinder's security?
ru: Как мне включить безопасность ZoneMinder?

source: In the console, click on ``Options->System``. Check the box next to ``ZM_OPT_USE_AUTH``. You will immediately be asked to login. The default username is 'admin' and the password is 'admin'.
ru: В консоли нажмите на ``Options->System``. Установите флажок рядом с ``ZM_OPT_USE_AUTH``. Сразу после этого вас попросят войти в систему. По умолчанию имя пользователя - 'admin', а пароль - 'admin'.

source: To Manage Users: In main console, go to ``Options->Users``.
ru: Управление пользователями: В основном консоли перейдите по пути ``Параметры->Пользователи``.

source: You may also consider to use the web server security, for example, htaccess files under Apache scope; You may even use this as an additional/redundant security on top of Zoneminders built-in security features. Note that if you choose to enable webserver auth, zmNinja may have issues. Please read the `zmNinja FAQ on basic authentication <https://zmninja.readthedocs.io/en/latest/guides/FAQ.html#i-can-t-see-streams-i-use-basic-auth>`__ for more information. Also please note that zmNinja does not support digest authentication.
ru: Вы также можете рассмотреть возможность использования безопасности веб-сервера, например, файлов .htaccess под управлением Apache; Вы даже можете использовать это как дополнительную/резервную безопасность поверх встроенных функций безопасности ZoneMinder. Обратите внимание, что если вы решите включить аутентификацию веб-сервера, у zmNinja могут возникнуть проблемы. Пожалуйста, прочтите раздел часто задаваемых вопросов `zmNinja о базовой аутентификации <https://zmninja.readthedocs.io/en/latest/guides/FAQ.html#i-can-t-see-streams-i-use-basic-auth>`__ для получения дополнительной информации. Также обратите внимание, что zmNinja не поддерживает аутентификацию методом хэширования.

source: Managing system load (with IP Cameras in mind)
ru: Управление нагрузкой системы (с учетом IP-камер)

source: Introduction
ru: Введение

source: Zoneminder is a superb application in every way, but it does a job that needs a lot of horsepower especially when using multiple IP cameras. IP Cams require an extra level of processing to analogue cards as the jpg or mjpeg images need to be decoded before analysing. This needs grunt. If you have lots of cameras, you need lots of grunt.
ru: Zoneminder - это превосходное приложение во всех отношениях, но оно выполняет работу, которая требует большого количества вычислительной мощности особенно при использовании нескольких IP-камер. IP-камеры требуют дополнительного уровня обработки к аналоговым картам, так как изображения в формате jpg или mjpeg должны быть декодированы перед анализом. Это требует мощности. Если у вас много камер, вам нужно много мощности.

source: Why do ZM need so much grunt? Think what Zoneminder is actually doing. In modect mode ZM is: 1. Fetching a jpeg from the camera. (Either in single part or multipart stream) 2. Decoding the jpeg image. 3. Comparing the zoned selections to the previous image or images and applying rules. 4. If in alarm state, writing that image to the disk and updating the mysql database.
ru: Почему ZM требует так много мощности? Подумайте, что делает Zoneminder на самом деле. В режиме минимальной загрузки ZM выполняет следующие действия: 1. Получает jpeg-изображение с камеры. (Либо в виде одиночного файла, либо в виде многопотокового потока) 2. Декодирует изображение jpeg. 3. Сравнивает выбранные зоны с предыдущим изображением или изображениями и применяет правила. 4. Если система находится в состоянии тревоги, записывает это изображение на диск и обновляет базу данных MySQL.

source: If you're capturing at five frames per second, the above is repeated five times every second, multiplied by the number of cameras. Decoding the images is what takes the real power from the processor and this is the main reason why analogue cameras which present an image ready-decoded in memory take less work.
ru: Если вы снимаете со скоростью пять кадров в секунду, вышеуказанное повторяется пять раз в секунду, умноженное на количество камер. Декодирование изображений - это то, что отнимает реальную мощность у процессора, и именно поэтому аналоговые камеры, которые представляют изображение уже декодированным в памяти, требуют меньше работы.

source: How do I know if my computer is overloaded?
ru: Как мне узнать, перегружен ли мой компьютер?

source: If your CPU is running at 100% all the time, it's probably overloaded (or running at exact optimisation). If the load is consistently high (over 10.0 for a single processor) then Bad Things happen - like lost frames, unrecorded events etc. Occasional peaks are fine, normal and nothing to worry about.
ru: Если ваш ЦП работает на 100% все время, скорее всего, он перегружен (или работает на точной оптимизации). Если нагрузка постоянно высока (более 10,0 для однопроцессорной системы), происходят плохие вещи - такие как потеря кадров, незаписанные события и т. д. Периодические пики нормальны, обычны и не о чем беспокоиться.

source: Zoneminder runs on Linux, Linux measures system load using "load", which is complicated but gives a rough guide on what the computer is doing at any given time. Zoneminder shows Load on the main page (top right) as well as disk space. Typing "uptime" on the command line will give a similar guide, but with three figures to give a fuller measure of what's happening over a period of time but for the best guide to see what's happening, install "htop" - which gives easy to read graphs for load, memory and cpu usage.
ru: Zoneminder работает под управлением Linux, Linux измеряет нагрузку на систему с помощью "load", что сложно, но дает общее представление о том, чем занимается компьютер в любое данное время. Zoneminder отображает нагрузку на главной странице (вверху справа) так же, как и дисковое пространство. Введя "uptime" в командной строке, вы получите аналогичное руководство, но с тремя цифрами для более полного измерения того, что происходит в течение определенного периода времени, но для лучшего руководства по тому, что происходит, установите "htop" - который предоставляет легко читаемые графики для нагрузки, памяти и использования ЦП.

source: A load of 1.0 means the processor has "just enough to do right now". Also worth noting that a load of 4.0 means exactly the same for a quad processor machine - each number equals a single processor's workload. A very high load can be fine on a computer that has a stacked workload - such as a machine sending out bulk emails, or working its way through a knotty problem; it'll just keep churning away until it's done. However - Zoneminder needs to process information in real time so it can't afford to stack its jobs, it needs to deal with them right away.
ru: Загрузка 1.0 означает, что процессор имеет "достаточно работы прямо сейчас". Также стоит отметить, что загрузка 4.0 означает точно то же самое для машины с четырьмя процессорами - каждое число равно нагрузке одного процессора. Очень высокая загрузка может быть приемлема на компьютере с высокой рабочей нагрузкой - например, на машине, рассылающей массовые электронные письма, или пытающейся решить сложную проблему; он просто продолжит работать до тех пор, пока не будет выполнен. Однако - ZoneMinder должен обрабатывать информацию в реальном времени, поэтому он не может позволить себе накапливать свои задачи, ему нужно обрабатывать их немедленно.

source: For a better and full explanation of Load: `Please read this <https://en.wikipedia.org/wiki/Load_%28computing%29>`__
ru: Для лучшего и полного объяснения Load: «Пожалуйста, прочитайте это <https://en.wikipedia.org/wiki/Load_%28computing%29>»

source: My load is too high, how can I reduce it?
ru: Моя нагрузка слишком высока, как я могу ее снизить?

source: (The previous documentation explained how to use turbo jpeg libraries as an optimization technique. These libraries have long been part of standard linux distros since that article was authored and hence that section has been removed)
ru: (Предыдущая документация объясняла, как использовать библиотеки turbo jpeg в качестве оптимизационной техники. Эти библиотеки давно являются частью стандартных дистрибутивов Linux с тех пор, как была написана эта статья, и поэтому этот раздел был удален)

source: Zoneminder is *very* tweakable and it's possible to tune it to compromise. The following are good things to try, in no particular order;
ru: Zoneminder очень настраиваемый и его можно настроить для компромисса. Вот что стоит попробовать, в произвольном порядке;

source: If your camera allows you to change image size, think whether you can get away with smaller images. Smaller pics = less load. 320x240 is usually ok for close-up corridor shots.
ru: Если ваша камера позволяет изменять размер изображения, подумайте, сможете ли вы обойтись меньшими изображениями. Меньшие картинки = меньше нагрузки. 320x240 обычно достаточно для портретных коридорных снимков.

source: Go Black and White. Colour pictures use twice to three times the CPU, memory and diskspace but give little benefit to identification.
ru: Идите Черный и Белый. Цветные изображения используют в два-три раза больше ЦП, памяти и дискового пространства, но дают мало пользы для идентификации.

source: Reduce frames per second. Halve the fps, halve the workload. If your camera supports fps throttling (Axis do), try that - saves ZM having to drop frames from a stream. 2-5 fps seems to be widely used.
ru: Уменьшить количество кадров в секунду. Уменьшите количество кадров в секунду вдвое, уменьшите нагрузку. Если ваша камера поддерживает регулировку частоты кадров (Axis поддерживает), попробуйте это - ZM не придется пропускать кадры из потока. 2-5 кадров в секунду, кажется, широко используются.
