Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: ru

source: Experiment with using jpeg instead of mjpeg. Some users have reported it gives better performance, but YMMV.
ru: Поэкспериментируйте с использованием jpeg вместо mjpeg. Некоторые пользователи сообщают, что это дает лучшие результаты, но YMMV.

source: Tweak the zones. Keep them as small and as few as possible. Stick to one zone unless you really need more. Read `this <https://wiki.zoneminder.com/index.php/Understanding_ZoneMinder%27s_Zoning_system_for_Dummies>`__ for an easy to understand explanation along with the official Zone guide.
ru: Подкрутите зоны. Держите их как можно меньше и как можно меньше. Придерживайтесь одной зоны, если вам действительно нужно больше. Прочтите «это <https://wiki.zoneminder.com/index.php/Understanding_ZoneMinder%27s_Zoning_system_for_Dummies>» для простого объяснения, а также официального руководства по зонам.

source: Schedule. If you are running a linux system at near capacity, you'll need to think carefully about things like backups and scheduled tasks. updatedb - the process which maintains a file database so that 'locate' works quickly, is normally scheduled to run once a day and if on a busy system can create a heavy increase on the load. The same is true for scheduled backups, especially those which compress the files. Re-schedule these tasks to a time when the cpu is less likely to be busy, if possible - and also use the "nice" command to reduce their priority. (crontab and /etc/cron.daily/ are good places to start)
ru: Расписание. Если вы работаете под управлением системы Linux при почти полной загрузке, вам придется тщательно подумать о таких вещах, как резервное копирование и запланированные задачи. updatedb - процесс, который поддерживает файловую базу данных, чтобы "locate" работал быстро, обычно запускается один раз в день и на загруженной системе может вызвать значительное увеличение нагрузки. То же самое верно и для запланированных резервных копий, особенно тех, которые сжимают файлы. Перенесите эти задачи на время, когда ЦП менее вероятно будет занят, если это возможно - и также используйте команду "nice", чтобы снизить их приоритет. (crontab и /etc/cron.daily/ - хорошее место для начала)

source: Reduce clutter on your PC. Don't run X unless you really need it, the GUI is a huge overhead in both memory and cpu.
ru: Уменьшите загромождение на вашем ПК. Не запускайте X, если вам действительно это не нужно, графический интерфейс является огромным избытком как в памяти, так и в процессоре.

source: More expensive options:
ru: Более дорогие варианты:

source: Increase RAM. If your system is having to use disk swap it will HUGELY impact performance in all areas. Again, htop is a good monitor - but first you need to understand that because Linux is using all the memory, it doesn't mean it needs it all - linux handles ram very differently to Windows/DOS and caches stuff. htop will show cached ram as a different colour in the memory graph. Also check that you're actually using a high memory capable kernel - many kernels don't enable high memory by default.
ru: Увеличьте объем оперативной памяти. Если вашей системе приходится использовать файл подкачки, это окажет огромное влияние на производительность во всех областях. Еще раз, htop - хороший монитор - но сначала вам нужно понять, что поскольку Linux использует всю память, это не означает, что ему нужно все - Linux обрабатывает память совершенно иначе, чем Windows/DOS, и кэширует данные. htop покажет кэшированную память другого цвета в графике памяти. Также проверьте, что вы используете высокоемкий ядро - многие ядра по умолчанию не поддерживают высокоемкость.

source: Faster CPU. Simple but effective. Zoneminder also works very well with multiple processor systems out of the box (if SMP is enabled in your kernel). The load of different cameras is spread across the processors.
ru: Быстрый процессор. Просто, но эффективно. Zoneminder также работает очень хорошо с многопроцессорными системами прямо из коробки (если SMP включено в вашей ядре). Загрузка разных камер распределяется между процессорами.

source: Try building Zoneminder with processor specific instructions that are optimised to the system it will be running on, also increasing the optimisation level of GCC beyond -O2 will help. This topic is beyond the scope of this document.
ru: Попробуйте построить ZoneMinder с процессорозависимыми инструкциями, оптимизированными для системы, на которой она будет работать, а также увеличение уровня оптимизации GCC сверх -O2 поможет. Эта тема выходит за рамки данного документа.

source: Processor specific commands can be found in the `GCC manual <https://gcc.gnu.org/onlinedocs/gcc/>`__ along with some more options that may increase performance.
ru: Команды, специфичные для процессора, можно найти в руководстве по `GCC <https://gcc.gnu.org/onlinedocs/gcc/>`__, а также некоторые дополнительные опции, которые могут повысить производительность.

source: What about disks and bandwidth?
ru: Что насчет дисков и пропускной способности?

source: A typical 100mbit LAN will cope with most setups easily. If you're feeding from cameras over smaller or internet links, obviously fps will be much lower.
ru: Типичная 100-мегабитная локальная сеть легко справится с большинством конфигураций. Если вы получаете данные от камер через меньшие или интернет-соединения, очевидно, что кадров в секунду будет намного меньше.

source: Disk and Bandwidth calculators are referenced in :ref:`disk_bw_faq`.
ru: Дисковые и сетевые калькуляторы упоминаются в :ref:`disk_bw_faq`.

source: How do I build for X10 support?
ru: Как мне построить поддержку X10?

source: You do not need to rebuild ZM for X10 support. You will need to install the perl module and switch on X10 in the options, then restart. Installing the perl module is covered in the README amongst other places but in summary, do:
ru: Вам не нужно перестраивать ZM для поддержки X10. Вам потребуется установить модуль Perl и включить X10 в настройках, а затем перезапустить. Установка модуля Perl описана в README, но вкратце, сделайте следующее:

source: Extending Zoneminder
ru: Расширение ZoneMinder

source: How can I get ZM to do different things at different times of day or week?
ru: Как я могу заставить ZM делать разные вещи в разное время дня или недели?

source: If you want to configure ZoneMinder to do motion detection during the day and just record at night, for example, you will need to use ZoneMinder 'run states'. A run state is a particular configuration of monitor functions that you want to use at any time.
ru: Если вы хотите настроить ZoneMinder для обнаружения движения в течение дня и просто записи ночью, например, вам потребуется использовать состояния выполнения ZoneMinder. Состояние выполнения - это определенная конфигурация функций мониторинга, которую вы хотите использовать в любое время.

source: To save a run state you should first configure your monitors for Modect, Record, Monitor etc as you would want them during one of the times of day. Then click on the running state link at the top of the Console view. This will usually say 'Running' or 'Stopped'. You will then be able to save the current state and give it a name, 'Daytime' for example. Now configure your monitors how you would want them during other times of day and save that, for instance as 'Nighttime'.
ru: Чтобы сохранить состояние выполнения, сначала настройте свои мониторы для режима Modect, Запись, Мониторинг и т. д., как вы бы хотели их во время одного из временных интервалов. Затем щелкните ссылку на текущее состояние выполнения в верхней части виджета консоли. Обычно это будет либо "Выполняется", либо "Остановлено". Затем вы сможете сохранить текущее состояние и дать ему имя, например, "Дневное время". Теперь настройте свои мониторы так, как вы бы хотели их во время других временных интервалов, и сохраните это, например, как "Ночное время".

source: Now you can switch between these two states by selecting them from the same dialog you saved them, or from the command line from issue the command ''zmpkg.pl <run state>'', for example ''zmpkg.pl Daytime''.
ru: Теперь вы можете переключаться между этими двумя состояниями, выбрав их из того же диалога, в котором вы их сохранили, или из командной строки, введя команду ''zmpkg.pl <состояние выполнения>'', например ''zmpkg.pl День''.

source: The final step you need to take, is scheduling the time the changes take effect. For this you can use `cron <https://en.wikipedia.org/wiki/Cron>`__. A simple entry to change to the Daylight state at at 8am and to the nighttime state at 8pm would be as follows,
ru: Последний шаг, который вам нужно предпринять, это назначить время, в которое будут вступать в силу изменения. Для этого вы можете использовать `cron <https://en.wikipedia.org/wiki/Cron>`__. Простой пример для перехода в дневной режим в 8 утра и в ночной режим в 8 вечера будет следующим,

source: On Ubuntu 7.04 and possibly others, look in /usr/bin not just /usr/local/bin for the zmpkg.pl file.
ru: На Ubuntu 7.04 и, возможно, других операционных системах, ищите файл zmpkg.pl в каталоге /usr/bin, а не только в /usr/local/bin.

source: Although the example above describes changing states at different times of day, the same principle can equally be applied to days of the week or other more arbitrary periods.
ru: Хотя пример выше описывает изменение состояний в разное время суток, тот же принцип можно с равным успехом применять к дням недели или другим более произвольным периодам.

source: How can I use ZoneMinder to trigger something else when there is an alarm?
ru: Как я могу использовать ZoneMinder для запуска чего-то еще при срабатывании сигнала тревоги?

source: ZoneMinder includes a perl API which means you can create a script to interact with the ZM shared memory data and use it in your own scripts to react to ZM alarms or to trigger ZM to generate new alarms. Full details are in the README or by doing ``perldoc ZoneMinder`` etc.
ru: ZoneMinder включает в себя API на языке Perl, что означает, что вы можете создать скрипт для взаимодействия с данными общей памяти ZM и использовать его в своих собственных скриптах для реагирования на сигналы тревоги ZM или для запуска ZM для генерации новых сигналов тревоги. Полностью см. в README или выполнив ``perldoc ZoneMinder`` и т.д.

source: ZoneMinder provides a sample alarm script called `zmalarm.pl <https://github.com/ZoneMinder/zoneminder/blob/master/utils/zm-alarm.pl>`__ that you can refer to as a starting point.
ru: ZoneMinder предоставляет образец скрипта тревоги под названием `zmalarm.pl <https://github.com/ZoneMinder/zoneminder/blob/master/utils/zm-alarm.pl>`__ , к которому вы можете обратиться как к отправной точке.

source: Trouble Shooting
ru: Исправление ошибок

source: Here are some things that will help you track down what's wrong. This is also how to obtain the info that we need to help you on the forums.
ru: Вот несколько вещей, которые помогут вам отследить, что не так. Это также способ получить информацию, которую мы должны использовать, чтобы помочь вам на форумах.

source: What logs should I check for errors?
ru: Какие журналы мне следует проверить на наличие ошибок?

source: ZoneMinder creates its own logs and are usually located in the ``/var/log/`` directory. Refer to the logging discussion in :doc:`/userguide/options/options_logging` for more details on where logs are stored and how to enable various log levels.
ru: ZoneMinder создает свои собственные журналы и обычно находятся в директории ``/var/log/`` . Обратитесь к обсуждению журнала в :doc:`/userguide/options/options_logging` для получения дополнительной информации о том, где хранятся журналы и как включить различные уровни журналов.

source: Since ZM is dependent on other components to work, you might not find errors in ZM but in the other components.
ru: Поскольку ZM зависит от других компонентов для работы, вы можете не найти ошибок в ZM, но в других компонентах.

source: If ZM is not functioning, you should always be able to find an error in at least one of these logs. Use the [[tail]] command to get info from the logs. This can be done like so:
ru: Если ZM не работает, вы всегда должны быть в состоянии найти ошибку по крайней мере в одном из этих логов. Используйте команду [[tail]], чтобы получить информацию из логов. Это можно сделать так:

source: This will append any data entered to any of these logs to your console screen (``-f``). To exit, hit [ctrl -c].
ru: Это добавит любые данные, введенные пользователем, в любой из этих журналов на экран консоли (``-f``). Чтобы выйти, нажмите [ctrl -c].

source: How can I trouble shoot the hardware and/or software?
ru: Как я могу устранить неполадки в аппаратном и/или программном обеспечении?

source: Here are some commands to get information about your hardware. Some commands are distribution dependent. * ``[[lspci]] -vv`` -- Returns lots of detailed info. Check for conflicting interrupts or port assignments. You can sometimes alter interrupts/ ports in bios. Try a different pci slot to get a clue if it is HW conflict (command provided by the pciutils package). * ``[[scanpci]] -v`` -- Gives you information from your hardware EPROM * ``[[lsusb]] -vv`` -- Returns lots of detail about USB devices (camand provided by usbutils package). * ``[[dmesg]]`` -- Shows you how your hardware initialized (or didn't) on boot-up. You will get the most use of this. * ``[[v4l-info]]`` -- to see how driver is talking to card. look for unusual values. * ``[[modinfo bttv]]`` -- some bttv driver stats. * ``[[zmu]] -m 0 -q -v`` -- Returns various information regarding a monitor configuration. * ``[[ipcs]] `` -- Provides information on the ipc facilities for which the calling process has read access. * ``[[ipcrm]] `` -- The ipcrm command can be used to remove an IPC object from the kernel. * ``cat /proc/interrupts`` -- This will display what interrupts your hardware is using.
ru: Вот некоторые команды для получения информации о вашем оборудовании. Некоторые команды зависят от дистрибутива. * ``[[lspci]] -vv`` -- Возвращает много подробной информации. Проверьте конфликтующие прерывания или назначения портов. Иногда вы можете изменить прерывания/порты в BIOS. Попробуйте использовать другой слот PCI, чтобы получить подсказку, если это конфликт оборудования (команда предоставлена пакетом pciutils). * ``[[scanpci]] -v`` -- Дает вам информацию из ПЗУ вашего оборудования * ``[[lsusb]] -vv`` -- Возвращает много деталей о USB-устройствах (команда предоставлена пакетом usbutils). * ``[[dmesg]]`` -- Показывает, как ваше оборудование инициализировалось при загрузке (или не инициализировалось). Вы получите наибольшую пользу от этого. * ``[[v4l-info]]`` -- чтобы увидеть, как драйвер общается с картой. Ищите необычные значения. * ``[[modinfo bttv]]`` -- некоторые статистические данные драйвера bttv. * ``[[zmu]] -m 0 -q -v`` -- Возвращает различную информацию о конфигурации монитора. * ``[[ipcs]] `` -- Предоставляет информацию о службах ipc, к которым у вызывающего процесса есть доступ на чтение. * ``[[ipcrm]] `` -- Команда ipcrm может использоваться для удаления объекта ipc из ядра. * ``cat /proc/interrupts`` -- Это покажет, какие прерывания использует ваше оборудование.

source: Why am I getting a 403 access error with my web browser when trying to access http //localhost/zm?
ru: Почему я получаю ошибку доступа 403 с помощью своего веб-браузера при попытке доступа к http://localhost/zm?

source: The apache web server needs to have the right permissions and configuration to be able to read the Zoneminder files. Check the forums for solution, and edit the apache configuration and change directory permissions to give apache the right to read the Zoneminder files. Depending on your Zoneminder configuration, you would use the zm user and group that Zoneminder was built with, such as wwwuser and www.
ru: Сервер Apache должен иметь правильные разрешения и конфигурацию для чтения файлов ZoneMinder. Поищите решение на форумах, отредактируйте конфигурацию Apache и измените разрешения директории, чтобы Apache мог читать файлы ZoneMinder. В зависимости от вашей конфигурации ZoneMinder, вы бы использовали пользователя и группу ZoneMinder, такие как wwwuser и www.

source: Why am I getting broken images when trying to view events?
ru: Почему я получаю изображения с ошибками при попытке просмотреть события?

source: Zoneminder and the Apache web server need to have the right permissions. Check `this forum topic <https://forums.zoneminder.com/viewtopic.php?p=48754>`__ and similar ones:
ru: ZoneMinder и веб-сервер Apache должны иметь правильные разрешения. Проверьте эту тему форума: `<https://forums.zoneminder.com/viewtopic.php?p=48754>` и подобные ей:

source: I can review events for the current day, but ones from yesterday and beyond error out
ru: Я могу просмотреть события за текущий день, но вчерашние и более поздние вызывают ошибку

source: If you've checked that the ``www-data`` user has permissions to the storage folders, perhaps your php.ini's timezone setting is incorrect. They _must_ match for certain playback functions.
ru: Если вы проверили, что пользователь ``www-data`` имеет разрешения на каталоги хранения, возможно, настройка времени в файле php.ini неверна. Они должны совпадать для определенных функций воспроизведения.

source: If you're using Linux, this can be found using the following command:
ru: Если вы используете Linux, это можно найти, используя следующую команду:

source: If using FreeBSD, you can use this one-liner:
ru: Если вы используете FreeBSD, вы можете использовать эту одну строку:

source: Once you know what timezone your system is set to make sure you set the right time zone in ZM (Available in ``Options->System->TimeZone``)
ru: После того как вы узнаете, какой часовой пояс установлен на вашей системе, убедитесь, что вы установили правильный часовой пояс в ZM (доступно в «Настройки->Система->Часовой пояс»).

source: Why is the image from my color camera appearing in black and white?
ru: Почему изображение с моей цветной камеры появляется в черно-белом цвете?

source: If you recently upgraded to zoneminder 1.26, there is a per camera option that defaults to black and white and can be mis-set if your upgrade didn't happen right. See this thread: https://forums.zoneminder.com/viewtopic.php?f=30&t=21344
ru: Если вы недавно обновились до ZoneMinder 1.26, есть опция для каждой камеры, которая по умолчанию установлена в черно-белый режим и может быть неправильно установлена, если ваше обновление не было выполнено правильно. См. эту тему: https://forums.zoneminder.com/viewtopic.php?f=30&t=21344

source: This may occur if you have a NTSC analog camera but have configured the source in ZoneMinder as PAL for the Device Format under the source tab. You may also be mislead because zmu can report the video port as being PAL when the camera is actually NTSC. Confirm the format of your analog camera by checking it's technical specifications, possibly found with the packaging it came in, on the manufacturers website, or even on the retail website where you purchased the camera. Change the Device Format setting to NTSC and set it to the lowest resolution of 320 x 240. If you have confirmed that the camera itself is NTSC format, but don't get a picture using the NTSC setting, consider increasing the shared memory '''kernel.shmall''' and '''kernel.shmmax''' settings in /etc/sysctl.conf to a larger value such as 268435456. This is also the reason you should start with the 320x240 resolution, so as to minimize the potential of memory problems which would interfere with your attempts to troubleshoot the device format issue. Once you have obtained a picture in the monitor using the NTSC format, then you can experiment with raising the resolution.
ru: Это может произойти, если у вас аналоговая камера NTSC, но вы настроили источник в ZoneMinder как PAL для формата устройства на вкладке источника. Вы также можете быть обмануты, потому что zmuc может сообщить о порте видео как PAL, когда камера на самом деле NTSC. Проверьте формат вашей аналоговой камеры, проверив ее технические характеристики, возможно, найденные в упаковке, на веб-сайте производителя или даже на веб-сайте розничной торговли, где вы приобрели камеру. Установите параметр формата устройства на NTSC и установите его на самое низкое разрешение 320 x 240. Если вы подтвердили, что камера сама по себе является форматом NTSC, но не получаете изображения при использовании формата NTSC, рассмотрите возможность увеличения настроек shared memory 'kernel.shmall' и 'kernel.shmmax' в /etc/sysctl.conf до большего значения, например, 268435456. Это также причина, по которой вам следует начать с разрешения 320x240, чтобы минимизировать потенциальные проблемы с памятью, которые могут помешать вашим попыткам устранить проблему с форматом устройства. Как только вы получите изображение на мониторе в формате NTSC, вы можете экспериментировать с повышением разрешения.

source: Why do I only see blue screens with a timestamp when monitoring my camera?
ru: Почему я вижу только синие экраны с временем при мониторинге моей камеры?

source: If this camera is attached to a capture card, then you may have selected the wrong Device Source or Channel when configuring the monitor in the ZoneMinder console. If you have a capture card with 2 D-sub style inputs(looks like a VGA port) to which you attach a provided splitter that splits off multiple cables, then the splitter may be attached to the wrong port. For example, PV-149 capture cards have two D-sub style ports labeled as DB1 and DB2, and come packaged with a connector for one of these ports that splits into 4 BNC connecters. The initial four video ports are available with the splitter attached to DB1.
ru: Если эта камера подключена к карте захвата, возможно, вы выбрали неправильный источник устройства или канал при настройке монитора в консоли ZoneMinder. Если у вас есть карта захвата с двумя разъемами D-sub стиля (выглядит как разъем VGA), к которому вы подключаете предоставленный разветвитель, который разделяет несколько кабелей, то разветвитель может быть подключен к неправильному порту. Например, карты PV-149 имеют два разъема D-sub стиля, обозначенные как DB1 и DB2, и поставляются с соединителем для одного из этих портов, который разделяется на четыре разъема BNC. Изначально доступно четыре видеопорта с разветвителем, подключенным к DB1.

source: Why do I only see black screens with a timestamp when monitoring my camera?
ru: Почему я вижу только черные экраны с временем при мониторинге моей камеры?

source: In the monitor windows where you see the black screen with a timestamp, select settings and enter the Brightness, Contrast, Hue, and Color settings reported for the device by ``zmu -d <device_path> -q -v``. 32768 may be appropriate values to try for these settings. After saving the settings, select Settings again to confirm they saved successfully.
ru: В окне монитора, где вы видите черный экран с временем, выберите настройки и введите значения яркости, контрастности, насыщенности и цветового баланса, указанные для устройства командой `zmu -d <путь_устройства> -q -v`. Значения 32768 могут быть подходящими для этих настроек. После сохранения настроек снова выберите Настройки, чтобы убедиться, что они были сохранены успешно.

source: How do I repair the MySQL Database?
ru: Как мне исправить базу данных MySQL?

source: There is two ways to go about this. In most cases you can run from the command prompt -> ``mysqlcheck --all-databases --auto-repair -p your_database_password -u your_databse_user``
ru: Есть два способа подойти к этому. В большинстве случаев вы можете запустить командную строку -> ``mysqlcheck --all-databases --auto-repair -p ваш_база_данных_пароль -u ваш_база_данных_пользователь``.
