Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: ru

source: If that does not work then you will have to make sure that ZoneMinder is stopped then run the following (nothing should be using the database while running this and you will have to adjust for your correct path if it is different):
ru: Если это не работает, вам придется убедиться, что Zoneminder остановлен, а затем выполнить следующее (ничего не должно использовать базу данных при выполнении этого, и вам придется скорректировать его для вашего правильного пути, если он отличается):

source: How do I repair the MySQL Database when the cli fails?
ru: Как мне исправить базу данных MySQL, когда командная строка терпит неудачу?

source: In Ubuntu, the commands listed above do not seem to work. However, actually doing it by hand from within MySQL does. (But that is beyond the scope of this document) But that got me thinking... And phpmyadmin does work. Bring up a terminal. ``sudo apt-get install phpmyadmin``
ru: В Ubuntu команды, перечисленные выше, не работают. Однако, выполнив их вручную из MySQL, они работают. (Но это выходит за рамки данного документа) Но это заставило меня задуматься... И phpmyadmin работает. Откройте терминал. ``sudo apt-get install phpmyadmin``

source: Now go to ``http://zoneminder_IP/`` and stop the ZM service. Continue to ``http://zoneminder_IP/phpmyadmin`` and select the zoneminder database. Select and tables marked 'in use' and pick the action 'repare' to fix. Restart the zoneminder service from the web browser. Remove or disable the phpmyadmin tool, as it is not always the most secure thing around, and opens your database wide to any skilled hacker. ``sudo apt-get remove phpmyadmin``
ru: Что-то в вашем вопросе меня смущает. Может, поговорим на другую тему?

source: I upgraded by distribution and ZM stopped working
ru: Я обновил свою дистрибуцию, и ZM перестала работать.

source: Some possibilities (Incomplete list and subject to correction) ``[[/usr/local/bin/zmfix: /usr/lib/libmysqlclient.so.15: version `MYSQL_5.0' not found (required by /usr/local/bin/zmfix)]]`` :: Solution: Recompile and reinstall Zoneminder. Any time you update a major version that ZoneMinder depends on, you need to recompile ZoneMinder.
ru: Некоторые возможности (неполный список и подлежащий исправлению) ``[[/usr/local/bin/zmfix: /usr/lib/libmysqlclient.so.15: version `MYSQL_5.0' not found (required by /usr/local/bin/zmfix)]]`` :: Решение: Перекомпилируйте и переустановите Zoneminder. Каждый раз, когда вы обновляете основную версию, на которую опирается ZoneMinder, вам необходимо перекомпилировать ZoneMinder.

source: Zoneminder doesn't start automatically on boot
ru: ZoneMinder не запускается автоматически при загрузке

source: Check the list for log entries like "zmfix[766]: ERR [Can't connect to server: Can't connect to local MySQL server through socket '/var/run/mysqld/mysqld.sock' (2)] ". What can happen is that zoneminder is started too quickly after Mysql and tries to contact the database server before it's ready. Zoneminder gets no answer and aborts. August 2010 - Ubuntu upgrades seem to be leaving several systems in this state. One way around this is to add a delay to the zoneminder startup script allowing Mysql to finish starting. "Simply adding 'sleep 15' in the line above 'zmfix -a' in the /etc/init.d/zoneminder file fixed my ZoneMinder startup problems!" - credit to Pada.
ru: Проверьте список записей журналов, похожих на "zmfix[766]: ERR [Can't connect to server: Can't connect to local MySQL server through socket '/var/run/mysqld/mysqld.sock' (2)]". Возможная причина заключается в том, что Zoneminder запускается слишком быстро после MySQL и пытается связаться с сервером базы данных до того, как он будет готов. Zoneminder не получает ответа и прерывает работу. Август 2010 года - обновления Ubuntu, похоже, оставляют несколько систем в таком состоянии. Один из способов обойти это - добавить задержку в скрипт запуска Zoneminder, позволяющую MySQL завершить свой запуск. "Добавление строки 'sleep 15' над строкой 'zmfix -a' в файле /etc/init.d/zoneminder" решило мою проблему с запуском ZoneMinder!" - благодарность Pada.

source: Remote Path setup for Panasonic and other Camera
ru: Настройка удаленного пути для Panasonic и других камер

source: On adding or editing the source you can select the preset link for the parameters for the specified camera . In version 1.23.3 presets for BTTV,Axis,Panasonic,GadSpot,VEO, and BlueNet are available . Selecting the presets ZM fills up the required value for the remote path variable
ru: При добавлении или редактировании источника вы можете выбрать предустановленную ссылку для параметров для указанной камеры. В версии 1.23.3 доступны предустановки для BTTV, Axis, Panasonic, GadSpot, VEO и BlueNet. Выбрав предустановки, ZM заполняет требуемое значение для переменной пути удаленного доступа.

source: Why do I get repeated/ mixed/unstable/ blank monitors on bt878-like cards (a.k.a. PICO 2000)
ru: Почему я получаю повторяющиеся/смешанные/нестабильные/пустые мониторы на картах типа bt878 (также известные как PICO 2000)

source: Please have a check at [[Pico2000]];
ru: Пожалуйста, проверьте [[Pico2000]].

source: What causes "Invalid JPEG file structure: two SOI markers" from zmc (1.24.x)
ru: Что вызывает "Неправильная структура файла JPEG: два маркера SOI" от zmc (1.24.x)

source: Some settings that used to be global only are now per camera. On the Monitor Source tab, if you are using Remote Protocol "HTTP" and Remote Method "Simple", try changing Remote Method to "Regexp".
ru: Некоторые настройки, которые раньше были глобальными, теперь относятся к каждой камере. На вкладке "Источник монитора" попробуйте изменить метод удаленного доступа с "HTTP" на "Regexp", если вы используете протокол удаленного доступа "HTTP" и метод удаленного доступа "Простой".

source: Miscellaneous
ru: Разное

source: I see ZoneMinder is licensed under the GPL. What does that allow or restrict me in doing with ZoneMinder?
ru: Я вижу, что ZoneMinder лицензируется под GPL. Что это позволяет или запрещает мне делать с ZoneMinder?

source: The ZoneMinder license is described at the end of the documentation and consists of the following section
ru: Лицензия ZoneMinder описана в конце документации и состоит из следующего раздела

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
ru: Этот программное обеспечение является свободным программным обеспечением; вы можете распространять его и / или изменять его в соответствии с условиями GNU Общественной лицензии, как опубликовано Фондом свободного программного обеспечения; либо версия 2 Лицензии, или (по вашему выбору) любая последующая версия.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
ru: Этот программный продукт распространяется в надежде, что он будет полезен, но БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ; без даже подразумеваемой гарантии пригодности для продажи или пригодности для конкретной цели. См. GNU Общественную лицензию для получения более подробной информации.

source: This means that ZoneMinder is licensed under the terms described `here <https://www.gnu.org/licenses/old-licenses/gpl-2.0.html>`__. There is a comprehensive FAQ covering the GPL at https://www.gnu.org/licenses/gpl-faq.html but in essence you are allowed to redistribute or modify GPL licensed software provided that you release your distribution or modifications freely under the same terms. You are allowed to sell systems based on GPL software. You are not allowed to restrict or reduce the rights of GPL software in your distribution however. Of course if you are just making modifications for your system locally you are not releasing changes so you have no obligations in this case. I recommend reading the GPL FAQ for more in-depth coverage of this issue.
ru: Это означает, что ZoneMinder лицензируется в соответствии с условиями, описанными здесь `<https://www.gnu.org/licenses/old-licenses/gpl-2.0.html>`. Есть подробный FAQ по GPL на https://www.gnu.org/licenses/gpl-faq.html, но вкратце вы можете распространять или модифицировать программное обеспечение с лицензией GPL при условии, что вы свободно выпускаете свою сборку или модификации под теми же условиями. Вы можете продавать системы, основанные на программном обеспечении с лицензией GPL. Однако вы не можете ограничивать или уменьшать права программного обеспечения с лицензией GPL в вашей сборке. Конечно, если вы просто делаете изменения для своей системы локально, вы не выпускаете изменения, поэтому у вас нет обязательств в этом случае. Я рекомендую прочитать FAQ GPL для более глубокого освещения этой проблемы.

source: Can I use ZoneMinder as part of my commercial product?
ru: Можно ли использовать ZoneMinder в качестве части моего коммерческого продукта?

source: The GPL license allows you produce systems based on GPL software provided your systems also adhere to that license and any modifications you make are also released under the same terms. The GPL does not permit you to include ZoneMinder in proprietary systems (see https://www.gnu.org/licenses/gpl-faq.html#GPLInProprietarySystem for details). If you wish to include ZoneMinder in this kind of system then you will need to license ZoneMinder under different terms. This is sometimes possible and you will need to contact me for further details in these circumstances.
ru: Лицензия GPL позволяет вам создавать системы на основе программного обеспечения GPL при условии, что ваши системы также соответствуют этой лицензии и любые изменения, которые вы вносите, также выпускаются на тех же условиях. Лицензия GPL не разрешает включать ZoneMinder в системы, принадлежащие частным лицам (см. https://www.gnu.org/licenses/gpl-faq.html#GPLInProprietarySystem для получения подробной информации). Если вы хотите включить ZoneMinder в такую систему, вам придется лицензировать ZoneMinder на других условиях. Это иногда возможно, и вам потребуется связаться со мной для получения дополнительной информации в таких обстоятельствах.

source: I am having issues with zmNinja and/or Event Notification Server
ru: У меня возникают проблемы с zmNinja и/или Сервером уведомлений событий

source: zmNinja and the Event Notification Server are 3rd party solutions. The developer maintains exhaustive `documentation and FAQs <https://zmninja.readthedocs.io/en/latest/>`__. Please direct your questions there.
ru: ZmNinja и сервер уведомлений об событиях - это сторонние решения. Разработчик поддерживает исчерпывающую `документацию и часто задаваемые вопросы <https://zmninja.readthedocs.io/en/latest/>`__. Пожалуйста, обращайтесь туда со своими вопросами.
