Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: ru

source: FAQ
ru: Часто задаваемые вопросы

source: needs to be reviewed - some entries may be old/invalid. I've done one round, but icOn needs to review.
ru: Нуждается в проверке - некоторые записи могут быть старыми/недействительными.

source: This is the FAQ page. Feel free to contribute any FAQs that you think are missing.
ru: Это страница часто задаваемых вопросов. Пожалуйста, внесите любые вопросы, которые, по вашему мнению, отсутствуют.

source: It is always a good idea to refer to the `ZoneMinder forums <https://forums.zoneminder.com/viewforum.php?f=26&sid=fc93f65726d3a29fbf6f610b21f52b16>`__ for tips and tricks. While we try and make sure this FAQ is pruned/adjusted to align with the latest stable release, some of the entries may no longer be accurate (or there may be better suggestions in the forums).
ru: Всегда хорошая идея обратиться к форуму `ZoneMinder <https://forums.zoneminder.com/viewforum.php?f=26&sid=fc93f65726d3a29fbf6f610b21f52b16>`__ за советами и хитростями. Хотя мы стараемся убедиться, что этот FAQ отфильтрован/настроен в соответствии с последней стабильной версией, некоторые из записей могут больше не быть точными (или на форуме могут быть лучшие предложения).

source: How can I stop ZoneMinder filling up my disk?
ru: Как мне остановить заполнение диска ZoneMinder?

source: Recent versions of ZoneMinder come with a filter you can use for this purpose already included. The filter is called **PurgeWhenFull** and to find it, click on the word **Filters** in the header. **Note** that this filter is automatically enabled if you do a fresh install of ZoneMinder including creating a new database. If you already have an existing database and are upgrading ZoneMinder, it will retain the settings of the filter (which in earlier releases was disabled by default). So you may want to check if PurgeWhenFull is enabled and if not, enable it.
ru: Последние версии ZoneMinder поставляются с фильтром, который уже включен для этой цели. Фильтр называется **Очистка при заполнении** и для его поиска нажмите на слово **Фильтры** в заголовке. **Примечание**, что этот фильтр автоматически включен, если вы делаете новую установку ZoneMinder, включая создание новой базы данных. Если у вас уже есть существующая база данных и вы обновляете ZoneMinder, он сохранит настройки фильтра (который в более ранних версиях по умолчанию был отключен). Поэтому вам может потребоваться проверить, включена ли PurgeWhenFull, и, если нет, включить ее.

source: To enable it, go to Web Console, click on the word **Filters** in the UI header.
ru: Для этого перейдите в Веб-консоль, щелкните по слову **Фильтры** в заголовке пользовательского интерфейса.

source: In the filter window there is a drop down select box labeled 'Use Filter', that lets you select a saved filter. Select 'PurgeWhenFull' and it will load that filter.
ru: В окне фильтра есть выпадающий список с названием 'Использовать фильтр', который позволяет выбрать сохраненный фильтр. Выберите 'Очистка при заполнении', и он загрузит этот фильтр.

source: Make any modifications you might want, such as the percentage full you want it to kick in, or how many events to delete at a time (it will repeat the filter as many times as needed to clear the space, but will only delete this many events each time to get there).
ru: Сделайте любые изменения, которые вы хотите, такие как процент заполнения, при котором оно должно сработать, или сколько событий удалять за раз (оно будет повторять фильтр столько раз, сколько потребуется для очистки пространства, но будет удалять только это количество событий каждый раз, чтобы добраться туда).

source: Ensure that the Run filter in background checkbox is checked. Ensure that the Delete all matches checkbox is checked.
ru: Убедитесь, что флажок "Пропускать фильтр в фоновом режиме" установлен. Убедитесь, что флажок "Удалить все совпадения" установлен.

source: Then click on 'Save'. The filter will immediately begin executing in the background to keep your disk within those limits.
ru: Затем нажмите "Сохранить". Фильтр немедленно начнет выполняться в фоновом режиме, чтобы поддерживать ваш диск в этих пределах.

source: Please note that that this filter will only affect the default storage location. If you have added other storage areas, you must create a PurgeWhenFull filter for each one, and specify the Storage Area as one of the parameters in the filter. You can duplicate the existing PurgeWhenFull filter by using Save As instead of Save.
ru: Обратите внимание, что этот фильтр будет влиять только на стандартное место хранения. Если вы добавили другие области хранения, вам необходимо создать фильтр PurgeWhenFull для каждой из них и указать область хранения как один из параметров фильтра. Вы можете скопировать существующий фильтр PurgeWhenFull, используя команду "Сохранить как", а не "Сохранить".

source: Check the ``zmfilter.log`` file to make sure it is running as sometimes missing perl modules mean that it never runs but people don't always realize.
ru: Проверьте файл ``zmfilter.log``, чтобы убедиться, что он работает, поскольку иногда отсутствующие модули Perl означают, что он никогда не запускается, но люди не всегда это понимают.

source: **Purge By Age** To delete events that are older than 7 days, create a new filter with "End Date" set to "less than" and a value of "-7 days", sort by "date/time" in "asc"ending order, then enable the checkbox "delete all matches". You can also use a value of week or week and days: "-2 week" or "-2 week 4 day"
ru: **Очистка по возрасту** Чтобы удалить события старше 7 дней, создайте новый фильтр с "Датой окончания" установленным на "менее чем" и значением "-7 дней", отсортируйте по "дате/времени" в "по возрастанию", затем активируйте флажок "удалить все совпадения". Вы также можете использовать значение недели или недели и дня: "-2 недели" или "-2 недели 4 дня"

source: Save with 'Run Filter In Background' enabled to have it run automatically. Optional skip archived events: click on the plus sign next to -7 days to add another condition. "and" "archive status" equal to "unarchived only".
ru: Сохраните с включенной опцией "Запуск фильтра в фоновом режиме", чтобы он запускался автоматически. По желанию пропустите архивные события: щелкните значок "плюс" рядом с "-7 дней", чтобы добавить еще одно условие. "и" "статус архивации" равен "только неархивированные".

source: Optional slow delete: limit the number of results to a number, say ``10`` in the filter. If you have a large backlog of events that would be deleted, this can hard spike the CPU usage for a long time. Limiting the number of results to only the first three each time the filter is run spreads out the delete processes over time, dramatically lessening the CPU load.
ru: Опциональное медленное удаление: ограничьте количество результатов числом, скажем, "10" в фильтре. Если у вас большой объем событий, которые будут удалены, это может вызвать длительный пик использования ЦП. Ограничение количества результатов только первыми тремя каждый раз, когда выполняется фильтр, распределяет процессы удаления во времени, значительно снижая нагрузку на ЦП.

source: We no longer recommend use enable ``OPT_FAST_DELETE`` or ``RUN_AUDIT`` anymore, unless you are using an old or low powered system to run Zoneminder. Please consider the remaining tips in this answer to be 'generally deprecated, use only if you must'.
ru: Мы больше не рекомендуем использовать опцию "OPT_FAST_DELETE" или "RUN_AUDIT", за исключением случаев, когда вы используете старую или маломощную систему для работы с Zoneminder. Пожалуйста, рассмотрите оставшиеся советы в этом ответе как "обычно устаревшие, используйте только если необходимо".

source: There are two methods for ZM to remove files when they are deleted that can be found in Options under the System tab ZM_OPT_FAST_DELETE and ZM_RUN_AUDIT.
ru: Существует два метода для ZM по удалению файлов при их удалении, которые можно найти в разделе "Настройки" в разделе "Система" ZM_OPT_FAST_DELETE и ZM_RUN_AUDIT.

source: Normally an event created as the result of an alarm consists of entries in one or more database tables plus the various files associated with it. When deleting events in the browser it can take a long time to remove all of this if you are trying to do a lot of events at once. If you are running on an older or under-powered system, you may want to set this option which means that the browser client only deletes the key entries in the events table, which means the events will no longer appear in the listing, and leaves the zmaudit daemon to clear up the rest later. If you do so, disk space will not be freed immediately so you will need to run zmaudit more frequently. On modern systems, we recommend that you leave this **off**.
ru: Обычно событие, создаваемое в результате срабатывания сигнала, состоит из записей в одной или нескольких таблицах базы данных, а также различных файлов, связанных с ним. При удалении событий в браузере может потребоваться много времени, чтобы удалить все это, если вы пытаетесь удалить много событий одновременно. Если вы работаете на старой или недостаточно мощной системе, вам может понадобиться эта опция, которая означает, что клиент браузера удаляет только ключевые записи в таблице событий, что означает, что события больше не будут отображаться в списке, и оставляет zmaudit daemon для очистки остального позже. Если вы так сделаете, дисковое пространство не будет освобождено немедленно, поэтому вам придется чаще запускать zmaudit. На современных системах мы рекомендуем оставить эту **выключенной**.

source: The zmaudit daemon exists to check that the saved information in the database and on the file system match and are consistent with each other. If an error occurs or if you are using 'fast deletes' it may be that database records are deleted but files remain. In this case, and similar, zmaudit will remove redundant information to synchronize the two data stores. This option controls whether zmaudit is run in the background and performs these checks and fixes continuously. This is not recommended for most systems, as zmaudit.pl is very resource intensive.
ru: Демон zmaudit существует для проверки того, что информация, сохраненная в базе данных и на файловой системе, совпадает и согласуется друг с другом. Если возникает ошибка или если вы используете «быстрые удаления», возможно, что записи в базе данных будут удалены, но файлы останутся. В этом случае, и аналогичном, zmaudit удалит избыточную информацию, чтобы синхронизировать два хранилища данных. Этот параметр контролирует, запускается ли zmaudit в фоновом режиме и выполняет эти проверки и исправления непрерывно. Это не рекомендуется для большинства систем, поскольку zmaudit.pl очень ресурсоемкий.

source: The zmaudit daemon exists to check that the saved information in the database and on the files system match and are consistent with each other. If an error occurs or if you are using 'fast deletes' it may be that database records are deleted but files remain. In this case, and similar, zmaudit will remove redundant information to synchronize the two data stores. The default check interval of 900 seconds (15 minutes) is fine for most systems however if you have a very large number of events the process of scanning the database and file system may take a long time and impact performance. In this case you may prefer to make this interval much larger to reduce the impact on your system. This option determines how often these checks are performed.
ru: Демон zmaudit существует для проверки того, что информация, сохраненная в базе данных и на файловой системе, совпадает и согласуется друг с другом. Если возникает ошибка или если вы используете 'быстрые удаления', возможно, что записи в базе данных будут удалены, но файлы останутся. В этом случае, и аналогично, zmaudit удалит избыточную информацию, чтобы синхронизировать два хранилища данных. По умолчанию интервал проверки составляет 900 секунд (15 минут), что хорошо для большинства систем, однако, если у вас очень большое количество событий, процесс сканирования базы данных и файловой системы может занять много времени и повлиять на производительность. В этом случае вы можете предпочесть установить этот интервал намного больше, чтобы снизить нагрузку на вашу систему. Этот параметр определяет, как часто будут выполняться эти проверки.

source: Math for Memory: Making sure you have enough memory to handle your cameras
ru: Математика для памяти: Убедитесь, что у вас достаточно памяти для работы с вашими камерами

source: One of the most common issues for erratic ZoneMinder behavior is you don't have enough memory to handle all your cameras. Many users often configure multiple HD cameras at full resolution and 15FPS or more and then face various issues about processes failing, blank screens and other completely erratic behavior. The core reason for all of this is you either don't have enough memory or horsepower to handle all your cameras. The solution often is to reduce FPS, reduce cameras or bump up your server capabilities.
ru: Одна из наиболее распространенных проблем для нестабильного поведения ZoneMinder заключается в том, что у вас недостаточно памяти для обработки всех ваших камер. Многие пользователи часто конфигурируют несколько HD-камер в полном разрешении и более 15 кадров в секунду или более и затем сталкиваются с различными проблемами, связанными с неудачами процессов, черными экранами и другим совершенно непредсказуемым поведением. Основная причина всех этих проблем заключается в том, что у вас либо недостаточно памяти, либо мощности для обработки всех ваших камер. Решение часто заключается в снижении частоты кадров, уменьшении количества камер или увеличении возможностей сервера.

source: Here are some guidelines with examples on how you can figure out how much memory you need. With respect to CPU, you should benchmark your server using standard unix tools like top, iotop and others to make sure your CPU load is manageable. ZoneMinder also shows average load on the top right corner of the Web Console for easy access.
ru: Вот некоторые рекомендации с примерами о том, как определить, сколько памяти вам нужно. Что касается ЦП, вы должны протестировать свой сервер с помощью стандартных UNIX-инструментов, таких как top, iotop и другие, чтобы убедиться, что нагрузка на ЦП управляема. ЗонаМонитор также показывает среднюю нагрузку в правом верхнем углу веб-консоли для удобного доступа.

source: In *general* a good estimate of memory required would be:
ru: В общем, хорошая оценка требуемой памяти будет:

source: Where:
ru: Где:

source: image-width and image-height are the width and height of images that your camera is configured for (in my case, 1280x960). This value is in the Source tab for each monitor
ru: Ширина и высота изображения - это ширина и высота изображений, которые ваша камера настроена на (в моем случае, 1280x960). Это значение находится в разделе "Источник" для каждого монитора

source: image buffer size is the # of images ZM will keep in memory (this is used by ZM to make sure it has pre and post images before detecting an alarm - very useful because by the time an alarm is detected, the reason for the alarm may move out of view and a buffer is really useful for this, including for analyzing stats/scores). This value is in the buffers tab for each monitor
ru: Размер буфера изображения - это количество изображений, которые ZM будет хранить в памяти (это используется ZM для обеспечения наличия предварительных и послесменных изображений перед обнаружением тревоги - очень полезно, потому что к тому времени, когда тревога обнаружена, причина тревоги может выйти из поля зрения, и буфер действительно полезен для этого, включая анализ статистики/очков). Это значение находится в разделе буферов для каждого монитора

source: target color space is the color depth - 8bit, 24bit or 32bit. It's again in the source tab of each monitor
ru: Цветовое пространство цели - это глубина цвета - 8 бит, 24 бита или 32 бита. Это снова в разделе источника каждого монитора

source: The 20% overhead on top of the calculation to account for image/stream overheads (this is an estimate)
ru: 20% надбавка сверху от расчета для учета затрат на изображение/поток (это оценка)

source: The math breakdown for 4 cameras running at 1280x960 capture, 50 frame buffer, 24 bit color space:
ru: Расчет математики для 4 камер, работающих при разрешении 1280x960, буфер на 50 кадров, цветовое пространство 24 бита:

source: Around 700MB of memory.
ru: Около 700 МБ памяти.

source: So if you have 2GB of memory, you should be all set. Right? **Not, really**:
ru: Итак, если у вас 2 ГБ оперативной памяти, вы должны быть готовы. Верно? **Нет, действительно**:

source: This is just the base memory required to capture the streams. Remember ZM is always capturing streams irrespective of whether you are actually recording or not - to make sure its image ring buffer is there with pre images when an alarm kicks in.
ru: Это просто базовая память, необходимая для захвата потоков. Помните, что ZM всегда захватывает потоки, независимо от того, записываете ли вы их на самом деле - чтобы убедиться, что его буфер изображения с предварительным изображением есть, когда срабатывает сигнал тревоги.

source: You also need to account for other processes not related to ZM running in your box
ru: Вам также следует учитывать другие процессы, не связанные с ZM, работающие в вашем ящике

source: You also need to account for other ZM processes - for example, I noticed the audit daemon takes up a good amount of memory when it runs, DB updates also take up memory
ru: Вам также следует учитывать другие процессы ZM - например, я заметил, что демон аудита занимает много памяти при выполнении, обновления базы данных также занимают память

source: If you are using H264 encoding, that buffers a lot of frames in memory as well.
ru: Если вы используете кодирование H264, это также хранит много кадров в памяти.

source: So a good rule of thumb is to make sure you have twice the memory as the calculation above (and if you are using the ZM server for other purposes, please factor in those memory requirements as well)
ru: Поэтому хорошим правилом большого пальца является убедиться, что у вас в два раза больше памяти, чем расчет выше (и если вы используете сервер ZM для других целей, пожалуйста, учтите эти требования к памяти).

source: **Also remember by default ZM only uses 50% of your available memory unless you change it**
ru: **Также помните, что по умолчанию ZM использует только 50% вашей доступной памяти, если вы не измените это**

source: As it turns out, ZM uses mapped memory and by default, 50% of your physical memory is what this will grow to. When you reach that limit , ZM breaks down with various errors.
ru: Как оказалось, ZM использует виртуальную память, и по умолчанию 50% вашей физической памяти будет использоваться для этого. Когда вы достигнете этого предела, ZM выйдет из строя с различными ошибками.

source: A good way to know how much memory is allocated to ZM for its operation is to do a ``df -h``
ru: Хороший способ узнать, сколько памяти выделено ZM для его работы, - выполнить команду``df -h``

source: A sample output on Ubuntu:
ru: Пример вывода на Ubuntu:

source: The key item here is tmpfs --> the example above shows we have allocated 1.7G of mapped memory space of which 36% is used which is a healthy number. If you are seeing ``Use%`` going beyond 70% you should probably increase the mapped memory.
ru: Ключевой момент здесь - tmpfs - пример выше показывает, что мы выделили 1,7 ГБ пространства для отображения памяти, из которых 36% используется, что является здоровым числом. Если вы видите ``Use%``, превышающее 70%, вам, вероятно, следует увеличить пространство для отображения памяти.

source: For example, if you want to increase this limit to 70% of your memory, add the following to ``/etc/fstab`` ``tmpfs SHMPATH tmpfs defaults,noexec,nosuid,size=70% 0 0`` where SHMPATH is the ``Mounted on`` path. Here, that would be ``/run/shm``. Other systems may be ``/dev/shm``.
ru: Например, если вы хотите увеличить этот лимит до 70% вашей памяти, добавьте следующее в ``/etc/fstab`` ``tmpfs SHMPATH tmpfs defaults,noexec,nosuid,size=70% 0 0`` , где SHMPATH - это путь, на который монтируется. Здесь это будет ``/run/shm``. На других системах это может быть ``/dev/shm``.

source: I have enabled motion detection but it is not always being triggered when things happen in the camera view
ru: Я включил обнаружение движения, но оно не всегда срабатывает, когда что-то происходит в поле зрения камеры

source: ZoneMinder uses zones to examine images for motion detection. When you create the initial zones you can choose from a number of preset values for sensitivity etc. Whilst these are usually a good starting point they are not always suitable for all situations and you will probably need to tweak the values for your specific circumstances. The meanings of the various settings are described in the documentation (`here <https://zoneminder.readthedocs.io/en/latest/userguide/definezone.html>`__). Another user contributed illustrated Zone definition guide can be found here: `An illustrated guide to Zones <https://wiki.zoneminder.com/index.php/Understanding_ZoneMinder%27s_Zoning_system_for_Dummies>`__
ru: ZoneMinder использует зоны для обнаружения движения в изображениях. Когда вы создаете первоначальные зоны, вы можете выбрать из ряда предварительно определенных значений для чувствительности и т. д. Хотя эти значения обычно являются хорошей отправной точкой, они не всегда подходят для всех ситуаций, и вам, вероятно, придется подстроить значения для ваших конкретных обстоятельств. Значения различных настроек описаны в документации (`здесь <https://zoneminder.readthedocs.io/en/latest/userguide/definezone.html>`__). Другой пользователь внес иллюстрацию руководства по определению зон: `Иллюстрированное руководство по зонам <https://wiki.zoneminder.com/index.php/Understanding_ZoneMinder%27s_Zoning_system_for_Dummies>`__

source: However if you believe you have sensible settings configured then there are diagnostic approaches you can use.
ru: Однако если вы считаете, что у вас установлены разумные настройки, то вы можете использовать диагностические подходы.

source: Event Statistics
ru: Статистика событий

source: The first technique is to use event statistics. Firstly you should ensure they are switched on in ``Options->Logging->RECORD_EVENT_STATS``. This will then cause the raw motion detection statistics for any subsequently generated events to be written to the DB. These can then be accessed by first clicking on the Frames or Alarm Frames values of the event from any event list view in the web gui. Then click on the score value to see the actual values that caused the event. Alternatively the stats can be accessed by clicking on the 'Stats' link when viewing any individual frame. The values displayed there correspond with the values that are used in the zone configuration and give you an idea of what 'real world' values are being generated.
ru: Первый метод - использование статистики событий. Сначала убедитесь, что они включены в ``Настройки->Логирование->RECORD_EVENT_STATS``. Это вызовет запись статистики обнаружения движения для всех последующих событий в базу данных. Эти данные затем можно получить, сначала щелкнув по значениям кадров или тревожных кадров события из любого списка событий веб-интерфейса. Затем щелкните по значению оценки, чтобы увидеть фактические значения, которые вызвали событие. Альтернативно, статистику можно получить, щелкнув по ссылке "Статистика" при просмотре любого отдельного кадра. Значения, отображаемые там, соответствуют значениям, используемым в конфигурации зоны, и дают вам представление о том, какие значения генерируются в "реальном мире".
