Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/cameracontrol.po
Languages: ru

source: The second key element to controlling cameras with ZoneMinder is ensuring that an appropriate control script or application is present. A small number of sample scripts are included with ZoneMinder and can be used directly or as the basis for development. Control scripts are run atomically, that is to say that one requested action from the web interface results in one execution of the script and no state information is maintained. If your protocol requires state information to be preserved then you should ensure that your scripts do this as ZoneMinder has no concept of the state of the camera in control terms.
ru: Второй ключевой элемент управления камерами с помощью ZoneMinder - это обеспечение наличия соответствующего скрипта управления или приложения. В комплект ZoneMinder входят несколько примеров скриптов, которые можно использовать непосредственно или в качестве основы для разработки. Скрипты выполняются атомарно, то есть одна запрашиваемая операция с веб-интерфейса приводит к одному выполнению скрипта и не сохраняется состояние. Если ваш протокол требует сохранения состояния, то убедитесь, что ваши скрипты делают это, поскольку ZoneMinder не имеет понятия о состоянии камеры в терминах управления.

source: If you are writing a new control script then you need to ensure that it supports the parameters that ZoneMinder will pass to it. If you already have scripts or applications that control your cameras, the ZoneMinder control script will just act as glue to convert the parameters passed into a form that your existing application understands. If you are writing a script to support a new protocol then you will need to convert the parameters passed into the script to equivalent protocol commands. If you have carefully defined your control capabilities above then you should only expect commands that correspond to those capabilities.
ru: Если вы пишете новый скрипт управления, убедитесь, что он поддерживает параметры, которые ZoneMinder передаст ему. Если у вас уже есть скрипты или приложения, управляющие вашими камерами, скрипт управления ZoneMinder будет просто клеем для преобразования параметров, переданных в форму, которую понимает ваше существующее приложение. Если вы пишете скрипт для поддержки нового протокола, вам потребуется преобразовать параметры, переданные в скрипт, в эквивалентные команды протокола. Если вы тщательно определили свои возможности управления выше, вы должны ожидать только команды, соответствующие этим возможностям.

source: The standard set of parameters passed to control scripts is defined below,
ru: Ниже определены стандартные параметры, передаваемые в управляющие скрипты.

source: --device=<device> : This is the control device from the monitor definition. Absent if no device is specified.
ru: --device=<device> : Это устройство управления из определения монитора. Отсутствует, если не указано устройство.

source: address=<address> : This is the control address from the monitor definition. This will usually be a hostname or ip address for network cameras or a simple numeric camera id for other cameras.
ru: адрес=<адрес> : Это контрольный адрес из определения монитора. Обычно это имя хоста или IP-адрес для сетевых камер или простой номер камеры для других камер.

source: --autostop=<timeout> : This indicates whether an automatic timeout should be applied to '''stop''' the given command. It will only be included for '''continuous''' commands, as listed below, and will be a timeout in decimal seconds, probably fractional.
ru: --autostop=<timeout> : Это указывает, должна ли быть применена автоматическая задержка для '''остановки''' данной команды. Она будет включена только для '''непрерывных''' команд, как указано ниже, и будет представлять собой задержку в десятичных секундах, вероятно, дробную.

source: command=<command> : This specifies the command that the script should execute. Valid commands are given below.
ru: команда=<команда> : Это указывает команду, которую скрипт должен выполнить. Допустимые команды приведены ниже.

source: --xcoord=<x>, --ycoord=<y> : This specifies the x and/or y coordinates for commands which require them. These will normally be absolute or mapped commands.
ru: --xcoord=<x>, --ycoord=<y> : Это специфицирует координаты X и/или Y для команд, которые их требуют. Они обычно будут абсолютными или привязанными к карте командами.

source: width=<width>'', ''--height=<height> : This specifies the width and height of the current image, for mapped motion commands where the coordinates values passed must have a context.
ru: width=<width>'', ''--height=<height> : Это специфицирует ширину и высоту текущего изображения, для команд перемещения, где значения координат, передаваемые в контексте, должны иметь контекст.

source: --speed=<speed> : This specifies the speed that the command should use, if appropriate.
ru: --speed=<speed> : Это указывает скорость, которую команда должна использовать, если это уместно.

source: panspeed=<speed>'', ''--tiltspeed=<speed> : This indicates the specific pan and tilt speeds for diagonal movements which may allow a different motion rate for horizontal and vertical components.
ru: panspeed=<speed>'', ''--tiltspeed=<speed> : Это указывает на конкретные скорости панорамирования и наклона для диагональных движений, которые могут позволить разную скорость движения для горизонтальных и вертикальных компонентов.

source: --step=<step> : This specifies the amount of motion that the command should use, if appropriate. Normally used for relative commands only.
ru: --step=<step> : Это указывает количество движения, которое команда должна использовать, если это уместно. Обычно используется только для относительных команд.

source: panstep=<step>'', ''--tiltstep=<step> : This indicates the specific pan and tilt steps for diagonal movements which may allow a different amount of motion for horizontal and vertical components.
ru: panstep=<step>', ''--tiltstep=<step> : Это указывает на конкретные шаги панорамирования и наклона для диагональных движений, которые могут позволить разное количество движения для горизонтальных и вертикальных компонентов.

source: --preset=<preset> : This specifies the particular preset that relevant commands should operate on.
ru: --preset=<preset> : Это указывает на конкретный пресет, который соответствующие команды должны использовать.

source: The *command* option listed above may take one of the following commands as a parameter.
ru: *Вариант команды*, указанный выше, может принимать один из следующих параметров в качестве параметра.

source: wake
ru: проснись

source: Wake the camera.
ru: Разбуди камеру.

source: sleep
ru: !спать

source: Send the camera to sleep.
ru: Отправь камеру в спящий режим.

source: reset
ru: сброс

source: Reset the camera.
ru: Сброс камеры.

source: move_map
ru: переместить_карту

source: Move mapped to a specified location on the image.
ru: Перемещение отображается в указанной точке изображения.

source: move_pseudo_map
ru: переместить_псевдо_карту

source: As move_map above. Pseudo-mapped motion can be used when mapped motion is not supported but relative motion is in which case mapped motion can be roughly approximated by careful calibration.
ru: Как перемещение по карте выше. Псевдо-замоченное движение может быть использовано, когда поддерживается только относительное движение, в этом случае псевдо-замоченное движение можно грубо аппроксимировать путем тщательной калибровки.

source: Move to a specified absolute location. The direction element gives a hint to the direction to go but can be omitted. If present it will be one of "up", "down", "left", "right", "upleft", "upright", "downleft" or "downright".
ru: Перейти в указанную абсолютную позицию. Элемент направления дает намек на направление, в котором следует двигаться, но может быть опущен. Если он присутствует, он будет одним из "вверх", "вниз", "влево", "вправо", "вверху", "вверх", "внизу" или "внизу".

source: Move a specified amount in the given direction.
ru: Переместить указанное количество в заданном направлении.

source: move_con_<direction>
ru: move_con_<направление>

source: Move continuously in the given direction until told to stop.
ru: Двигаться непрерывно в указанном направлении до тех пор, пока не будет дана команда остановиться.

source: Stop any motion which may be in progress.
ru: Остановить любое движение, которое может быть в процессе.

source: Zoom to a specified absolute zoom position. The direction element gives a hint to the direction to go but can be omitted. If present it will be one of "tele" or "wide".
ru: Увеличить до указанного абсолютного уровня масштабирования. Элемент направления дает намек на направление, в котором следует двигаться, но его можно опустить. Если он присутствует, он будет одним из "теле" или "широкий".

source: Zoom a specified amount in the given direction.
ru: Увеличьте указанное количество в заданном направлении.

source: Zoom continuously in the given direction until told to stop.
ru: Увеличивать масштаб постоянно в указанном направлении до тех пор, пока не будет дана команда остановиться.

source: Stop any zooming which may be in progress.
ru: Прекратить любое масштабирование, которое может быть в процессе.

source: focus_auto
ru: фокус_авто

source: Set focusing to be automatic.
ru: Установить фокусировку автоматически.

source: focus_man
ru: фокус-мужчина

source: Set focusing to be manual.
ru: Установить фокусировку в ручной режим.

source: Focus to a specified absolute focus position. The direction element gives a hint to the direction to go but can be omitted. If present it will be one of "near" or "far".
ru: Сосредоточиться на указанной абсолютной позиции фокусировки. Элемент направления дает намек на направление, в котором следует двигаться, но может быть опущен. Если он присутствует, он будет одним из "близко" или "далеко".

source: Focus a specified amount in the given direction.
ru: Сосредоточьтесь на определенной сумме в указанном направлении.

source: Focus continuously in the given direction until told to stop.
ru: Фокусируйтесь непрерывно в данном направлении до тех пор, пока не будет дано указание остановиться.

source: focus_stop
ru: !остановка фокуса

source: Stop any focusing which may be in progress.
ru: Прекратить любое фокусирование, которое может быть в процессе.

source: As per the focus commands, except that direction may be "in" or "out".
ru: Согласно командам фокуса, за исключением того, что направление может быть "в" или "наружу".

source: As per the focus commands, except that direction may be "open" or "close".
ru: Согласно командам фокуса, за исключением того, что направление может быть "открытым" или "закрытым".

source: Set the given preset to the current location.
ru: Установите заданный пресет на текущее местоположение.

source: Move to the given preset.
ru: Перейти к заданному пресету.

source: Move to the "home" preset.
ru: Перейти к предустановке "домой".
