Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/cameracontrol.po
Languages: ru

source: Camera Control
ru: Управление камерой

source: ZoneMinder provides the facility to control cameras from the web interface and to some extent automatically. Pan/Tilt/Zoom (PTZ) cameras have a wide range of capabilities and use a large number of different protocols making any kind of generic control solution potentially very difficult. To address this ZoneMinder uses two key approaches to get around this problem.
ru: ZoneMinder предоставляет возможность управлять камерами через веб-интерфейс и в некоторой степени автоматически. Камеры с панорамированием, наклоном и зумом (PTZ) имеют широкий спектр возможностей и используют большое количество различных протоколов, что делает любое универсальное решение для управления потенциально очень сложным. Чтобы решить эту проблему, ZoneMinder использует два ключевых подхода.

source: Definition of Capabilities
ru: Определение возможностей

source: For each camera model you use, an entry in the camera capabilities table must be created. These indicate what functions the camera supports and ensure that the interface presents only those capabilities that the camera supports. There are a very large number of capabilities that may be supported and it is very important that the entries in this table reflect the actual abilities of the camera. A small number of example capabilities are included in ZoneMinder, these can be used ‘as is’ or modified.
ru: Для каждой модели камеры, которую вы используете, должна быть создана запись в таблице возможностей камеры. Они указывают, какие функции поддерживает камера, и обеспечивают, чтобы интерфейс отображал только те возможности, которые поддерживает камера. Существует очень большое количество возможностей, которые могут быть поддержаны, и очень важно, чтобы записи в этой таблице отражали фактические возможности камеры. В ZoneMinder включено небольшое количество примеров возможностей, которые можно использовать «как есть» или модифицировать.

source: Control Scripts
ru: Управляющие скрипты

source: ZoneMinder itself does not generally provide the ability to send commands to cameras or receive responses. What it does is mediate motion requests from the web interface into a standard set of commands which are passed to a script defined in the control capability. Example scripts are provided in ZoneMinder which support a number of serial or network protocols but it is likely that for many cameras new scripts will have to be created. These can be modelled on the example ones, or if control commands already exist from other applications, then the script can just act as a ‘glue’ layer between ZoneMinder and those commands.
ru: ZoneMinder сам по себе обычно не предоставляет возможности отправлять команды камерам или получать ответы. То, что он делает, это посредничает запросы на движение от веб-интерфейса в стандартный набор команд, которые передаются в скрипт, определенный в возможности управления. Примеры скриптов предоставляются в ZoneMinder, которые поддерживают несколько протоколов последовательного или сетевого обмена данными, но для многих камер, вероятно, придется создавать новые скрипты. Эти скрипты можно моделировать на основе примеров, или если уже существуют команды управления из других приложений, то скрипт может просто действовать как слой связующего кода между ZoneMinder и этими командами.

source: It should be emphasised that the control and capability elements of ZoneMinder are not intended to be able to support every camera out of the box. Some degree of development is likely to be required for many cameras.
ru: Необходимо подчеркнуть, что элементы управления и функциональности ZoneMinder не предназначены для поддержки каждой камеры из коробки. Для многих камер, вероятно, потребуется некоторая разработка.

source: Controlling Monitors
ru: Управление мониторами

source: If you have defined your system as having controllable monitors and you are looking at a monitor that is configured for control, then clicking on the ‘Control’ link along the top of the window will change the short event listing area to a control area. The capabilities you have defined earlier determine exactly what is displayed in this window. Generally you will have a Pan/Tilt control area along with one or subsidiary areas such as zoom or focus control to the side. If you have preset support then these will be near the bottom of the window. The normal method of controlling the monitor is by clicking on the appropriate graphics which then send a command via the control script to the camera itself. This may sometimes take a noticeable delay before the camera responds.
ru: Если вы определили свою систему как имеющую контролируемые мониторы и смотрите на монитор, который настроен на контроль, то щелчок по ссылке «Контроль» в верхней части окна изменит область короткого списка событий на область контроля. Способности, которые вы определили ранее, определяют, что именно отображается в этом окне. Обычно вы будете иметь область управления панорамированием / наклоном, а также одну или несколько дополнительных областей управления, таких как зум или фокусировка, сбоку. Если у вас есть поддержка предустановок, они будут находиться в нижней части окна. Нормальным способом управления монитором является щелчок на соответствующих графических элементах, которые затем отправляют команду через скрипт управления камере. Это может иногда занимать заметную задержку, прежде чем камера ответит.

source: It is usually the case that the control arrows are sensitive to where you click on them. If you have a camera that allows different speeds to be used for panning or zooming etc then clicking near the point of the arrow will invoke the faster speed whilst clicking near the base of the arrow will be slower. If you have defined continuous motion then ongoing activities can be stopped by clicking on the area between the arrows, which will either be a graphic in the case of pan/tilt controls or a word in the case of zoom and focus controls etc.
ru: Обычно бывает так, что управляющие стрелки чувствительны к тому, где вы на них кликаете. Если у вас есть камера, которая позволяет использовать разные скорости для панорамирования или увеличения и т. д., то щелчок рядом с кончиком стрелки вызовет более быструю скорость, а щелчок рядом с основанием стрелки будет медленнее. Если вы определили непрерывное движение, то текущие действия можно остановить, щелкнув в области между стрелками, которая будет либо графическим элементом в случае управления панорамированием / наклоном, либо словом в случае управления увеличением и фокусировкой и т. д.

source: Certain control capabilities such as mapped motion allow direct control by clicking on the image itself when used in browsers which support streamed images directly. Used in this way you can just click on the area of the image that interests you and the camera will centre on that spot. You can also use direct image control for relative motion when the area of the image you click on defines the direction and the distance away from the centre of the image determines the speed. As it is not always very easy to estimate direction near the centre of the image, the active area does not start until a short distance away from the centre, resulting in a ‘dead’ zone in the middle of the image.
ru: Некоторые контрольные возможности, такие как привязка движения, позволяют напрямую управлять щелчком мыши непосредственно по изображению при использовании в браузерах, которые поддерживают потоковые изображения напрямую. Используя его таким образом, вы можете просто щелкнуть мышью в области изображения, которая вас интересует, и камера сфокусируется на этом месте. Вы также можете использовать прямой контроль изображения для относительного движения, когда область изображения, по которой вы щелкаете, определяет направление, а расстояние от центра изображения определяет скорость. Поскольку определить направление вблизи центра изображения не всегда легко, активная область начинается только на небольшом расстоянии от центра, что приводит к "мертвой" зоне в середине изображения.

source: Control Flow
ru: Управление потоком

source: Having a basic understanding of how camera control works in ZoneMinder will go a long way in debugging issues in the future. It is important to note that many of the 'camera control' scripts are user contributed and it is entirely possible that they break in a future version upgrade.
ru: Обладая базовыми знаниями о том, как работает управление камерой в ZoneMinder, вы сможете значительно облегчить решение проблем в будущем. Важно отметить, что многие из "сценариев управления камерой" являются пользовательскими и вполне возможно, что они перестанут работать в будущей версии обновления.

source: ZoneMinder relies on 'control protocols' for specific camera models. These 'control' protocols are nothing but perl packages located in ``/usr/share/perl5/ZoneMinder/Control/`` (in Ubuntu distributions) that are invoked by ZoneMinder when you invoke a PTZ operation
ru: ZoneMinder полагается на "контрольные протоколы" для конкретных моделей камер. Эти "контрольные" протоколы являются ничем иным, как пакетами на языке Perl, расположенными в "/usr/share/perl5/ZoneMinder/Control/" (в дистрибутивах Ubuntu), которые вызываются ZoneMinderом при выполнении операции PTZ.

source: When you associate a 'protocol' for PTZ for a camera, you are effectively letting ZoneMinder know where to locate the perl file that will eventually control the camera movement
ru: Когда вы ассоциируете "протокол" для PTZ для камеры, вы фактически сообщаете ZoneMinder, где находится perl-файл, который в конечном итоге будет контролировать движение камеры

source: Let's for example, assume that you are configuring a Foscam 9831W camera and have associated the '9831w' protocol to that camara. This basically means when you move the camera via ZoneMinder, it will pass on the movements to FI9831w.pm in ``/usr/share/perl5/ZoneMinder/Control/``
ru: Предположим, вы настраиваете камеру Foscam 9831W и ассоциировали протокол '9831w' с этой камерой. Это означает, что когда вы перемещаете камеру через ZoneMinder, она передает эти движения модулю FI9831w.pm в "/usr/share/perl5/ZoneMinder/Control/".

source: ZoneMinder also maintains protocol configuration parameters in a table called ``Controls`` in the DB. This table is used to store parameters like whether the camera supports continuous move, zoom etc.
ru: ZoneMinder также поддерживает параметры конфигурации протокола в таблице под названием "Управление" в базе данных. Эта таблица используется для хранения параметров, таких как поддерживает ли камера непрерывное движение, зум и т.д.

source: The ``Controls`` table is used by ZoneMinder to build its PTZ web interface. For example, an FI9831W camera does not support Zoom --> so when you open the PTZ interface of ZoneMinder via the Web Console and navigate to the FI9831W camera, the Zoom option will not be shown. It knows not to show this because the ``Control`` table entry for FI9831W specifies it does not support Zoom. Note that you edit these parameters via Source->Control->Control Type->Edit in the web console
ru: Таблица "Controls" используется ZoneMinder для создания своего веб-интерфейса PTZ. Например, камера FI9831W не поддерживает Зум - поэтому, когда вы открываете веб-интерфейс PTZ ZoneMinder через Веб-консоль и переходите к камере FI9831W, опция "Зум" не будет отображаться. Это потому, что запись в таблице "Controls" для FI9831W указывает, что она не поддерживает Зум. Обратите внимание, что эти параметры можно редактировать через Источник->Control->Тип управления->Редактировать в веб-консоли

source: If you ever look at any of the control protocol files, you will notice it has functions like ``moveRelUp`` or ``moveConLeft`` etc. -> these are the functions that eventually get invoked to move the camera around and it is expected that contributors who implement missing camera profiles fill in these functions with the appropriate camera specific commands. This way, the core ZoneMinder code does not need to worry about camera specific commands. All it needs to know is the features of a camera and accordinfly invoke abstract commands in the protocol perl file and it is the responsibility of the perl file for that camera to implement the specifics. So, if you are facing problems with PTZ not working, these protocol files are what you should be debugging.
ru: Если вы когда-нибудь посмотрите на любой из файлов протоколов управления, вы заметите, что в них есть функции, такие как ``moveRelUp`` или ``moveConLeft`` и т. д. -> это функции, которые в конечном итоге вызываются для перемещения камеры и ожидается, что разработчики, которые реализуют отсутствующие профили камер, заполняют эти функции соответствующими командами камеры. Таким образом, основной код ZoneMinder не должен беспокоиться о командах камеры. Все, что ему нужно знать, это функции камеры, и в соответствии с этим он вызывает абстрактные команды в файле протокола perl и ответственность за конкретные детали лежит на файле perl для этой камеры. Таким образом, если у вас возникают проблемы с PTZ, эти файлы протокола - это то, что вам следует отлаживать.

source: Control Capabilities
ru: Управляющие возможности

source: If you have a camera that supports PTZ controls and wish to use it with ZoneMinder then the first thing you need to do is ensure that it has an accurate entry in the capabilities table. To do this you need to go to the Control tab of the Monitor configuration dialog and select ‘Edit’ where it is listed by the Control Type selection box. This will bring up a new window which lists, with a brief summary, the existing capabilities. To edit an existing capability to modify select the Id or Name of the capability in question, or click on the Add button to add a new control capability. Either of these approaches will create a new window, in familiar style, with tabs along the top and forms fields below. In the case of the capabilities table there are a large number of settings and tabs, the mean and use of these are briefly explained below.
ru: Если у вас есть камера, поддерживающая управление PTZ, и вы хотите использовать ее с ZoneMinder, первое, что вам нужно сделать, это убедиться, что она имеет точную запись в таблице возможностей. Чтобы сделать это, вам нужно перейти на вкладку "Управление" диалогового окна настройки монитора и выбрать "Редактировать", где она указана в поле выбора типа управления. Это приведет к появлению нового окна, которое содержит, с кратким резюме, существующие возможности. Чтобы изменить существующую возможность для ее модификации, выберите Id или Название выбранной возможности, или нажмите кнопку "Добавить", чтобы добавить новую возможность контроля. Любой из этих подходов создаст новое окно, знакомого стиля, с вкладками в верхней части и полями для ввода ниже. В случае таблицы возможностей есть большое количество настроек и вкладок, назначение и использование которых объясняются ниже.

source: Main Tab
ru: Главная вкладка

source: Name
ru: Наименование

source: This is the name of the control capability, it will usually make sense to name capabilities after the camera model or protocol being used.
ru: Это имя возможности управления, обычно имеет смысл называть возможности по модели камеры или протоколу, используемому.

source: Type
ru: Тип

source: Whether the capability uses a local (usually serial) or network control protocol.
ru: Является ли способность использовать локальный (обычно последовательный) или сетевой протокол управления.

source: Command
ru: Команда

source: This is the full path to a script or application that will map the standard set of ZoneMinder control commands to equivalent control protocol command. This may be one of the shipped example zmcontrol-\*.pl scripts or something else entirely.
ru: Это полный путь к скрипту или приложению, которое будет переводить стандартный набор команд управления ZoneMinder на эквивалентные команды протокола управления. Это может быть один из поставляемых примерных скриптов zmcontrol-\*.pl или что-то совершенно другое.

source: Can Wake
ru: Могу Проснуться

source: This is the first of the actual capability definitions. Checking this box indicates that a protocol command exists to wake up the camera from a sleeping state.
ru: Это первая из реальных определений возможностей. Проверка этого флажка указывает на то, что существует протокольный команд для пробуждения камеры из спящего состояния.

source: Can Sleep
ru: Можно спать

source: The camera can be put to sleep.
ru: Камеру можно усыпить.

source: Can Reset
ru: Можно сбросить

source: The camera can be reset to a previously defined state.
ru: Камеру можно сбросить до ранее определенного состояния.

source: Move Tab
ru: Переместить Табуляцию

source: Can Move
ru: Можно двигаться

source: The camera is able move, i.e. pan or tilt.
ru: Камера способна двигаться, то есть панорамировать или наклоняться.

source: Can Move Diagonally
ru: Может двигаться по диагонали

source: The camera can move diagonally. Some devices can move only vertically or horizontally at a time.
ru: Камера может двигаться диагонально. Некоторые устройства могут двигаться только вертикально или горизонтально одновременно.

source: Can Move Mapped
ru: Можно переместить сгенерированное

source: The camera is able internally map a point on an image to a precise degree of motion to centre that point in the image.
ru: Камера способна внутренне сопоставить точку на изображении с определенной степенью движения, чтобы центрировать эту точку в изображении.

source: The camera can move to an absolute location.
ru: Камера может перемещаться в абсолютное местоположение.

source: Can Move Relative
ru: Можно Переместить Относительно

source: The camera can more to a relative location, e.g. 7 point left or up.
ru: Камера может перемещаться в относительное местоположение, например, на 7 точек влево или вверх.

source: Can Move Continuous
ru: Могу Перемещать Непрерывный

source: The camera can move continuously in a defined direction until told to stop or the movement limits are reached, e.g. left.
ru: Камера может непрерывно перемещаться в определенном направлении до тех пор, пока ей не прикажут остановиться или не будут достигнуты пределы движения, например, влево.

source: Pan Tab
ru: !пан таб

source: Can Pan
ru: Может Пан

source: The camera can pan, or move horizontally.
ru: Камера может панорамировать, или двигаться горизонтально.

source: Min/Max Pan Range
ru: Минимальный/максимальный диапазон панорамирования

source: If the camera supports absolute motion this is the minimum and maximum pan co-ordinates that may be specified, e.g. -100 to 100.
ru: Если камера поддерживает абсолютное движение, это являются минимальными и максимальными координатами панорамирования, которые могут быть указаны, например, от -100 до 100.

source: Min/Man Pan Step
ru: Минус/Макс Стен

source: If the camera supports relative motion, this is the minimum and maximum amount of movement that can be specified.
ru: Если камера поддерживает относительное движение, это минимальное и максимальное количество движения, которое можно указать.

source: Has Pan Speed
ru: Скорость Пана

source: The camera supports specification of pan speeds.
ru: Камера поддерживает спецификацию скоростей панорамирования.

source: Min/Max Pan Speed
ru: Минимальная/Максимальная Скорость Панорамирования

source: The minimum and maximum pan speed supported.
ru: Минимальная и максимальная скорость панорамирования, поддерживаемая.

source: Has Turbo Pan
ru: У Турбо Пан

source: The camera supports an additional turbo pan speed.
ru: Камера поддерживает дополнительную турбо скорость панорамирования.

source: Turbo Pan Speed
ru: Турбо Скорость Обжаривания

source: The actual turbo pan speed.
ru: Фактическая скорость турбопанели.

source: Tilt Tab
ru: Наклон Таб

source: Definition of Tilt capabilities, fields as for ‘Pan’ tab.
ru: Определение возможностей наклона, поля, как для вкладки "Панорама".

source: Zoom Tab
ru: Таблица Zoom

source: The camera can zoom.
ru: Камера может увеличивать.

source: Can Zoom Absolute
ru: Может Zoom Абсолютный

source: The camera can zoom to an absolute position.
ru: Камера может увеличивать до абсолютной позиции.

source: Can Zoom Relative
ru: Может Zoom Relative

source: The camera can zoom to a relative position.
ru: Камера может приближаться к относительному положению.

source: Can Zoom Continuous
ru: Может ли Zoom быть непрерывным?

source: The camera can zoom continuously in or out until told to stop or the zoom limits are reached.
ru: Камера может непрерывно приближать или удалять изображение до тех пор, пока ей не прикажут остановиться или не будут достигнуты пределы масштабирования.

source: Min/Max Zoom Range
ru: Минимальный/максимальный диапазон масштабирования

source: If the camera supports absolute zoom this is the minimum and maximum zoom amounts that may be specified.
ru: Если камера поддерживает абсолютное масштабирование, это минимальное и максимальное значения масштабирования, которые могут быть указаны.

source: Min/Man Zoom Step
ru: Минимальный/Максимальный шаг масштабирования

source: If the camera supports relative zoom, this is the minimum and maximum amount of zoom change that can be specified.
ru: Если камера поддерживает относительное масштабирование, это минимальное и максимальное значение изменения масштаба, которое можно указать.

source: Has Zoom Speed
ru: Ускорение Zoom

source: The camera supports specification of zoom speed.
ru: Камера поддерживает настройку скорости зума.

source: Min/Max Zoom Speed
ru: Минимальная/Максимальная Скорость Зуммирования

source: The minimum and maximum zoom speed supported.
ru: Минимальная и максимальная скорость зуммирования, поддерживаемая.

source: Focus Tab
ru: Вкладка Фокус

source: Definition of Focus capabilities, fields as for ‘Zoom’ tab, but with the following additional capability.
ru: Определение возможностей фокусировки, поля как для вкладки «Увеличение», но с дополнительной возможностью.

source: Can Auto Focus
ru: Можно Автофокус

source: The camera can focus automatically.
ru: Камера может автоматически фокусироваться.

source: White Tab
ru: Белая Таблетка

source: Definition of White Balance capabilities, fields as for ‘Focus’ tab.
ru: Определение возможностей баланса белого, поля для вкладки "Настройка фокуса".

source: Definition of Iris Control capabilities, fields as for ‘Focus’ tab.
ru: Определение возможностей управления Ирисом, поля для вкладки "Фокус".

source: The camera supports preset positions.
ru: Камера поддерживает предустановленные положения.

source: How many presets the camera supports. If the camera supports a huge number of presets then it makes sense to specify a more reasonable number here, 20 or less is recommended.
ru: Сколько предустановок поддерживает камера. Если камера поддерживает огромное количество предустановок, то имеет смысл указать здесь более разумное число, 20 или меньше рекомендуется.

source: The camera has a defined ‘home’ position, usually in the mid point of its range.
ru: Камера имеет определенную позицию «дома», обычно в середине своего диапазона.

source: The camera supports setting preset locations via its control protocol.
ru: Камера поддерживает настройку предустановленных местоположений через свой протокол управления.
