Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/components.po
Languages: ru

source: This module contains functions to load, execute etc filters.
ru: Этот модуль содержит функции для загрузки, выполнения и т.д. фильтров.

source: This module contains standard shared memory access functions. These can be used to access the current state of monitors etc as well as issuing commands to the monitors to switch things on and off. This module effectively provides a ZoneMinder API.
ru: Этот модуль содержит стандартные функции доступа к общей памяти. Эти функции можно использовать для доступа к текущему состоянию мониторов и т.д., а также для выдачи команд мониторам для включения и выключения. Этот модуль фактически предоставляет API ZoneMinder.

source: This module is a specialised module that contains the definition, and other information, about the various configuration options. It is not intended for use by 3rd parties.
ru: Этот модуль является специализированным модулем, который содержит определение и другую информацию о различных параметрах конфигурации. Он не предназначен для использования третьими сторонами.

source: These modules contain implementations of the various PTZ protocols.
ru: Эти модули содержат реализации различных протоколов PTZ.

source: These modules contain definitions of trigger channels and connections used by the zmtrigger.pl script. Although they can be used ‘as is’, they are really intended as examples that can be customised or specialised for different interfaces. Contributed modules for new channels or connections will be welcomed and included in future versions of ZoneMinder.
ru: Эти модули содержат определения триггерных каналов и соединений, используемых скриптом zmtrigger.pl. Хотя их можно использовать ‘как есть’, они на самом деле предназначены в качестве примеров, которые могут быть адаптированы или специализированы для разных интерфейсов. Предложенные модули для новых каналов или соединений будут приветствоваться и включены в будущие версии ZoneMinder.
