Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/configfiles.po
Languages: ru

source: Configuration Files
ru: Файлы конфигурации

source: This section describes configuration files that ZoneMinder uses beyond the various Web UI options.
ru: Этот раздел описывает конфигурационные файлы, которые ZoneMinder использует за пределами различных вариантов пользовательского интерфейса Web.

source: System Path Configurations
ru: Системные настройки путей

source: At one point of time, ZoneMinder stored various system path configurations under the Web UI (``Options->Paths``). This was removed a few versions ago and now resides in a configuration file. The motivation for this change can be read in `this discussion <https://github.com/ZoneMinder/zoneminder/pull/1908>`__.
ru: В определенный момент времени ZoneMinder хранил различные конфигурации системных путей под веб-интерфейсом (``Параметры->Пути``). Это было удалено несколько версий назад и теперь находится в конфигурационном файле. Мотивы этого изменения можно прочитать в этой дискуссии `https://github.com/ZoneMinder/zoneminder/pull/1908`.

source: Typically, path configurations now reside in ``/etc/zm``.
ru: Обычно конфигурации путей теперь находятся в ``/etc/zm``.

source: Here is an example of the file hierarchy:
ru: Вот пример иерархии файлов:

source: The roles of the files are as follows:
ru: Роли файлов следующие:

source: ``zm.conf`` contains various base configuration entries. You should not edit this file as it may be overwritten on an upgrade.
ru: Файл `zm.conf` содержит различные базовые конфигурационные записи. Не следует редактировать этот файл, так как он может быть перезаписан при обновлении.

source: ``zmeventnotification.ini`` is only present if you have installed the ZoneMinder Event Notification Server.
ru: ``zmeventnotification.ini`` присутствует только в том случае, если вы установили сервер уведомлений о событиях ZoneMinder.

source: ``objectconfig.ini`` is only present if you have installed the machine learning hooks for the Event Notification Server.
ru: ``objectconfig.ini`` присутствует только в том случае, если вы установили модуль машинного обучения для сервера уведомлений событий.

source: ``conf.d`` contains additional configuration items as follows:
ru: ``conf.d`` содержит дополнительные конфигурационные элементы следующим образом:

source: ``01-system-paths.conf`` contains all the paths that were once part of ``Options->Paths`` in the Web UI. You should not edit this file as it may be overwritten on an upgrade
ru: Файл ``01-system-paths.conf`` содержит все пути, которые когда-то были частью ``Options->Paths`` в веб-интерфейсе. Не следует редактировать этот файл, так как он может быть перезаписан при обновлении

source: ``02-multiserver.conf`` file consists of custom variables if you are deploying ZoneMinder in a multi-server configuration (see :doc:`/installationguide/multiserver`)
ru: Файл ``02-multiserver.conf`` состоит из пользовательских переменных, если вы развертываете ZoneMinder в многосерверной конфигурации (см. :doc:`/installationguide/multiserver`).

source: ``03-custom.conf`` is an custom config file that I created to override specific variables in the path files. **This is the recommended way to customize entries**. Anything that you want to change should be in a new file inside ``conf.d``. Note that ZoneMinder will sort all the files alphabetically and run their contents in ascending order. So it doesn't really matter what you name them, as long as you make sure your changes are not overwritten by another file in the sorting sequence. It is therefore good practice to prefix your file names by ``nn-`` where ``nn`` is a monotonically increasing numerical sequence ``01-`` ``02-`` ``03-`` and so forth, so you know the order they will be processed.
ru: "03-custom.conf" - это конфигурационный файл, который я создал для переопределения определенных переменных в файлах путей. **Это рекомендуемый способ настройки записей**. Все, что вы хотите изменить, должно быть в новом файле внутри "conf.d". Обратите внимание, что ZoneMinder сортирует все файлы алфавитно и выполняет их содержимое в порядке возрастания. Таким образом, не имеет значения, как вы их назовете, при условии, что вы убедитесь, что ваши изменения не будут перезаписаны другим файлом в процессе сортировки. Поэтому хорошей практикой является префиксация имен ваших файлов символами "nn-", где "nn" - это монотонно возрастающая последовательность чисел "01-" "02-" "03-" и так далее, чтобы вы знали порядок, в котором они будут обрабатываться.

source: Timezone Configuration
ru: Настройка часового пояса

source: Earlier versions of ZoneMinder relied on ``php.ini`` to set Date/Time Zone. This is no longer the case. You can (and must) set the Timezone via the Web UI, starting ZoneMinder version 1.34. See :ref:`here <timezone_config>`.
ru: Ранее версии ZoneMinder полагались на ``php.ini``, чтобы установить дату/время часового пояса. Это больше не так. Вы можете (и должны) установить время по веб-интерфейсу, начиная с версии ZoneMinder 1.34. См. :ref:`здесь <timezone_config>`

source: Database Specific Configuration
ru: Настройка базы данных

source: Todo
ru: Все

source: do we really need to have this section? Not sure if its generic and not specific to ZM
ru: Действительно ли нам действительно нужно иметь эту секцию? Не уверена, что она общая и не специфична для ZM

source: While the ZoneMinder specific database config entries reside in ``/etc/zm/zm.conf`` and related customizations discussed above, general database configuration items can be tweaked in ``/etc/mysql`` (or whichever path your DB server is installed)
ru: Хотя специфические для ZoneMinder записи конфигурации базы данных находятся в ``/etc/zm/zm.conf``, а обсуждаемые выше дополнительные настройки, общие настройки базы данных можно изменить в ``/etc/mysql`` (или в той папке, где установлена ваша серверная база данных).
