Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/definezone.po
Languages: ru

source: The images above serve to illustrate Alarm Check Methods. AlarmedPixels is performed first on the image on the left with a person entering the Zone region. Pixels in white exceeded the Minimum Pixel threshold. However, as one can see there are many pixels included that are not part of the person to be detected. This is due to the motion of the person across the Zone region relative to the reference frame. FilteredPixels Alarm check is performed next which has the effect of eliminating many of the residual pixels that are not of interest. Blob Alarm Check is the final process performed and combines contiguous regions of the FilteredPixels. The result of this final process can be seen as a green Blob outline of the person detected in the final image on the right.
ru: Изображения выше служат для иллюстрации методов проверки сигналов тревоги. Сначала выполняется проверка пикселей AlarmedPixels на изображении слева, где человек входит в зону. Белые пиксели превышают пороговое значение минимального пикселя. Однако, как можно видеть, есть много пикселей, которые не являются частью человека, который должен быть обнаружен. Это связано с движением человека по зоне относительно эталонного кадра. Затем выполняется проверка Alarm Check FilteredPixels, которая имеет эффект удаления многих оставшихся пикселей, которые не представляют интереса. Наконец, выполняется процесс проверки Blob Alarm, который объединяет непрерывные области FilteredPixels. Результат этого последнего процесса можно увидеть в виде зеленого контура Blob человека, обнаруженного в конечном изображении справа.

source: [G] Min/Max Pixel Threshold (0-255)
ru: [G] Минимальное/Максимальное пороговое значение пикселя (0-255)

source: Used by *AlarmedPixels* Alarm Check. In the AlarmedPixels layer of analysis each individual pixel of the image is compared to the current reference image. Pixels that are different from the reference image are considered alarmed pixels. However, small aberrations in lighting or auto exposure camera adjustments may cause the explicit value of a pixel to vary by small amounts from image to image. This parameter sets the limit for what will be considered a changed pixel. For example, if the camera points at a blank white wall and a black coloured item is raised into view, then the change in any one pixel will be extreme. If however, a white piece of white paper is raised then the change in an individual pixel will be much smaller.
ru: Используется *AlarmedPixels* Alarm Check. В слое анализа AlarmedPixels каждое отдельное пиксельное изображение изображения сравнивается с текущим изображением-образцом. Пиксели, отличающиеся от изображения-образца, считаются пикселями тревоги. Однако небольшие отклонения в освещении или автоматической экспозиции камеры могут вызвать небольшое изменение конкретного значения пикселя от изображения к изображению. Этот параметр устанавливает предел того, что будет считаться измененным пикселем. Например, если камера направлена на белую стену и в поле зрения поднимается черный предмет, то изменение любого одного пикселя будет экстремальным. Однако, если поднять белый лист бумаги, то изменение отдельного пикселя будет намного меньше.

source: The Minimum Pixel Threshold setting should be high enough to prevent minor lighting, imaging, or compression changes from triggering an alarm. A good starting point for the Minimum Pixel Threshold is 40, meaning that the difference in pixel value from must be greater than 40. A good default for the Maximum Pixel Threshold is 0 which indicates that all differences above the Minimum Threshold are considered a change.
ru: Настройка Минимального порога пикселей должна быть достаточно высокой, чтобы предотвратить незначительные изменения освещения, изображения или сжатия от срабатывания сигнала тревоги. Хорошим начальным значением для Минимального порога пикселей является 40, что означает, что разница в значении пикселя должна быть больше 40. Хорошим по умолчанию для Максимума порога пикселей является 0, что указывает на то, что все различия выше Минимального порога считаются изменениями.

source: [H] Filter Width/Height (Pixels)
ru: [H] Ширина/Высота фильтра (пиксели)

source: Used by *FilteredPixels* Alarm Check. This parameter is always specified in Pixels, even when Percent is the selected Unit. It specifies the size of the group of pixels surrounding a given pixel that must be alarmed pixels for the pixel itself to be considered a filtered pixel. The width and height should always be an odd number. The default value is 3 x 3, and 5 x 5 is also suggested as a sensible alternative. Avoid using large numbers for the width and height of the filter area. When using the Blobs Alarm Check Method, FilteredPixels can be effectively disabled by setting either the width or height to a value less than 1.
ru: Используется *Проверкой пикселей фильтра*. Этот параметр всегда указывается в пикселях, даже когда единицей измерения является процент. Он указывает размер группы пикселей, окружающих данный пиксель, которые должны быть пикселями тревоги, чтобы сам пиксель считался пикселем фильтра. Ширина и высота всегда должны быть нечетным числом. По умолчанию значение равно 3 x 3, также рекомендуется использовать 5 x 5 как разумную альтернативу. Избегайте использования больших чисел для ширины и высоты области фильтра. Когда используется метод проверки "Блобы", фильтр пикселей можно эффективно отключить, установив ширину или высоту меньше 1.

source: Zone Area is a display only parameter and is calculated from the `Zone Regions`_ which is described in the section below. When Units are set to Percent, the Zone Area displays the area of the Zone region relative to the entire monitor image. When Units are set to Pixels, the Zone Area displays the number of pixels contained in the Zone region. Note that the Zone Area and pixel count can also be found on the main `Zone View`_. All 3 Min/Max Area parameter groups are based on the Zone Area as the maximum value and all 3 are interpreted in the Units specified in the Units parameter.
ru: Зона Область является параметром только для отображения и рассчитывается на основе `Zone Regions`_, которые описаны в разделе ниже. Когда Установки установлены на Проценты, Зона Область отображает площадь зоны региона относительно всего изображения монитора. Когда Установки установлены на Пиксели, Зона Область отображает количество пикселей, содержащихся в зоне региона. Примечание: Зона Область и счетчик пикселей также можно найти на основном `Zone View`_. Все 3 группы параметров Минимальной/Максимальной Области основаны на значении Зоны Области как максимума и все 3 интерпретируются в единицах, указанных в параметре Установки.

source: [J] Min/Max Alarmed Area
ru: [J] Минимальная/Максимальная Зона Тревоги

source: Used by *AlarmedPixels* Alarm Check. The pixel count or area of alarmed pixels is used in this first layer of analysis to determine if an alarm is triggered. If the pixel count or area percentage is above the minimum Alarmed Area, but less than the maximum Alarmed Area, an alarm is triggered. These settings depend on the size of the object to be captured: a value too low may cause false alarms, while a value too high might not detect small objects. A good starting point for both the minimum and maximum are 0 and 0, indicating that any number of alarmed pixels (or any percentage) greater than 0 will trigger an alarm. The frame scores from logged events can then be used to bring the minimum up to a reasonable value. An alternative starting point for the minimum Alarmed Area (in percent) is 25% of the area that an object of interest takes up in the Zone region. For example, if a subject moving through the frame takes up approximately 30% of the Zone region, then a good starting minimum Alarmed Area is about 7.5%.
ru: Используется *AlarmedPixels* Alarm Check. Количество пикселей или площадь пикселей, вызывающих тревогу, используется в этой первой стадии анализа для определения, активирован ли сигнал тревоги. Если количество пикселей или процентная доля площади, вызывающей тревогу, превышает минимальную площадь, вызывающую тревогу, но меньше максимальной площади, вызывающей тревогу, срабатывает сигнал тревоги. Эти настройки зависят от размера объекта, который необходимо захватить: значение слишком низкое может вызвать ложные срабатывания, а значение слишком высокое может не обнаруживать мелкие объекты. Хорошим начальным значением как для минимального, так и для максимального значения являются 0 и 0, что означает, что любое количество пикселей, вызывающих тревогу (или любой процент), превышающее 0, вызовет срабатывание сигнала тревоги. Затем оценки, полученные из зарегистрированных событий, могут быть использованы для повышения минимального значения до разумного уровня. Альтернативным начальным значением для минимальной площади, вызывающей тревогу (в процентах), является 25% площади, которую интересующий объект занимает в зоне. Например, если субъект, движущийся через кадр, занимает примерно 30% зоны, то хорошим начальным минимальным значением площади, вызывающей тревогу, является около 7,5%.

source: [K] Min/Max Filtered Area
ru: [K] Минимальная/Максимальная Фильтрованная Область

source: Used by *FilteredPixels* Alarm Check. Applying the FilteredPixels analysis results in an area that is less than or equal to the Alarmed Area. Thus, the minimum and maximum Filtered Area parameters for alarm should be equal to or less than the corresponding Alarmed Area parameters, or the FilteredPixels analysis will never trigger an alarm. In particular, it is useful to raise the minimum Alarmed Area parameter until false events from image artifacts disappear, then setting a minimum Filtered Area parameter less the minimum Alarmed Area parameter by enough to capture small events of interest.
ru: Используется *FilteredPixels* Сигнализация проверки. Применение анализа результатов FilteredPixels приводит к области, которая меньше или равна области Alarmed. Таким образом, минимальные и максимальные параметры Filtered Area для сигнала должны быть равны или меньше соответствующих параметров Alarmed Area, или анализ FilteredPixels никогда не вызовет сигнал тревоги. В частности, полезно повышать минимальный параметр Alarmed Area до исчезновения ложных событий из-за артефактов изображения, затем устанавливая минимальный параметр Filtered Area меньше минимального параметра Alarmed Area на достаточное количество, чтобы захватить мелкие события, представляющие интерес.

source: [L] Min/Max Blob Area
ru: [L] Минимальная/Максимальная Область Блока

source: Used by *Blob* Alarm Check. The Blob Area parameters control the smallest and largest contiguous areas that are to be considered a Blob. A good value for the maximum area is the default of 0. Similar to the preceding analyses, the minimum Blob Area should be raised until events triggered from unwanted image artifacts disappear. There is no upper bound for the size of a contiguous area that will still be considered a Blob.
ru: Используется *Blob*-проверка тревоги. Параметры области Blob контролируют наименьшую и наибольшую непрерывную область, которая должна рассматриваться как Blob. Хорошее значение для максимальной площади составляет по умолчанию 0. Подобно предыдущим анализам, минимальная площадь Blob должна быть увеличена до тех пор, пока события, вызванные нежелательными артефактами изображения, не исчезнут. Нет верхнего предела для размера непрерывной области, которая все еще будет считаться Blob.

source: [M] Min/Max Blobs
ru: [M] Минимальные/Максимальные Блобы

source: Used by *Blob* Alarm Check. Any positive number of blobs will trigger an event, so the default value of 1 for Minimum Blobs works for most cases. In some circumstances it may benefit to have only one blob NOT trigger an event. In this case setting Minimum Blobs value to 2 or higher may serve some special purpose. A good value for the Maximum Blobs is the default of 0. There is no upper bound for the number of Blobs that will trigger an event. Use the Maximum Blobs parameter to prevent alarms from events that show a high number of Blobs if desired.
ru: Используется *Blob* Alarm Check. Любое положительное число Blobs вызовет событие, поэтому значение по умолчанию 1 для Минимального количества Blobs подходит для большинства случаев. В некоторых обстоятельствах может быть полезно, чтобы только один Blob не вызывал событие. В этом случае установка значения Минимального количества Blobs на 2 или выше может служить определенной цели. Хорошее значение для Максимум Blobs - это значение по умолчанию 0. Нет верхнего предела для количества Blobs, которые могут вызвать событие. Используйте параметр Максимум Blobs для предотвращения срабатывания сигналов от событий, которые показывают большое количество Blobs, если это необходимо.

source: [N] Overload Frame Ignore Count
ru: [N] Превышение счетчика игнорирования рамки

source: This setting specifies the number of frames to NOT raise an alarm after an Overload. In this context, Overload is defined as a detected change too big to raise an alarm. The idea is that after a change like a light turning on covering the entire image which is considered too big to count as an alarm, it could take a couple of frames for things to settle down again. Depending on the alarm check method that could be:
ru: Этот параметр определяет количество кадров, после которых не будет срабатывать сигнал тревоги после перегрузки. В этом контексте перегрузка определяется как обнаруженное изменение слишком большого размера, чтобы поднять тревогу. Идея заключается в том, что после изменения, такого как включение света, которое покрывает все изображение и считается слишком большим, чтобы считать это сигналом тревоги, может потребоваться несколько кадров, чтобы все снова успокоилось. В зависимости от метода проверки тревоги это может быть:

source: Number of alarmed pixels > Max Alarmed Area or
ru: Количество пикселей с предупреждением > Максимальная область предупреждения или

source: Number of filtered pixels > Max Filtered Area or
ru: Количество отфильтрованных пикселей > Максимальная фильтрованная область или

source: Number of Blobs > Max Blobs
ru: Количество Блобов > Максимальное количество Блобов

source: [O] Extend Alarm Frame Count
ru: [O] Расширить счетчик будильника

source: This field applies to Preclusive Zones only. Placing a value in this field holds the Preclusive Zone active for the specified number of frames after the initial triggering event. This is useful in cases where a sudden change in light level triggers the Preclusive zone, but the Zone needs to be held active for a few frames as the camera itself adjusts to that change in light level.
ru: Это поле применяется только к зонам преклюзии. Установка значения в этом поле удерживает зону преклюзии активной в течение указанного количества кадров после первоначального события срабатывания. Это полезно в случаях, когда внезапное изменение уровня освещенности вызывает активацию зоны преклюзии, но зоне необходимо оставаться активной в течение нескольких кадров, поскольку камера сама адаптируется к этому изменению уровня освещенности.

source: Zone Regions
ru: Зоны Регионов

source: To modify an existing Zone, from the `Zone View`_ click on either the Zone region or Zone Name. After making any changes to the Zone Regions, click :guilabel:`SAVE`.
ru: Для изменения существующей Зоны, с `Zone View`_ щелкните по региону Зоны или по имени Зоны. После внесения любых изменений в регионы Зоны, нажмите :guilabel:`SAVE`.

source: Zone Region Definitions
ru: Определения зон региона

source: The left side of the display contains the Zone region information. The sample shown above shows a Zone region defined by 5 points which is intended to watch the driveway for motion. The shape of the region causes the analysis methods to ignore the sidewalk and road which are areas that are not of interest in this Zone. Separate Zone regions within the monitor image area can also be defined for those areas.
ru: Левая сторона дисплея содержит информацию о регионе зоны. Приведенный выше образец показывает зону, определенную пятью точками, которая предназначена для наблюдения за проезжей частью для движения. Форма области вызывает игнорирование тротуара и дороги, которые являются областями, которые не представляют интереса в этой зоне. Также можно определить отдельные зоны в пределах монитора изображения для этих областей.

source: [A] Zone Region
ru: [A] Зона Регион

source: Displays an overlay of the current Zone region on the monitor stream. Note that the area of the region is proportional to the processing time required. Only include areas where motion detection and analysis are required. Zone Regions can be any shape as long as they do not self-intersect with the outside edges crossing over each other. Colour of Region indicates the Zone type with **Active** shown in red, **Inclusive** Zones are orange, **Exclusive** Zones are purple, **Preclusive** Zones are blue, **Inactive** Zones are white and **Privacy** Zones are black and opaque. Please note that the default Region for a newly defined monitor covers the entire captured image area. In most cases this is not desired, so it should be either deleted or re-defined to cover the area of interest.
ru: Выводит наложение текущего региона зоны на поток монитора. Обратите внимание, что площадь региона пропорциональна времени обработки, требуемому для обработки. Включайте только те области, где требуется обнаружение движения и анализ. Регионы Зоны могут быть любой формы, при условии, что они не пересекаются сами с собой и не пересекают внешние края. Цвет региона указывает на тип зоны: **Активная** показана красным, **Включающая** зоны - оранжевым, **Исключающая** зоны - фиолетовым, **Предотвращающая** зоны - синим, **Неактивная** зона - белым, а **Конфиденциальность** - черным и непрозрачным. Пожалуйста, обратите внимание, что по умолчанию регион для только что определенного монитора покрывает всю область захваченного изображения. В большинстве случаев это нежелательно, поэтому его следует либо удалить, либо перенастроить, чтобы он покрывал интересующую область.

source: [B] Point
ru: [B] Точка

source: Lists the defined region outline Points. Note that Points are generally listed in clockwise order with 1 being in the upper left area of the view. The currently selected Point is highlighted yellow in the Point list. A Point can be defined by dragging the Point in the image or typing specific values in the Coordinates boxes. Please note that it is possible to define Points outside the image capture resolution area and will prevent the Zone from functioning.
ru: Перечисляет очертания определенной области. Обратите внимание, что точки обычно перечисляются в часовом порядке, начиная с 1, находящейся в верхнем левом углу изображения. Выбранная в данный момент точка выделена желтым цветом в списке точек. Точку можно определить, перетащив точку в изображении или введя конкретные значения в поля координат. Пожалуйста, обратите внимание, что возможно определить точки за пределами области разрешения изображения, что приведет к тому, что зона не будет функционировать.

source: [C] Coordinates
ru: [C] Координаты

source: Displays the Coordinates of the points with 0,0 being defined as the upper left corner of the region. Make sure that all Coordinates are within the captured resolution area otherwise the image analysis will not work properly or possibly not at all.
ru: Выводит координаты точек с 0,0, определяемыми как верхний левый угол региона. Убедитесь, что все координаты находятся в пределах области захвата разрешения, иначе анализ изображения не будет работать должным образом или, возможно, вообще не будет работать.

source: [D] Action
ru: [Д] Действие

source: Remove or add points. To remove the currently selected point select :guilabel:`-`. To add a new point after the currently selected point click :guilabel:`+`.
ru: Удалить или добавить точки. Чтобы удалить выбранную точку, выберите: :guilabel:`-`. Чтобы добавить новую точку после текущей выбранной точки, щелкните: :guilabel:`+`.

source: [E] Analysis
ru: [E] Анализ

source: Allows selection of Showing Analysis or Not Showing Analysis in the Zone View. Click on the icon to toggle.
ru: Разрешает выбор отображения анализа или не отображения анализа в зоне просмотра. Щелкните значок, чтобы переключиться.

source: [F] Viewing
ru: [F] Просмотр

source: Allows Play or Pause the monitor stream in the Zone View. Click on the icon to toggle.
ru: Позволяет включать или приостанавливать поток монитора в зоне просмотра. Щелкните значок, чтобы переключиться.

source: [G] Save / Cancel
ru: [S] Сохранить / Отменить

source: Click :guilabel:`SAVE` to save the currently entered Zone points and parameters. Click :guilabel:`CANCEL` to cancel any changes that have been made to the Zone points and parameters.
ru: Нажмите :guilabel:`SAVE`, чтобы сохранить текущие точки зоны и параметры. Нажмите :guilabel:`CANCEL`, чтобы отменить любые изменения, внесенные в точки зоны и параметры.

source: Other Information
ru: Другая информация

source: Refer to `this <https://wiki.zoneminder.com/index.php/Understanding_ZoneMinder%27s_Zoning_system_for_Dummies>`__ user contributed guide in the ZoneMinder Wiki for additional detailed information with illustrations if you are new to ZoneMinder and need additional help understanding Zone Definition.
ru: Обратитесь к этому пользовательскому руководству в разделе "Зонирование системы ZoneMinder для чайников" на странице "Вики ZoneMinder", если вы новичок в ZoneMinder и вам нужна дополнительная помощь по определению зоны.
