Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/definezone.po
Languages: ru

source: Defining Zones
ru: Определение зон

source: Zones are used for image analysis in ZoneMinder and Zone definition has a significant effect on the effectiveness and performance of a ZoneMinder server. An optimally configured Zone will reduce CPU processing requirements as well the number of unintended saved events. Therefore, it is important to understand the concepts behind the many Zone types as well as Zone parameter settings and their proper use. From the Console interface, click on the number in the Zones column of any monitor to enter the Zone view.
ru: Зоны используются для анализа изображений в ZoneMinder, и определение зон имеет значительное влияние на эффективность и производительность сервера ZoneMinder. Оптимально настроенная зона снизит требования к обработке ЦП, а также количество нежелательных сохраненных событий. Поэтому важно понимать концепции, лежащие в основе многих типов зон, а также настройки параметров зоны и их правильное использование. С консольного интерфейса щелкните по номеру в столбце "Зоны" любого монитора, чтобы перейти в режим просмотра зоны.

source: Zone View
ru: Зона просмотра

source: Defining Zones - Zone View
ru: Определение зон - Зональный вид

source: An illustrative (but not very practical) example is shown above to help introduce the items found in the Zone View.
ru: Примером, иллюстрирующим (но не очень практичным), является пример, приведенный выше, чтобы помочь представить предметы, найденные в Зоне просмотра.

source: [A] Monitor View
ru: [A] Монитор вид

source: Shows the selected monitor live view with overlay of existing defined Zones and their respective regions. An existing Zone can be edited by clicking on its region. Note that the different types of Zones are depicted with specific colours. The default Zone type is **Active** shown in red, **Inclusive** Zones are orange, **Exclusive** Zones are purple, **Preclusive** Zones are blue, **Inactive** Zones are grey and **Privacy** Zones are opaque black. The definition for each Zone type is explained below in the `Zone Parameters`_ section.
ru: Показывает живой вид выбранного монитора с наложением существующих определённых Зон и их соответствующих регионов. Существующую Зону можно редактировать, щелкнув по её региону. Обратите внимание, что разные типы Зон отображаются с использованием конкретных цветов. По умолчанию тип Зоны **Активная** показан в красном цвете, **Включающие** Зоны - оранжевые, **Исключающие** Зоны - фиолетовые, **Преклюзивные** Зоны - синие, **Неактивные** Зоны - серые и **Конфиденциальность** Зоны - непрозрачно черные. Определение для каждого типа Зон объясняется ниже в разделе `Параметры Зон`_.

source: [B] Zone List
ru: [B] Зона Список

source: Lists the existing defined Zones for the monitor along with their Type and Area given in both number of pixels and area in percent relative to the entire monitor image. Knowing the number of pixels in a Zone region will be necessary for setting many of the Alarm Check related parameters. An existing Zone can be edited by clicking on its :guilabel:`Name`.
ru: Перечисляет существующие определенные зоны для монитора вместе с их типом и площадью, указанными как в количестве пикселей, так и в процентах относительно всего изображения монитора. Знание количества пикселей в зоне региона будет необходимым для настройки многих параметров проверки тревоги. Существующую зону можно редактировать, щелкнув по ее :guilabel:`Названию`.

source: [C] Mark
ru: [C] Марк

source: Used for deleting Zones. Check each box of the Zone to be deleted and click :guilabel:`DELETE`.
ru: Предназначено для удаления Зон. Отметьте каждый квадратик зоны, которую вы хотите удалить, и нажмите :guilabel:`УДАЛИТЬ`.

source: Click :guilabel:`+ADD NEW ZONE` to add a new Zone for the monitor.
ru: Нажмите :guilabel:`+ADD NEW ZONE`, чтобы добавить новую зону для монитора.

source: [E] Status
ru: [E] Статус

source: Displays basic monitor status: alarm state, viewing FPS, capturing FPS and analysis FPS.
ru: Отображает базовые параметры монитора: состояние тревоги, количество кадров в секунду при просмотре, количество кадров в секунду при захвате и количество кадров в секунду при анализе.

source: Zone Parameters
ru: Параметры зоны

source: To modify an existing Zone, from the `Zone View`_, click on either the Zone region or Zone Name. After making any changes to the Zone Parameters, click :guilabel:`SAVE`.
ru: Для модификации существующей Зоны, из `Обзора Зон`_, щелкните либо по региону Зоны, либо по имени Зоны. После внесения любых изменений в параметры Зоны, нажмите :guilabel:`СОХРАНИТЬ`.

source: Defining Zones - Zone Analysis Parameters
ru: Определение зон - Параметры анализа зон

source: The right side of the display contains the Zone analysis parameter information. This is where the analysis type and various tuning parameters can be set. The user can manually fine tune the analysis settings or if desired various Preset options are available.
ru: На правой стороне дисплея отображается информация о параметрах анализа зоны. Здесь можно установить тип анализа и различные параметры настройки. Пользователь может вручную настроить параметры анализа или, при желании, выбрать один из доступных предустановок.

source: [A] Name
ru: [A] Имя

source: Each Zone can be named for reference purposes which will be used for logging and debugging. Choose a Name that helps uniquely identify the Zone.
ru: Каждая зона может быть названа для целей идентификации, которая будет использоваться для регистрации и отладки. Выберите имя, которое помогает уникально идентифицировать зону.

source: [B] Type
ru: [B] Тип

source: The Zone Type determines the image processing method and is one of the more important concepts in ZoneMinder.
ru: Тип зоны определяет метод обработки изображений и является одним из более важных концепций в ZoneMinder.

source: **Active:** This is the default Zone type and triggers an alarm when motion is detected within it. Most Zones will use this type. Only Active and Exclusive Zones can initiate the triggering of an alarm.
ru: **Активный:** Это стандартный тип зоны и срабатывает тревога при обнаружении движения внутри нее. Большинство зон будут использовать этот тип. Только активные и исключительные зоны могут инициировать срабатывание тревоги.

source: **Inclusive:** This Zone type can be used for any Zones that you want to trigger an alarm only if at least one Active Zone has already triggered one. For example this could cover an area of the image like a plant or tree which moves a lot and would trigger many alarms. Perhaps this is behind an area to be monitored though, in this case create an Active Zone covering the non-moving parts and an Inclusive Zone covering the tree perhaps with less sensitive detection settings. If something triggers an alarm in the Active Zone and also in the Inclusive Zone they would both be registered. The resulting alarm would be larger than if it had been blanked out altogether.
ru: **Включительно:** Этот тип зоны может использоваться для любых зон, которые вы хотите активировать сигнал тревоги только в том случае, если уже была активирована хотя бы одна активная зона. Например, это может покрыть область изображения, такую как растение или дерево, которое движется много и вызовет множество сигналов тревоги. Возможно, это находится за зоной наблюдения, в этом случае создайте активную зону, охватывающую неподвижные части, и включительную зону, охватывающую дерево, возможно, с менее чувствительными настройками обнаружения. Если что-то вызывает сигнал тревоги в активной зоне и также в зоне включения, они оба будут зарегистрированы. Результатом будет сигнал тревоги больше, чем если бы он был полностью отключен.

source: **Exclusive:** Triggers an alarm when motion is detected within it, as long as no alarms have already been triggered in an Active zone. This is the most specialized of the Zone types. For instance for the camera covering my garden I keep watch for a hedgehog that visits most nights and scoffs the food out of my cat's bowls. By creating a sensitive Exclusive Zone in that area I can ensure that a hedgehog alarm will only trigger if there is activity in that small area. If something much bigger occurs, like someone walking by, it will trigger a regular alarm and not one from the Exclusive Zone. Thus, it can be ensured that alarms for big events are captured as well as special small events. Any others are ignored.
ru: **Эксклюзив:** Вызывает сигнал тревоги при обнаружении движения внутри него, пока не было активировано ни одного сигнала тревоги в активной зоне. Это самый специализированный из типов зон. Например, для камеры, покрывающей мой сад, я наблюдаю за ежом, который обычно посещает большинство ночей и съедает пищу из мисок моей кошки. Создавая чувствительную эксклюзивную зону в этой области, я могу быть уверен, что сработает сигнал тревоги о ежике только в том случае, если в этой небольшой области происходит какая-то активность. Если что-то гораздо больше происходит, например, кто-то проходит мимо, это вызовет обычный сигнал тревоги, а не один из зоны Exclusive. Таким образом, можно гарантировать, что сигналы тревоги о больших событиях будут зафиксированы так же, как и специальные небольшие события. Любые другие игнорируются.

source: **Preclusive:** If triggered this Zone type will preclude an alarm being generated for that image frame. So motion or other changes that occur in a Preclusive Zone will have the effect of ensuring that no alarm occurs at all. The application for this Zone type is primarily as a shortcut for detecting general large-scale lighting or other changes. Preclusive Zones are designed to be fairly small, even just a few pixels across, with quite low alarm thresholds. They should be situated in areas of the image that are less likely to have motion occur such as high on a wall or in a corner. Should a general illumination change occur they would be triggered at least as early as any Active Zones and prevent any other Zones from generating an alarm. Obviously, careful placement is required to ensure that they do not cancel any genuine alarms or that they are not so close together that any motion just hops from one Preclusive Zone to another. Preclusive Zones may also be used to reduce processing time by situating one over an Active zone. The Preclusive Zone is processed first; if it is triggered the rest of the Zones will not be processed. See Extend Alarm Frame Count below for a way to hold the Preclusive Zone active for an extended period.
ru: **Преключатель:** Если срабатывает этот тип зоны, то это предотвращает генерацию сигнала тревоги для данного кадрового изображения. Таким образом, любые изменения, происходящие в зоне преключения, будут иметь эффект предотвращения возникновения тревоги вообще. Применение этого типа зоны в основном используется как сокращение для обнаружения общих крупных изменений освещения или других изменений. Зоны преключения предназначены для того, чтобы быть довольно маленькими, даже всего несколько пикселей по ширине, с очень низкими порогами тревоги. Они должны располагаться в областях изображения, где маловероятно возникновение движения, например, высоко на стене или в углу. Если произойдет общее изменение освещения, они будут активированы не менее рано, чем активные зоны, и предотвратят возникновение тревоги в других зонах. Очевидно, что требуется тщательное размещение, чтобы убедиться, что они не отменяют подлинные сигналы тревоги или что они не расположены так близко друг к другу, что любое движение просто перескакивает из одной зоны преключения в другую. Зоны преключения также могут использоваться для сокращения времени обработки путем размещения одной над активной зоной. Зона преключения обрабатывается первой; если она срабатывает, остальные зоны не будут обрабатываться. См. "Увеличение продолжительности тревожного сообщения" ниже для способа удержания зоны преключения активной в течение более длительного периода.

source: **Inactive:** Suppresses the detection of motion within it. This can be layered on top of any other Zone type, preventing motion within the Inactive Zone from being effective for any other Zone type. Use Inactive Zones to cover areas in which nothing notable will ever happen or where false alarms would occur that don't relate to what is being monitored. Inactive Zones may be placed over other Zones to reduce detection areas. As a general practice Zones should abut each other instead of overlapping to avoid processing of the same area more than once.
ru: **Неактивный:** Подавляет обнаружение движения внутри него. Это может быть наложено поверх любого другого типа зоны, предотвращая движение внутри неактивной зоны от эффективного для любого другого типа зоны. Используйте неактивные зоны для покрытия областей, в которых никогда не произойдет ничего примечательного или где ложные тревоги будут возникать, которые не связаны с тем, что отслеживается. Неактивные зоны могут быть размещены поверх других зон для уменьшения областей обнаружения. Как правило, зоны должны примыкать друг к другу, а не перекрываться, чтобы избежать обработки одной и той же области более одного раза.

source: **Privacy:** Blackens the pixels within it to make the region completely opaque. This can be used to hide regions within the image if the situation does not allow another solution. This Zone type is different from all the others in that it gets processed as soon as possible during capture (even before the timestamp is added to the image) and is not part of the analyzing process. Note that if a Privacy Zone is added, changed or deleted, the changes will not be seen in the image until the capture process is restarted. This is done automatically, but generally takes a few seconds.
ru: **Конфиденциальность:** Затемняет пиксели внутри него, чтобы сделать область полностью непрозрачной. Это может быть использовано для сокрытия областей в изображении, если ситуация не позволяет использовать другое решение. Этот тип зоны отличается от всех остальных тем, что он обрабатывается как можно скорее при захвате (даже до добавления времени штампа к изображению) и не является частью процесса анализа. Обратите внимание, что если добавить, изменить или удалить зону конфиденциальности, изменения не будут видны в изображении до тех пор, пока процесс захвата не будет перезапущен. Это делается автоматически, но обычно занимает несколько секунд.

source: [C] Preset
ru: [C] Пресет

source: The Preset chooser sets sensible default values for the Zone parameters based on computational needs (fast or best) and sensitivity (low, medium, high). It is not required to use a Preset but if one is selected, the parameters can be subsequently changed as desired. For a ZoneMinder server running on modern equipment with few monitors, the 'Best, high sensitivity' Preset can be chosen as a good starting point.
ru: Выборщик предустановок устанавливает разумные значения по умолчанию для параметров зоны, основанные на потребностях в вычислениях (быстрых или лучших) и чувствительности (низкой, средней, высокой). Не требуется использовать предустановку, но если она выбрана, параметры можно изменить впоследствии так, как захочется. Для сервера ZoneMinder, работающего на современном оборудовании с несколькими мониторами, предустановка "Лучшее, высокая чувствительность" может быть хорошим начальным пунктом.

source: It is important to understand that the available Presets are intended merely as a starting point. Because every camera view is unique, they are not guaranteed to work properly in every case. Presets tend to work acceptably for indoor cameras where the objects of interest are relatively close and typically there are few or no unwanted objects moving within the camera view. Presets, on the other hand, tend to not work acceptably for outdoor cameras where the field of view is typically much wider, objects of interest are farther away and changing weather patterns can cause false triggers. For outdoor cameras the motion detection will need to be tuned for each Zone to obtain desired results.
ru: Важно понимать, что доступные Пресеты предназначены лишь в качестве отправной точки. Поскольку каждая камера имеет уникальную точку обзора, они не гарантированно будут работать правильно во всех случаях. Пресеты обычно работают приемлемо для внутренних камер, где объекты интереса находятся относительно близко и обычно есть мало или вообще нет нежелательных объектов, движущихся в поле зрения камеры. Пресеты, с другой стороны, обычно не работают приемлемо для наружных камер, где поле зрения обычно намного шире, объекты интереса находятся дальше и меняющиеся погодные условия могут вызывать ложные срабатывания. Для наружных камер настройка обнаружения движения должна быть настроена для каждой Зоны, чтобы получить желаемые результаты.

source: [D] Units
ru: [D] Единицы

source: Selects the method for entry of Zone area parameters.
ru: Выберите метод ввода параметров зоны.

source: **Pixels:** Selecting this option will allow the analysis parameters related to area to be entered or viewed in units of Pixels. The advantage of using Pixels for area parameters is that it allows a more fine-grained control of the settings.
ru: **Пиксели:** Выбрав этот вариант, вы сможете ввести или просмотреть параметры анализа в единицах Пикселей. Преимущество использования Пикселей для параметров площади заключается в том, что это позволяет более точно контролировать настройки.

source: **Percentage:** Selecting this option will allow the analysis parameters related to area to be entered or viewed as a Percentage. These Percentage values refer to the area of the Zone region and not the monitor image as a whole. This facilitates the estimation of area in most cases.
ru: **Процент:** Выбрав этот вариант, вы сможете ввести или просмотреть параметры анализа, относящиеся к площади, в процентах. Эти процентные значения относятся к площади зоны и не к общему изображению монитора. Это облегчает оценку площади в большинстве случаев.

source: [E] Alarm Colour
ru: [E] Цвет будильника

source: These parameters can be used to individually colour the Zone alarm overlay pattern. Alarms in this Zone will be highlighted in the alarm colour. The RGB colour system is used with a range of values of 0-255 for each primary colour. This option is irrelevant for Preclusive, Inactive and Privacy Zones and will be disabled.
ru: Эти параметры могут использоваться для индивидуального цветового оформления шаблона перекрытия Zone alarm. Сигналы в этой зоне будут выделены цветом сигнализации. Система RGB используется с диапазоном значений от 0 до 255 для каждого основного цвета. Этот параметр не имеет значения для Зон запрета, Неактивных и Приватных зон и будет отключен.

source: [F] Alarm Check Method
ru: [F] Метод Проверки Будильника

source: There are three Alarm Check Methods. They are applied sequentially and are layered. In AlarmedPixels mode, only the AlarmedPixels analysis is performed. For FilteredPixels mode, the AlarmedPixels analysis is performed first, followed by the FilteredPixels analysis. Using the Blobs mode, all 3 analysis methods are performed sequentially. An alarm is triggered only if *all* of the enabled analysis mode criteria are met. For performance reasons, as soon as the criteria for one of the analysis modes is *not* met, the alarm checking for the frame ends. Because the subsequent modes each require progressively more computations, it is a good idea to tune the parameters in each of the activated layers.
ru: Существует три метода проверки тревоги. Они применяются последовательно и слоями. В режиме "Тревожные пиксели" выполняется только анализ "Тревожные пиксели". Для режима "Фильтрация пикселей" сначала выполняется анализ "Тревожные пиксели", а затем - анализ "Фильтрация пикселей". При использовании режима "Объекты" все три анализа выполняются последовательно. Тревога срабатывает только в том случае, если *все* критерии режима анализа, включенного в работу, выполнены. По причинам производительности, как только критерий для одного из режимов анализа не выполнен, проверка тревоги для кадра заканчивается. Поскольку последующие режимы требуют все больше вычислений, рекомендуется настроить параметры в каждом из активных слоев.

source: **AlarmedPixels:** Alarmed pixels is the first layer of analysis and is always enabled. It is recommended to start with this method and move on to the subsequent methods once the effects of the related analysis parameters are understood. In the AlarmedPixels mode, 2 parameter categories are available for tuning: Min/Max Pixel Threshold, and Min/Max Alarmed Area.
ru: **Алармированные пиксели:** Алармированные пиксели являются первым слоем анализа и всегда включены. Рекомендуется начать с этого метода и перейти к последующим методам после того, как эффекты связанных параметров анализа будут поняты. В режиме "Алармированные пиксели" доступны для настройки две категории параметров: пороговое значение минимального/максимального пикселя и пороговое значение минимальной/максимальной алармированной области.

source: **FilteredPixels:** Selecting the FilteredPixels Alarm Check Method adds another layer of analysis to the AlarmedPixels check along with 2 additional parameter categories for tuning. This layer works by analyzing the alarmed pixels identified in the first layer. Alarmed pixels are disregarded, in this and future layers if enabled, if they are not in groups of a minimum small square size. Primarily, this filtering removes isolated alarmed pixels that may be artifacts of the camera, lens, or compression.
ru: **Фильтрация пикселей:** Выбор метода проверки фильтрации пикселей добавляет еще один уровень анализа к проверке пикселей, вызывающих тревогу, вместе с двумя дополнительными категориями параметров для настройки. Этот слой работает путем анализа пикселей, вызывающих тревогу, выявленных в первом слое. Пиксели, вызывающие тревогу, игнорируются, как в этом слое, так и в будущих слоях, если они не являются частью групп минимального размера квадрата. В основном, эта фильтрация удаляет изолированные пиксели, вызывающие тревогу, которые могут быть артефактами камеры, объектива или сжатия.

source: **Blobs:** When two or more Filtered areas touch or share a boundary, it is sensible to evaluate the regions as one contiguous area instead of separate entities. A Blob is a contiguous area made up of multiple filtered areas. Whereas FilteredPixels is useful for excluding parts of the image that are not part of the actual scene, Blob filtering is better suited to disregarding areas of the actual scene that are not of interest.
ru: **Блобы:** Когда две или более фильтрованных области соприкасаются или имеют общую границу, имеет смысл рассматривать эти области как одну непрерывную область, а не как отдельные сущности. Блоб - это непрерывная область, состоящая из нескольких фильтрованных областей. В то время как фильтрация пикселей полезна для исключения частей изображения, которые не являются частью реальной сцены, фильтрация блобов лучше подходит для игнорирования областей реальной сцены, которые не представляют интереса.

source: Alarm Check Method Comparison (Left to Right): AlarmedPixels, FilteredPixels, Blobs
ru: Сравнение методов проверки тревоги (слева направо): пиксели тревоги, пиксели, выделенные области
