Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/filterevents.po
Languages: ru

source: Filtering is a powerful mechanism you can use to eliminate events that fit a certain pattern however in many cases modifying the zone settings will better address this. Where it really comes into its own is generally in applying time filters, so for instance events that happen during weekdays or at certain times of the day are highlighted, uploaded or deleted. Additionally using disk related terms in your filters means you can automatically create filters that delete the oldest events when your disk gets full. Be warned however that if you use this strategy then you should limit the returned results to the amount of events you want deleted in each pass until the disk usage is at an acceptable level. If you do not do this then the first pass when the disk usage is high will match, and then delete, all events unless you have used other criteria inside of limits. ZoneMinder ships with a sample filter already installed, though disabled. The PurgeWhenFull filter can be used to delete the oldest events when your disk starts filling up. To use it you should select and load it in the filter interface, modify it to your requirements, and then save it making you sure you check the ‘Delete all matches’ option. This will then run in the background and ensure that your disk does not fill up with events.
ru: Фильтрация - это мощный механизм, который вы можете использовать для устранения событий, соответствующих определенному шаблону. Однако в большинстве случаев изменение настроек зоны лучше всего подходит для решения этой проблемы. Там, где он действительно проявляет себя, это обычно при применении фильтров по времени, так что, например, события, происходящие в рабочие дни или в определенное время дня, выделяются, загружаются или удаляются. Кроме того, использование терминов, связанных с диском, в ваших фильтрах означает, что вы можете автоматически создавать фильтры, которые удаляют самые старые события, когда диск заполняется. Однако имейте в виду, что если вы используете эту стратегию, вам следует ограничить количество возвращаемых результатов до количества событий, которое вы хотите удалить за один проход, пока дисковое пространство не достигнет приемлемого уровня. Если вы этого не сделаете, первый проход, когда дисковое пространство высоко, совпадет и затем удалит все события, за исключением тех случаев, когда вы использовали другие критерии внутри ограничений. ZoneMinder поставляется с предустановленным фильтром уже установленным, хотя и отключенным. Фильтр "Очистка при полном диске" может быть использован для удаления самых старых событий, когда диск начинает заполняться. Чтобы использовать его, вы должны выбрать и загрузить его в интерфейсе фильтра, изменить его в соответствии с вашими требованиями и сохранить его, убедившись, что вы выбрали опцию "Удалить все совпадения". Это будет работать в фоновом режиме и обеспечит, что ваш диск не заполнится событиями.

source: Saving filters
ru: Сохранение фильтров

source: When saving filters, if you want the filter to run in the background make sure you select the "Run filter in background" option. When checked, ZoneMinder will make sure the filter is checked regularly. For example, if you want to be notified of new events by email, you should make sure this is checked. Filters that are configured to run in the background have a "*" next to it.
ru: При сохранении фильтров, если вы хотите, чтобы фильтр работал в фоновом режиме, убедитесь, что вы выбрали опцию "Запустить фильтр в фоновом режиме". Когда эта опция отмечена, ZoneMinder будет регулярно проверять наличие фильтра. Например, если вы хотите получать уведомления о новых событиях по электронной почте, убедитесь, что эта опция отмечена. Фильтры, которые настроены на работу в фоновом режиме, имеют звездочку рядом с ними.

source: How filters actually work
ru: Как фильтры работают на самом деле

source: It is useful to know how filters actually work behind the scenes in ZoneMinder, in the event you find your filter not functioning as intended:
ru: Полезно знать, как работают фильтры на самом деле за кулисами ZoneMinder, если вы обнаружите, что ваш фильтр не работает так, как предполагалось:

source: Each filter set to run in the background will be run in it's own process called ``zmfilter.pl`` which retrieves filters from the Filters database table
ru: Каждый фильтр, установленный на выполнение в фоновом режиме, будет выполняться в собственном процессе под названием ``zmfilter.pl``, который извлекает фильтры из таблицы базы данных "Фильтры"

source: zmfilter.pl runs every FILTER_EXECUTE_INTERVAL seconds (default is 20s, can be changed in Options->System)
ru: zmfilter.pl запускается каждые FILTER_EXECUTE_INTERVAL секунд (по умолчанию это 20 секунд, это можно изменить в меню "Опции->Система")

source: after each interval the filter will query the database and apply the action to each matching event.
ru: После каждого интервала фильтр будет запрашивать базу данных и применять действие к каждому соответствующему событию.

source: zmfilter.pl also reloads the filter every FILTER_RELOAD_DELAY seconds (default is 300s/5mins, can be changed in Options->System)
ru: Также zmfilter.pl перезагружает фильтр каждые FILTER_RELOAD_DELAY секунд (по умолчанию это 300 секунд/5 минут, которые можно изменить в меню "Настройки->Система")

source: In previous versions of ZoneMinder filter changes would not take immediate effect, but now the web ui will start/stop/restart filters as appropriate upon editing a filter.
ru: В предыдущих версиях ZoneMinder изменения фильтров не вступали в силу немедленно, но теперь веб-интерфейс будет начинать/останавливать/перезапускать фильтры при редактировании фильтра.

source: Relative items in date strings
ru: Предметы, связанные с датами в строках

source: Relative items adjust a date (or the current date if none) forward or backward. The effects of relative items accumulate. Here are some examples:
ru: Релятивные элементы изменяют дату (или текущую дату, если таковая отсутствует). Эффекты релятивных элементов накапливаются. Вот несколько примеров:

source: The unit of time displacement may be selected by the string ‘year’ or ‘month’ for moving by whole years or months. These are fuzzy units, as years and months are not all of equal duration. More precise units are ‘fortnight’ which is worth 14 days, ‘week’ worth 7 days, ‘day’ worth 24 hours, ‘hour’ worth 60 minutes, ‘minute’ or ‘min’ worth 60 seconds, and ‘second’ or ‘sec’ worth one second. An ‘s’ suffix on these units is accepted and ignored.
ru: Единица времени смещения может быть выбрана с помощью строки ‘год’ или ‘месяц’ для перемещения по целым годам или месяцам. Это нечеткие единицы, поскольку годы и месяцы не имеют одинаковой продолжительности. Более точные единицы - это ‘неделя’, которая стоит 14 дней, ‘неделя’, которая стоит 7 дней, ‘день’, который стоит 24 часа, ‘час’, который стоит 60 минут, ‘минута’ или ‘мин’, которая стоит 60 секунд, и ‘секунда’ или ‘сек’, которая стоит одну секунду. Суффикс ‘s’ на этих единицах принимается и игнорируется.

source: The unit of time may be preceded by a multiplier, given as an optionally signed number. Unsigned numbers are taken as positively signed. No number at all implies 1 for a multiplier. Following a relative item by the string ‘ago’ is equivalent to preceding the unit by a multiplier with value -1.
ru: Единица времени может быть предварительно обозначена множителем, который представляется в виде опционально подписанного числа. Неотрицательные числа принимаются как положительно подписанные. Отсутствие числа вообще эквивалентно использованию множителя со значением 1. После относительного элемента следует строка «назад», что эквивалентно предшествованию единицы множителем со значением -1.

source: The string ‘tomorrow’ is worth one day in the future (equivalent to ‘day’), the string ‘yesterday’ is worth one day in the past (equivalent to ‘day ago’).
ru: Строка "завтра" стоит один день в будущем (эквивалентно "день"), строка "вчера" стоит один день в прошлом (эквивалентно "день назад").

source: The strings ‘now’ or ‘today’ are relative items corresponding to zero-valued time displacement, these strings come from the fact a zero-valued time displacement represents the current time when not otherwise changed by previous items. They may be used to stress other items, like in ‘12:00 today’. The string ‘this’ also has the meaning of a zero-valued time displacement, but is preferred in date strings like ‘this thursday’.
ru: Строки «сейчас» или «сегодня» являются относительными элементами, соответствующими нулевому смещению времени, эти строки происходят из факта, что нулевое смещение времени представляет текущее время, если оно не изменяется предыдущими элементами. Они могут использоваться для подчеркивания других элементов, например, в «12:00 сегодня». Строка «это» также имеет смысл нулевого смещения времени, но предпочтительна в строках даты, таких как «это четверг».

source: When a relative item causes the resulting date to cross a boundary where the clocks were adjusted, typically for daylight saving time, the resulting date and time are adjusted accordingly.
ru: Когда относительный элемент вызывает дату, пересекающую границу, где были скорректированы часы, обычно для летнего времени, дата и время корректируются соответствующим образом.

source: The fuzz in units can cause problems with relative items. For example, ‘2003-07-31 -1 month’ might evaluate to 2003-07-01, because 2003-06-31 is an invalid date. To determine the previous month more reliably, you can ask for the month before the 15th of the current month. For example:
ru: Затухание в единицах может вызвать проблемы с относительными элементами. Например, «2003-07-31 -1 месяц» может оцениваться как 2003-07-01, потому что 2003-06-31 является недопустимой датой. Чтобы определить предыдущий месяц более надежно, вы можете запросить месяц до 15-го числа текущего месяца. Например:

source: As this applies to ZoneMinder filters, you might want to search for events in a period of time, or maybe for example create a purge filter that removes events older than 30 days. For the later you would want at least two lines in your filter. The first line should be:
ru: Как это относится к фильтрам ZoneMinder, вы можете захотеть поискать события за определенный период времени или, например, создать фильтр очистки, который удаляет события старше 30 дней. Для последнего вам потребуется как минимум две строки в вашем фильтре. Первая строка должна быть:

source: [<Archive Status> <equal to> <Unarchived Only>]
ru: [<Статус архива> <равно> <Только разархивировано>]

source: as you don't want to delete your archived events.
ru: как вы не хотите удалять свои архивные события.

source: Your second line to find events older than 30 days would be:
ru: Ваша вторая строка для поиска событий старше 30 дней будет:

source: [and <Date><less than> -30 days]
ru: [и <Дата><менее чем> -30 дней]

source: You use "less than" to indicate that you want to match events before the specified date, and you specify "-30 days" to indicate a date 30 days before the time the filter is run. Of course you could use 30 days ago as well(?).
ru: Вы используете "меньше чем" для указания того, что вы хотите сопоставить события до указанной даты, и вы указываете "-30 дней", чтобы указать дату за 30 дней до времени выполнения фильтра. Конечно, вы также можете использовать "30 дней назад" (?)

source: You should always test your filters before enabling any actions based on them to make sure they consistently return the results you want. You can use the submit button to see what events are returned by your query.
ru: Вы всегда должны тестировать свои фильтры перед тем, как разрешать какие-либо действия на их основе, чтобы убедиться, что они постоянно возвращают результаты, которые вы хотите. Вы можете использовать кнопку "Отправить" для просмотра событий, возвращаемых вашим запросом.

source: Caveat with Relative items
ru: Предупреждение о связанных элементах

source: One thing to remember if you specify relative dates like "now" or "1 minute ago", etc, they are converted to a specific date and time by Zoneminder's filtering process (zmfilter.pl) when the filters are loaded. They are _NOT_ recomputed each time the filter runs. Filters are re-loaded depending on the value specified by FILTER_RELOAD_DELAY variable in the Zoneminder Web Console->Options->System
ru: Одно из того, что следует помнить, если вы указываете относительные даты, такие как "сейчас" или "1 минута назад", и т.д., они преобразуются в конкретную дату и время процессом фильтрации Zoneminder (zmfilter.pl) при загрузке фильтров. Они НЕ пересчитываются каждый раз, когда запускается фильтр. Фильтры перезагружаются в зависимости от значения, указанного в переменной FILTER_RELOAD_DELAY в веб-консоли Zoneminder->Настройки->Система

source: This may cause confusion in the following cases, for example: Let's say a user specifies that he wants to be notified of events via email the moment the event "DateTime" is "less than" "now" as a filter criteria. When the filter first gets loaded by zmfilter.pl, this will translate to "Match events where Start Time < " + localtime() where local time is the time that is resolved when this filter gets loaded. Now till the time the filter gets reloaded after FILTER_RELOAD_DELAY seconds (which is usually set to 300 seconds, or 5 minutes), that time does not get recomputed, so the filter will not process any new events that occur after that computed date till another 5 minutes, which is probably not what you want.
ru: Это может вызвать путаницу в следующих случаях, например: Предположим, пользователь указывает, что он хочет быть проинформирован о событиях по электронной почте в момент возникновения события "DateTime", если оно "менее чем" "сейчас" в качестве фильтра. Когда фильтр впервые загружается с помощью zmfilter.pl, это будет означать "Найти события, где Начало времени < " + localtime(), где локальное время - это время, которое определяется при загрузке этого фильтра. Пока фильтр не будет перезагружен через FILTER_RELOAD_DELAY секунд (обычно установлено на 300 секунд, или 5 минут), это время не пересчитывается, поэтому фильтр не будет обрабатывать новые события, которые происходят после этого рассчитанной даты до другого 5-минутного периода, что, вероятно, не является тем, что вы хотите.

source: Troubleshooting tips
ru: Советы по устранению неполадок

source: If your filter is not working, here are some useful tips:
ru: Если ваш фильтр не работает, вот несколько полезных советов:

source: Look at Info and Debug logs in Zoneminder
ru: Посмотрите информацию и журналы отладки в ZoneMinder

source: Run ``sudo zmfilter.pl -f <yourfiltername>`` from command line and see the log output
ru: Выполните команду ``sudo zmfilter.pl -f <yourfiltername>`` из командной строки и посмотрите вывод журнала

source: Check how long your action is taking - zmfilter.pl will wait for the action to complete before it checks again
ru: Проверьте, сколько времени занимает ваше действие - zmfilter.pl будет ждать завершения действия, прежде чем проверить снова

source: If you are using relative times like 'now' or '1 year ago' etc. remember that zmfilter converts that relative time to an absolute date only when it reloads filters, which is dictated by the FILTER_RELOAD_DELAY duration. So, for example, if you are wondering why your events are not being detected before intervals of 5 minutes and you have used such a relative condition, this is why
ru: Если вы используете относительные временные выражения, такие как 'сейчас' или '1 год назад', и т.д., помните, что zmfilter преобразует это относительное время в абсолютную дату только при перезагрузке фильтров, что определяется длительностью FILTER_RELOAD_DELAY. Таким образом, например, если вы задаетесь вопросом, почему ваши события не обнаруживаются до интервалов в 5 минут, и вы использовали такое относительное условие, вот почему

source: In the event that you see your new filter is working great when you try it out from the Web Console (using the Submit or Execute button) but does not seem to work when its running in background mode, you might have just chanced upon a compatibility issue between how Perl and PHP translate free form text to dates/times. When you test it via the "Submit" or "Execute" button, you are invoking a PHP function for time conversion. When the filter runs in background mode, zmfilter.pl calls a perl equivalent function. In some cases, depending on the version of Perl and PHP you have, the results may vary. If you face this situation, the best thing to do is to run ``sudo zmfilter.pl -f <yourfiltername>`` from a terminal to make sure the filter actually works in Perl as well.
ru: Если вы видите, что новый фильтр работает отлично, когда вы тестируете его через Веб-консоль (с помощью кнопки "Отправить" или "Выполнить"), но он не работает, когда он находится в фоновом режиме, возможно, вы столкнулись с проблемой совместимости между тем, как Perl и PHP преобразуют свободный текст в даты/время. Когда вы тестируете его с помощью кнопки "Отправить" или "Выполнить", вы вызываете функцию PHP для преобразования времени. Когда фильтр работает в фоновом режиме, zmfilter.pl вызывает эквивалентную функцию на Perl. В некоторых случаях, в зависимости от версии Perl и PHP, результаты могут различаться. Если вы сталкиваетесь с этой ситуацией, лучшее решение - запустить "sudo zmfilter.pl -f <вашеимяфильтра>" из терминала, чтобы убедиться, что фильтр действительно работает на Perl.
