Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/filterevents.po
Languages: ru

source: Filtering Events
ru: Фильтрация событий

source: Filters allow you to define complex conditions with associated actions in ZoneMinder. Examples could include:
ru: Фильтры позволяют вам определять сложные условия с связанными действиями в ZoneMinder. Примеры могут включать:

source: Send an email each time a new event occurs for a specific monitor
ru: Отправляйте электронное письмо каждый раз, когда происходит новое событие для конкретного монитора

source: Delete events that are more than 10 days old
ru: Удалите события, которые старше 10 дней

source: And many more.
ru: И многое другое.

source: The filter window can be accessed by tapping on the top level filter menu
ru: Фильтр окна можно открыть, коснувшись верхнего уровня меню фильтра

source: You can use the filter window to create your own filters or to modify existing ones. You can even save your favourite filters to re-use at a future date. Filtering itself is fairly simple; you first choose how many expressions you'd like your filter to contain. Changing this value will cause the window to redraw with a corresponding row for each expression. You then select what you want to filter on and how the expressions relate by choosing whether they are 'and' or 'or' relationships. For filters comprised of many expressions you will also get the option to bracket parts of the filter to ensure you can express it as desired. Then if you like choose how you want your results sorted and whether you want to limit the amount of events displayed.
ru: Вы можете использовать окно фильтра для создания собственных фильтров или для изменения существующих. Вы даже можете сохранить свои любимые фильтры для повторного использования в будущем. Фильтрация сама по себе довольно проста; сначала вы выбираете, сколько выражений вы хотите, чтобы ваш фильтр содержал. Изменение этого значения приведет к тому, что окно перерисуется с соответствующей строкой для каждого выражения. Затем вы выбираете, что хотите отфильтровать, и как связаны выражения, выбрав, являются ли они "и" или "или" отношениями. Для фильтров, состоящих из многих выражений, у вас также будет возможность заключить части фильтра в скобки, чтобы вы могли выразить его так, как вам нравится. Затем, если хотите, выберите, как вы хотите сортировать результаты, и хотите ли вы ограничить количество событий, отображаемых.

source: Here is what the filter window looks like
ru: Вот как выглядит окно фильтра

source: *A*: This is a dropdown list where you can select pre-defined filters. You will notice that ZoneMinder comes with a PurgeWhenFull filter that is configured to delete events if you reach 95% of disk space.
ru: Это выпадающий список, в котором вы можете выбрать заранее определенные фильтры. Вы заметите, что ZoneMinder поставляется с фильтром PurgeWhenFull, который настроен на удаление событий, если вы достигнете 95% дискового пространства.

source: *B*: If you are creating a new filter, you can type in a name for your filter here
ru: *B*: Если вы создаете новый фильтр, вы можете ввести здесь имя для своего фильтра

source: *C*: This is where you specify conditions that need to match before the filter is executed. You use the "+" and "-" buttons to add/delete conditions
ru: *C*: Здесь вы указываете условия, которые должны соответствовать перед выполнением фильтра. Вы используете кнопки "+" и "-", чтобы добавить/удалить условия

source: *D*: This allows you to perform sorting and limiting operations on the output before you take an action
ru: *D*: Это позволяет вам выполнять операции сортировки и ограничения на выходных данных перед тем, как предпринять какие-либо действия

source: *E*: This is where you specify what needs to happen when the conditions match:
ru: *E*: Здесь вы указываете, что должно произойти, когда условия совпадают:

source: Archive all matches: sets the archive field to 1 in the Database for the matched events. Think of 'archiving' as grouping them under a special category - you can view archived events later and also make sure archived events don't get deleted, for example
ru: Заархивировать все матчи: установить поле архива в 1 в базе данных для событий, которые были заданы. Представьте себе "архивирование" как группировку их под специальной категорией - вы можете просматривать архивные события позже и также убедитесь, что архивные события не удаляются, например

source: Todo
ru: Все

source: For the "create video" filter, put in more details on how it works, any dependencies etc.
ru: Для фильтра "создание видео" добавьте больше деталей о том, как он работает, любые зависимости и т.д.

source: Update used disk space: calculates how much disk space is currently taken by the event and updates the db record.
ru: Обновить используемое дисковое пространство: вычисляет, сколько дискового пространства в настоящее время используется событием, и обновляет запись в базе данных.

source: Create video for all matches: creates a video file of all the events that match
ru: Создать видео для всех матчей: создать видеофайл со всеми событиями, которые соответствуют

source: Create video for all matches: ffmpeg will be used to create a video file (mp4) out of all the stored jpgs if using jpeg storage.
ru: Создать видео для всех матчей: будет использоваться ffmpeg для создания видеофайла (mp4) из всех сохраненных jpg, если используется хранилище jpeg.

source: Execute command on all matches: Allows you to execute any arbitrary command on the matched events. You can use replacement tokens as subsequent arguments to the command, the last argument will be the absolute path to the event, preceded by replacement arguments. eg: /usr/bin/script.sh %MN% will execute as /usr/bin/script.sh MonitorName /path/to/event. Please note that urls may contain characters like & that need quoting. So you may need to put quotes around them like /usr/bin/scrupt.sh "%MN%".
ru: Выполнить команду для всех совпадений: позволяет выполнить любую произвольную команду для совпавших событий. Вы можете использовать замещающие маркеры как последующие аргументы к команде, последний аргумент будет абсолютным путем к событию, предшествуемым замещающими аргументами. например: /usr/bin/script.sh %MN% будет выполнено как /usr/bin/script.sh MonitorName /path/to/event. Пожалуйста, обратите внимание, что URL могут содержать символы, такие как & , которые требуют экранирования. Поэтому вам может потребоваться заключить их в кавычки, например /usr/bin/scrupt.sh "%MN%".

source: Delete all matches: Deletes all the matched events.
ru: Удалить все совпадения: удаляет все совпавшие события.

source: Email details of all matches: Sends an email to the configured address with details about the event.
ru: Укажите детали всех матчей: отправьте электронное письмо по указанному адресу с подробностями о мероприятии.

source: Copy all matches: copies the event files to another location, specified in the Copy To dropdown. The other location must be setup in the Storage Tab under options.
ru: Скопировать все совпадения: копирует файлы событий в другое место, указанное в выпадающем списке "Копировать в". Другое место должно быть настроено в разделе "Хранилище" в настройках.

source: Message details of all matches: Uses an email to SMS gateway to send an SMS message for each match.
ru: Детали сообщений о всех матчах: Использует электронную почту для отправки SMS-сообщения для каждого матча.

source: Move all matches: copies the event files to another location, specified in the Move To dropdown. The other location must be setup in the Storage Tab under options. The files will be delete from the original location.
ru: Переместить все совпадения: копирует файлы событий в другое место, указанное в раскрывающемся списке "В другую". Другое место должно быть настроено в разделе "Хранилище" под опциями. Файлы будут удалены из исходного места.

source: Run filter in background: When checked, ZoneMinder will make sure the filter is checked regularly. For example, if you want to be notified of new events by email, you should make sure this is checked. Filters that are configured to run in the background have a “*” next to it.
ru: Запустить фильтр в фоновом режиме: Когда выбрано, Zoneminder будет регулярно проверять наличие фильтра. Например, если вы хотите получать уведомления о новых событиях по электронной почте, убедитесь, что это выбрано. Фильтры, которые настроены на работу в фоновом режиме, имеют звездочку рядом с ними.

source: Run filter concurrently: Allows this filter to run in its own thread thereby letting other filters run in parallel.
ru: Запустить фильтр параллельно: позволяет этому фильтру запускаться в своем собственном потоке, тем самым позволяя другим фильтрам запускаться параллельно.

source: *F*: Use 'List Matches' to 'test' your matching conditions. This will just match and show you what filters match. Use 'Execute' to actually execute the action after matching your conditions. Use 'Save' to save the filter for future use and 'Reset' to clear your settings
ru: *F*: Используйте 'Найти совпадения', чтобы 'проверить' ваши условия совпадения. Это просто найдет и покажет вам, какие фильтры соответствуют условиям. Используйте 'Выполнить', чтобы фактически выполнить действие после совпадения ваших условий. Используйте 'Сохранить', чтобы сохранить фильтр для будущего использования и 'Сброс', чтобы очистить настройки

source: More details on filter conditions:
ru: Более подробная информация о фильтрах условий:

source: There are several different elements to an event that you can filter on, some of which require further explanation. These are as follows, * 'Date/Time' which must evaluate to a date and a time together, * 'Date' and 'Time' which are variants which may only contain the relevant subsets of this, * 'Weekday' which as expected is a day of the week.
ru: Есть несколько различных элементов для события, которые вы можете фильтровать, некоторые из которых требуют дальнейшего объяснения. Вот они: * 'Дата/Время', которое должно оцениваться как дата и время вместе, * 'Дата' и 'Время', которые являются вариантами, которые могут содержать только соответствующие подмножества этого, * 'День недели', который, как и ожидалось, является днем недели.

source: All of the preceding elements take a very flexible free format of dates and time based on the PHP strtotime function (https://www.php.net/manual/en/function.strtotime.php). This allows values such as 'last Wednesday' etc to be entered. We recommend acquainting yourself with this function to see what the allowed formats are. However automated filters are run in perl and so are parsed by the Date::Manip package. Not all date formats are available in both so if you are saved your filter to do automatic deletions or other tasks you should make sure that the date and time format you use is compatible with both methods. The safest type of format to use is ‘-3 day’ or similar with easily parseable numbers and units are in English.
ru: Все предыдущие элементы принимают очень гибкий свободный формат дат и времени, основанный на функции strtotime на PHP (https://www.php.net/manual/en/function.strtotime.php). Это позволяет вводить значения, такие как 'прошлая среда' и т. д. Мы рекомендуем ознакомиться с этой функцией, чтобы увидеть, какие допустимые форматы существуют. Однако автоматические фильтры выполняются на Perl, и поэтому они обрабатываются пакетом Date::Manip. Не все форматы даты доступны в обоих, поэтому, если вы сохраняете свой фильтр для выполнения автоматического удаления или других задач, убедитесь, что формат даты и времени, который вы используете, совместим с обоими методами. Безопаснее всего использовать формат типа '-3 дня' или аналогичный с легко читаемыми числами и единицами измерения на английском языке.

source: The other things you can filter on are all fairly self explanatory, except perhaps for 'Archived' which you can use to include or exclude Archived events. In general you'll probably do most filtering on un-archived events. There are also two elements, Disk Blocks and Disk Percent which don’t directly relate to the events themselves but to the disk partition on which the events are stored. These allow you to specify an amount of disk usage either in blocks or in percentage as returned by the ‘df’ command. They relate to the amount of disk space used and not the amount left free. Once your filter is specified, clicking 'submit' will filter the events according to your specification. As the disk based elements are not event related directly if you create a filter and include the term ‘DiskPercent > 95’ then if your current disk usage is over that amount when you submit the filter then all events will be listed whereas if it is less then none at all will. As such the disk related terms will tend to be used mostly for automatic filters (see below). If you have created a filter you want to keep, you can name it and save it by clicking 'Save'.
ru: Другие вещи, которые вы можете фильтровать, в основном понятны, за исключением, возможно, "Архивированный", который вы можете использовать для включения или исключения архивных событий. В общем, вы, вероятно, будете делать большинство фильтрации по неархивированным событиям. Также есть два элемента, Дисковые блоки и Дисковый процент, которые не прямо связаны с самими событиями, но с дисковым разделом, на котором хранятся события. Они позволяют указать количество дискового использования либо в блоках, либо в процентах, как возвращаемое командой "df". Они относятся к количеству дискового пространства, используемого, а не к количеству свободного места. После того, как вы установили фильтр, нажатие "отправить" отфильтрует события в соответствии с вашими требованиями. Поскольку дисковые элементы не являются напрямую связанными с событиями, если вы создадите фильтр и включите термин "DiskPercent > 95", то если текущее использование диска превышает это значение при отправке фильтра, все события будут отображаться, а если оно меньше, то ни одного не будет. Таким образом, термины, связанные с диском, будут в основном использоваться для автоматических фильтров (см. ниже). Если вы создали фильтр, который хотите сохранить, вы можете назвать его и сохранить, щелкнув "Сохранить".

source: If you do this then the subsequent dialog will also allow you specify whether you want this filter automatically applied in order to delete events or upload events via ftp to another server and mail notifications of events to one or more email accounts. Emails and messages (essentially small emails intended for mobile phones or pagers) have a format defined in the Options screen, and may include a variety of tokens that can be substituted for various details of the event that caused them. This includes links to the event view or the filter as well as the option of attaching images or videos to the email itself. Be aware that tokens that represent links may require you to log in to access the actual page, and sometimes may function differently when viewed outside of the general ZoneMinder context. The tokens you can use are as follows.
ru: Если вы сделаете это, то последующий диалог также позволит вам указать, хотите ли вы, чтобы этот фильтр автоматически применялся для удаления событий или загрузки событий через ftp на другой сервер и отправки уведомлений о событиях на один или несколько адресов электронной почты. Электронные письма и сообщения (фактически небольшие электронные письма, предназначенные для мобильных телефонов или пейджеров) имеют формат, определенный на экране опций, и могут включать в себя различные токены, которые можно заменить различными деталями события, которое вызвало их. Это включает в себя ссылки на просмотр события или фильтра, а также возможность прикрепления изображений или видео к самому электронному письму. Обратите внимание, что токены, представляющие ссылки, могут потребовать от вас входа в систему для доступа к реальной странице, и иногда они могут работать по-разному, когда их просматривают вне общего контекста ZoneMinder. Токены, которые вы можете использовать, следующие.

source: %EI% Id of the event
ru: %EI% - идентификатор события

source: %EID% Id of the event
ru: %EID% - идентификатор события

source: %EN% Name of the event
ru: %RU% Название мероприятия

source: %EC% Cause of the event
ru: %EC% Причина события

source: %ED% Event description
ru: %ED% - описание события

source: %ET% Time of the event
ru: %ET% Время события

source: %EL% Length of the event
ru: %EL% Длина события

source: %EF% Number of frames in the event
ru: %EF% Количество кадров в событии

source: %EFA% Number of alarm frames in the event
ru: %EFA% - Количество тревожных кадров в событии

source: %EST% Total score of the event
ru: %EST% Итоговый счет мероприятия

source: %ESA% Average score of the event
ru: %ESA% Средний балл мероприятия

source: %ESM% Maximum score of the event
ru: %ESM% Максимальный балл события

source: %EP% Path to the event
ru: %EP% Путь к событию

source: %EPS% Path to the event stream
ru: %EPS% - Путь к потоку событий

source: %EPF1% Path to the frame view for the first alarmed event image
ru: %EPF1% - Путь к видовому окну для первого изображения события тревоги

source: %EPFM% Path to the frame view for the (first) event image with the highest score
ru: %EPFM% - Путь к видовому окну для изображения первого события с наивысшим рейтингом

source: %EPFMOD% Path to image containing object detection, in frame view
ru: %EPFMOD% - Путь к изображению, содержащему объект обнаружения, в режиме просмотра кадра

source: %EPFMODG% Path to image containing object detection animated gif version, in frame view
ru: %EPFMODG% - Путь к изображению, содержащему анимированную версию объекта обнаружения, в режиме просмотра кадров

source: %EPI% Path to the event images
ru: %EPI% - Путь к изображениям событий

source: %EPI1% Path to the first alarmed event image, suitable for use in img tags
ru: %EPI1% - Путь к первому изображению события тревоги, подходящий для использования в тегах img

source: %EPIM% Path to the (first) event image with the highest score, suitable for use in img tags
ru: %EPIM% - Путь к (первому) изображению события с наивысшим рейтингом, подходящему для использования в тегах img

source: %EPIMOD% Path to image containing object detection, suitable for use in img tags
ru: %EPIMOD% Путь к изображению, содержащему объект обнаружения, подходящий для использования в тегах img

source: %EPIMODG% Path to image containing object detection animated gif version, suitable for use in img tags
ru: %EPIMODG% - Путь к изображению, содержащему анимированную версию объекта обнаружения, подходящую для использования в тегах img

source: %EPISNAP% Path to the snapshot image, which should be the frame with the most motion
ru: %EPISNAP% - путь к изображению снимка, который должен быть кадром с наибольшим движением

source: %EI1% Attach first alarmed event image
ru: %EI1% Прикрепите первое изображение события тревоги

source: %EI1A% Attach first alarmed event analysis image
ru: %EI1A% Прикрепите первый анализ изображения события тревоги

source: %EIM% Attach (first) event image with the highest score
ru: %EIM% Прикрепите (первый) событие изображение с самым высоким рейтингом

source: %EIMA% Attach (first) event analysis image with the highest score
ru: %EIMA% Прикрепите (первый) анализ события изображения с наивысшим рейтингом

source: %EIMOD% Attach image containing object detection
ru: %EIMOD% Прикрепите изображение, содержащее обнаружение объекта

source: %EIMODG% Attach image containing object detection animated gif version
ru: %EIMODG% Прикрепите изображение, содержащее анимированную версию объекта обнаружения

source: %EISNAP% Attach the snapshot image, which should be the frame with the most motion
ru: %EISNAP% Прикрепите изображение снимка экрана, которое должно быть кадром с наибольшим движением

source: %EV% Attach event mpeg video
ru: %EV% - Прикрепите видео в формате MPEG

source: %EVM% Attach event mpeg video in phone format
ru: %EVM% Прикрепите видео в формате mpeg-видео к телефону

source: %MID% Monitor Id
ru: %MID% Монитор Id

source: %MN% Name of the monitor
ru: %MN% Название монитора

source: %MET% Total number of events for the monitor
ru: %MET% Общее количество событий для монитора

source: %MEH% Number of events for the monitor in the last hour
ru: %MEH% - Количество событий для монитора за последнюю час

source: %MED% Number of events for the monitor in the last day
ru: %MED% Количество событий для монитора за последний день

source: %MEW% Number of events for the monitor in the last week
ru: %MEW% - Количество событий для монитора за последнюю неделю

source: %MEM% Number of events for the monitor in the last month
ru: %MEM% Количество событий для монитора за последний месяц

source: %MEA% Number of archived events for the monitor
ru: %MEA% Количество архивных событий для монитора

source: %MP% Path to the monitor window
ru: %MP% - Путь к окну монитора

source: %MPS% Path to the monitor stream
ru: %MPS% - Путь к потоку монитора

source: %MPI% Path to the monitor recent image
ru: %MPI% - Путь к изображению недавнего мониторинга

source: %FID% Id of the current filter that matched
ru: %FID% - идентификатор текущего фильтра, который соответствует

source: %FN% Name of the current filter that matched
ru: %FN% Имя текущего фильтра, который совпал

source: %FP% Path to the current filter that matched
ru: %FP% - путь к текущему фильтру, который совпал

source: %ZP% Path to your ZoneMinder console
ru: %ZP% - Путь к вашей консоли ZoneMinder

source: Finally you can also specify a script which is run on each matched event. This script should be readable and executable by your web server user. It will get run once per event and the relative path to the directory containing the event in question. Normally this will be of the form <MonitorName>/<EventId> so from this path you can derive both the monitor name and event id and perform any action you wish. Note that arbitrary commands are not allowed to be specified in the filter, for security the only thing it may contain is the full path to an executable. What that contains is entirely up to you however.
ru: Наконец вы также можете указать скрипт, который выполняется при каждом совпадении события. Этот скрипт должен быть читаемым и исполняемым пользователем вашего веб-сервера. Он будет выполняться один раз на каждое событие, и относительный путь к директории, содержащей событие, о котором идет речь. Обычно это будет иметь форму "<Имя монитора>/<Идентификатор события>", поэтому из этого пути вы можете извлечь как имя монитора, так и идентификатор события и выполнить любое действие, которое вы пожелаете. Обратите внимание, что произвольные команды не разрешены в фильтре, для безопасности в нем может находиться только полный путь к исполняемому файлу. Что именно находится внутри, полностью зависит от вас.
