Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/gettingstarted.po
Languages: ru

source: Getting Started
ru: Начало работы

source: The intent of this section is to provide a simplified introduction to some of the basic configuration tasks that most ZoneMinder servers will require. This will include setting your Timezone, enabling Authentication, adding a Monitor (camera), adding a Zone and changing the web display Theme. Detailed explanations about each particular item can be found in their respective sections of the ZoneMinder documentation.
ru: Цель этого раздела - предоставить упрощенное введение в некоторые основные задачи конфигурации, которые большинство серверов ZoneMinder потребует. Это будет включать настройку вашего часового пояса, включение аутентификации, добавление монитора (камеры), добавление зоны и изменение темы веб-вывода. Подробные объяснения по каждому конкретному вопросу можно найти в соответствующих разделах документации ZoneMinder.

source: Having followed the :doc:`/installationguide/index` for your distribution you should now be able to load the ZoneMinder web interface which can be found at ``http://hostname-or-ip/zm``. The image below shows an example of the ZoneMinder Console which is displayed after starting. The ZoneMinder Console is the central location from which all ZoneMinder configuration and functionality can be accessed.
ru: После того как вы выполнили инструкцию по установке :doc:`/installationguide/index` для вашей версии, вы должны теперь быть в состоянии загрузить веб-интерфейс ZoneMinder, который можно найти по адресу ``http://hostname-or-ip/zm``. Изображение ниже показывает пример консоли ZoneMinder, которая отображается после запуска. Консоль ZoneMinder - это центральное место, откуда можно получить доступ ко всем настройкам и функциональности ZoneMinder.

source: ZoneMinder Console
ru: ЗонаМиндер Консоль

source: Please note that in this guide the notation of :guilabel:`Link` means that you click on the specified link on the web interface to perform the specified action.
ru: Обратите внимание, что в этом руководстве обозначение `:guilabel:`Link` означает, что вы нажимаете на указанную ссылку на веб-интерфейсе для выполнения указанного действия.

source: Setting Timezone
ru: Установка часового пояса

source: ZoneMinder allows you to specify the Timezone in the web interface. Please set up before moving forward so that your saved events, logfiles and timestamp overlays contain correct time information. The Timezone can be changed using the following steps.
ru: ЗонаМиндер позволяет вам указать часовой пояс в веб-интерфейсе. Пожалуйста, настройте его перед продолжением, чтобы ваши сохраненные события, журналы и временные метки содержали правильную информацию о времени. Часовой пояс можно изменить, выполнив следующие шаги.

source: At the top of Console display click on the :guilabel:`Options` menu link.
ru: В верхней части дисплея консоли щелкните по ссылке меню :guilabel:`Options`.

source: The Options window opens. Locate and click the :guilabel:`System` tab link.
ru: Окно "Параметры" открывается. Найдите и щелкните по ссылке "Система" вкладки "Гипертекст".

source: Locate the **TIMEZONE** parameter and use the pulldown menu to locate your Timezone.
ru: Найдите параметр **TIMEZONE** и используйте выпадающее меню, чтобы найти свой часовой пояс.

source: Enabling Authentication
ru: Включение аутентификации

source: We strongly recommend enabling authentication during initial setup of ZoneMinder. There are some situations where certain users don't enable authentication, such as instances where the server is in a LAN not directly exposed to the Internet. In most cases authentication should be enabled. Follow the steps below.
ru: Мы настоятельно рекомендуем включить аутентификацию при первоначальной настройке ZoneMinder. Есть некоторые ситуации, когда определенные пользователи не включают аутентификацию, например, случаи, когда сервер находится в локальной сети, которая не непосредственно подвержена интернету. В большинстве случаев аутентификация должна быть включена. Следуйте шагам ниже.

source: Click on the :guilabel:`Options` link in the top bar of the web interface.
ru: Нажмите на ссылку :guilabel:`Options` в верхней панели веб-интерфейса.

source: You will now be presented with a sidebar full of Option tabs. Click on the :guilabel:`System` tab and scroll down to the section containing authentication parameters.
ru: Сейчас вы увидите боковую панель с вкладками опций. Нажмите на вкладку :guilabel:`Система` и прокрутите вниз до раздела, содержащего параметры аутентификации.

source: Authentication Parameters in System Tab
ru: Параметры аутентификации в системной вкладке

source: **OPT_USE_AUTH:** Enable by checking the box. This enables user authentication.
ru: **OPT_USE_AUTH:** Включить, отметив галочкой. Это включает аутентификацию пользователя.

source: **AUTH_HASH_SECRET:** Enter a random string. This makes authentication logic more secure.
ru: **SECRET_HASH_AUTH:** Введите случайную строку. Это делает логику аутентификации более безопасной.

source: Remaining items should be left as default.
ru: Оставшиеся элементы должны оставаться по умолчанию.

source: Click on :guilabel:`Save` at the top of list and that's it! The next time you refresh that page, you will now be presented with a login screen as shown below. Job well done!
ru: Нажмите на :guilabel:`Сохранить` в верхней части списка, и все готово! В следующий раз, когда вы обновите эту страницу, вы увидите экран входа, как показано ниже. Отличная работа!

source: Note
ru: Заметка

source: For initial login authentication the default username is **admin** and default password is **admin**.
ru: Для первоначальной аутентификации по умолчанию имя пользователя - **admin**, а пароль - **admin**.

source: Establish Login Password
ru: Установить пароль для входа

source: ZoneMinder defines a default user with username of **admin** and password of **admin**. Use these credentials to login to ZoneMinder for the first time. This is not very secure for a server so let's change this before continuing setting up ZoneMinder. The password for the admin user can be changed by following the steps below.
ru: ЗонаМиндер определяет пользователя по умолчанию с именем пользователя **admin** и паролем **admin**. Используйте эти учетные данные для входа в ЗонаМиндер в первый раз. Это не очень безопасно для сервера, поэтому давайте изменим это перед продолжением настройки ЗонаМиндера. Пароль для пользователя администратора можно изменить, выполнив следующие шаги.

source: Locate and click on the :guilabel:`Users` tab link.
ru: Найдите и щелкните по ссылке на вкладку :guilabel:`Пользователи`.

source: Select and click on user :guilabel:`admin` to open the edit window.
ru: Выберите и щелкните по пользователю :guilabel:`admin`, чтобы открыть окно редактирования.

source: Changing Password in Users Tab
ru: Изменение пароля в разделе "Пользователи"

source: Enter new password in :guilabel:`New Password` and :guilabel:`Confirm Password` boxes.
ru: Введите новый пароль в поле :guilabel:`Новый пароль` и поле :guilabel:`Подтверждение пароля`.

source: Click :guilabel:`Save` to update password.
ru: Нажмите :guilabel:`Сохранить`, чтобы обновить пароль.

source: Additional users can be created with flexible levels of access. Refer to :doc:`/userguide/options/options_users`.
ru: Дополнительные пользователи могут быть созданы с гибкими уровнями доступа. Обратитесь к :doc:`/userguide/options/options_users`.

source: Understanding the Web Console
ru: Понимание консоли браузера

source: Before we proceed, let's spend a few minutes understanding the key functions of the web Console. At any time you can return to the Console by clicking the :guilabel:`Console` link. For the sake of illustration, we are going to use an existing ZoneMinder server already configured with several Monitors and showing recorded events.
ru: Перед тем как продолжить, давайте потратим несколько минут на понимание основных функций консоли веб-страницы. В любое время вы можете вернуться к консоли, щелкнув по ссылке :guilabel:`Console`. Для иллюстрации мы будем использовать существующий сервер ZoneMinder, уже настроенный с несколькими мониторами и отображающий записанные события.

source: ZoneMinder Console for Existing Configured Server
ru: Консоль ZoneMinder для существующего сервера с конфигурацией

source: This is the Console window in ZoneMinder and shows a summary of your Monitors, associated events, Zones, server status and links to other available functionality. A brief description of many of these items is given below. Each section has a much more detailed description contained in the ZoneMinder documentation.
ru: Это окно консоли в ZoneMinder и отображает сводку ваших мониторов, связанных событий, зон, состояния сервера и ссылки на другую доступную функциональность. Краткое описание многих из этих элементов приведено ниже. Каждая секция имеет гораздо более подробное описание, содержащееся в документации ZoneMinder.

source: [A] Options
ru: [A] Варианты

source: The Options menu lets you configure many aspects of ZoneMinder. Refer to :doc:`options`.
ru: Меню "Опции" позволяет настроить многие аспекты ZoneMinder. Обратитесь к :doc:`options`.

source: [B] Log
ru: [B] Лог

source: This brings up a color coded log window that shows various system and component level logs. This window is useful if you are trying to diagnose issues. Refer to :doc:`logging`.
ru: Это вызывает появление цветного окна журнала, которое отображает различные системные и компонентые журналы. Это окно полезно, если вы пытаетесь диагностировать проблемы. Обратитесь к :doc:`logging`.

source: [C] Groups
ru: [C] Группы

source: ZoneMinder allows you to group Monitors for logical separation. This option lets you create new groups, associate Monitors to them and edit/delete existing groups.
ru: ЗонаМиндер позволяет группировать Мониторы для логического разделения. Эта опция позволяет создавать новые группы, ассоциировать Мониторы с ними и редактировать/удалять существующие группы.

source: [D] Filters
ru: [D] Фильтры

source: Filters are a powerful mechanism to perform actions when certain conditions are met. ZoneMinder comes with some preset filters that keep a tab of disk space and others. Many users create their own filters for more advanced actions like sending emails when certain events occur and more. Refer to :doc:`filterevents`.
ru: Фильтры - это мощный механизм для выполнения действий при соблюдении определенных условий. ZoneMinder поставляется с некоторыми предустановленными фильтрами, которые отслеживают использование дискового пространства и другие параметры. Многие пользователи создают свои собственные фильтры для более сложных действий, таких как отправка электронных писем при возникновении определенных событий и многое другое. Обратитесь к :doc:`filterevents`.

source: [E] Cycle
ru: [C] Круг

source: The Cycle option allows you to rotate between live views of each configured Monitor.
ru: Опция "Цикл" позволяет переключаться между живыми просмотрами каждого настроенного Монитора.

source: [F] Montage
ru: [F] Монтаж

source: The Montage option shows a collage of your Monitors. You can customize the placement size and location on the web interface.
ru: Опция "Коллаж" отображает коллаж из ваших мониторов. Вы можете настроить размер и расположение на веб-интерфейсе.

source: [G] Montage Review
ru: [G] Обзор сборки

source: Allows you to simultaneously view past events for different Monitors. Note that this is a very resource intensive page and its performance will vary based on your system capabilities.
ru: Позволяет одновременно просматривать прошлые события для разных мониторов. Обратите внимание, что это очень ресурсоемкая страница, и ее производительность будет зависеть от возможностей вашей системы.

source: [H] Audit Events Report
ru: [H] Отчет о событиях аудита

source: This is more of a power user feature. This option looks for recording gaps in events and recording issues in mp4 files.
ru: Это больше функция для продвинутых пользователей. Эта опция ищет пропуски в записях событий и проблемы с записью в файлах mp4.

source: [I] Current User
ru: [I] Текущий пользователь

source: This shows the currently logged in user.
ru: Это показывает текущего пользователя, вошедшего в систему.

source: [J] Run State
ru: [J] Состояние выполнения

source: ZoneMinder allows you to maintain 'Run States'. A Run State is essentially a snapshot that records the state of each Monitor and you can switch between states easily. For example, you might have a Run State defined that switches all monitors the 'None' Record mode while another state that sets some of the monitors to the 'On Motion' Record mode. Why would you want this? A great example is to disable recording when you are at home and enable when you are away, based on time of day or other triggers. You can switch states by selecting an appropriate state manually, or do it automatically via cron jobs, for example. An example of using a cron job to automatically switch is provided in the :ref:`FAQ <runstate_cron_example>`. If you click on the :guilabel:`RUNNING` link, ZoneMinder displays a popup that allows you to select or define additional Run States. ZoneMinder provides a few pre-defined Run States and you can also add your own Run States here.
ru: Зонеминдер позволяет вам поддерживать "Состояния работы". Состояние работы - это по сути снимок, который записывает состояние каждого монитора, и вы можете легко переключаться между состояниями. Например, у вас может быть определено состояние работы, которое переключает все мониторы в режим записи "Ничего", в то время как другое состояние устанавливает некоторые из мониторов в режим записи "При движении". Почему бы вам этого хотелось? Великолепным примером является отключение записи, когда вы находитесь дома, и включение, когда вы отсутствуете, в зависимости от времени суток или других триггеров. Вы можете переключать состояния, выбирая соответствующее состояние вручную, или делать это автоматически с помощью задач cron, например. Примером использования задачи cron для автоматического переключения является пример, приведенный в :ref:`FAQ <runstate_cron_example>`. Если вы нажмете на ссылку :guilabel:`ВЫПОЛНЯЕТСЯ`, ZoneMinder отобразит всплывающее окно, позволяющее выбрать или определить дополнительные состояния работы. ZoneMinder предоставляет несколько предварительно определенных состояний работы, и вы также можете добавить свои собственные состояния здесь.

source: Run States
ru: Состояния выполнения

source: ZoneMinder Run States window allows selection of pre-defined Run States or entry of new Run States. ZoneMinder comes with pre-defined Run States of default, Stop and Restart.
ru: Окно "Состояния работы ZoneMinder" позволяет выбрать заранее определенные состояния работы или ввод новых состояний работы. В ZoneMinder предусмотрены предварительно определенные состояния работы по умолчанию, остановка и перезапуск.

source: [K] System Info
ru: [K] Система Информации

source: This section shows information about the ZoneMinder server hardware.
ru: Этот раздел показывает информацию о серверном оборудовании ZoneMinder.

source: [L] Function
ru: [L] Функция

source: This shows how ZoneMinder deals with Monitor stream capture, analysis and recording. The current state of each Monitor capture, analysis and recording settings is summarized here.
ru: Это показывает, как ZoneMinder обрабатывает потоковую запись монитора, анализ и запись. Состояние каждого текущего захвата монитора, анализа и записи здесь суммируется.

source: [M] Source
ru: [M] Источник

source: This is the Source column that tells you the type of the camera - if its an IP camera, a USB camera or more. In this example, they are all IP cameras. Green means the monitor is running. Red means there is something wrong with that camera.
ru: Это столбец "Источник", который сообщает вам о типе камеры - если это IP-камера, USB-камера или что-то еще. В этом примере они все IP-камеры. Зеленый цвет означает, что монитор работает. Красный цвет означает, что с этой камерой что-то не так.

source: [N] Events
ru: [N] События

source: This is the core of ZoneMinder - recording events. It gives you a count of how many events were recorded over the hour, day, week, month.
ru: Это ядро ZoneMinder - запись событий. Он дает вам подсчет того, сколько событий было записано за час, день, неделю, месяц.

source: [O] Zones
ru: [O] Зоны

source: This indicates number of Zones defined. Click in this link to define Zones for your monitor. Zones are areas within the camera that you mark as 'hotspots' for motion detection. Simply put, when you first configure your Monitors (cameras), by default ZoneMinder uses the entire field of view of the camera to detect motion. You may not want this. You may want to create Zones specifically for detecting motion and ignore others. For example, lets consider a room with a fan that spins. You surely don't want to consider the fan moving continuously a reason for triggering a record? Probably not - in that case, you'd leave the fan out while making your zones. Refer to :doc:`definezone`.
ru: Это указывает количество зон, определенных. Нажмите на эту ссылку, чтобы определить зоны для вашего монитора. Зоны - это области в камере, которые вы отмечаете как "горячие точки" для обнаружения движения. Просто говоря, когда вы впервые настраиваете свои мониторы (камеры), по умолчанию ZoneMinder использует весь обзор камеры для обнаружения движения. Возможно, вы не хотите этого. Возможно, вы хотите создать зоны специально для обнаружения движения и игнорировать другие. Например, давайте рассмотрим комнату с вентилятором, который вращается. Конечно, вы не хотите, чтобы постоянное вращение вентилятора было причиной запуска записи? Вероятно, нет - в этом случае вы оставите вентилятор вне зоны определения. Обратитесь к :doc:`definezone`.

source: [P] Console Filter
ru: [P] Консольный фильтр

source: This is a visual filter which lets you filter the console display based on text you enter. While this may not be particularly useful for small systems, ZoneMinder is also used in larger installations with well over 200+ cameras and this visual filter helps reduce the monitors you are viewing at one time.
ru: Это визуальный фильтр, который позволяет фильтровать отображение консоли на основе текста, который вы вводите. Хотя это может быть не особенно полезно для небольших систем, ZoneMinder также используется в крупных установках с более чем 200+ камерами, и этот визуальный фильтр помогает уменьшить количество мониторов, которые вы просматриваете одновременно.

source: Adding Monitors
ru: Добавление мониторов

source: Now that we have a basic understanding of the Console web interface, lets go about adding a new Monitor. In ZoneMinder the source of a video stream is called a Monitor and this can come from many types of sources, most commonly from an IP camera.
ru: Теперь, когда у нас есть базовое понимание веб-интерфейса консоли, давайте перейдем к добавлению нового Монитора. В ZoneMinder источник видеопотока называется Монитором, и он может поступать из многих типов источников, чаще всего из IP-камеры.

source: This is meant to be a simple example. For a more detailed explanation of other options available when creating a monitor, please see :doc:`/userguide/definemonitor`
ru: Это должно быть простым примером. Для более подробного объяснения других опций, доступных при создании монитора, см. :doc:`/userguide/definemonitor`

source: Prior to adding Monitors in ZoneMinder you will need the following information at minimum: URL to access the video stream, authentication user/password, IP address, video resolution in pixels, frames per second (FPS) and the video stream protocol.
ru: Перед добавлением мониторов в ZoneMinder вам потребуется следующая информация как минимум: URL для доступа к потоку видео, учетные данные для аутентификации пользователя/пароль, IP-адрес, разрешение видео в пикселях, количество кадров в секунду (FPS) и протокол потокового видео.

source: The generic camera we are using as an example here has the following characteristics: URL of ``rtsp://username:password@ipaddress:port/videoMain``, resolution of 1280x960 pixels, 5 frames per second (FPS), RTSP protocol using TCP and an h.264 encoded stream. The specific information for your cameras will be different, of course.
ru: Камера, которую мы используем в качестве примера здесь, обладает следующими характеристиками: URL "rtsp://имя пользователя:пароль@ip-адрес:порт/видеоMain", разрешение 1280x960 пикселей, 5 кадров в секунду (FPS), протокол RTSP, использующий TCP, и поток, закодированный в формате h.264. Конечно, информация для ваших камер будет отличаться.

source: Determining camera characteristics is one of the challenging aspects of ZoneMinder configuration. There are several ways to find camera information. The primary way would be the camera user manual or manufacturer product support website. The ZoneMinder community also has a frequently updated list `here <https://wiki.zoneminder.com/index.php/Hardware_Compatibility_List>`__ that lists information about many cameras. If you don't find your camera there and can't seem to find it elsewhere, feel free to register and ask in the `user forums <https://forums.zoneminder.com/>`__.
ru: Определение характеристик камеры является одной из сложных задач конфигурации ZoneMinder. Существует несколько способов найти информацию о камере. Основным способом будет руководство пользователя камеры или веб-сайт поддержки продукта производителя. Сообщество ZoneMinder также имеет часто обновляемый список `здесь <https://wiki.zoneminder.com/index.php/Hardware_Compatibility_List>`__ , который содержит информацию о многих камерах. Если вы не найдете свою камеру там и не сможете найти ее где-либо еще, не стесняйтесь зарегистрироваться и задать вопрос в `форумах пользователей <https://forums.zoneminder.com/>`__.

source: Click on the :guilabel:`+ADD` button in Console window as shown below:
ru: Нажмите на кнопку :guilabel:`+ADD` в окне консоли, как показано ниже:

source: This brings up an empty Monitor entry window starting on the General tab:
ru: Это вызывает пустое окно элемента "Монитор", начинающееся на вкладке "Общие":

source: Configuring Monitor - General Tab
ru: Настройка Монитора - Общие Таблицы

source: **Name**: Anything can be entered here but a description of location or area is generally useful. This camera is located in a garage so let's call this 'Garage'.
ru: **Имя**: Здесь можно ввести все что угодно, но описание местоположения или области обычно полезно. Эта камера расположена в гараже, поэтому давайте назовем это 'Гараж'.

source: **Source Type:** FFmpeg is the recommended source type for most modern IP cameras and also the default value in ZoneMinder. For this example, FFmpeg is the appropriate choice. There are many choices for Source Type in ZoneMinder. For a detailed description of them please see :doc:`definemonitor`.
ru: **Source Type:** FFmpeg рекомендуется для большинства современных IP-камер и является по умолчанию в ZoneMinder. Для этого примера FFmpeg является подходящим выбором. Существует множество вариантов выбора типа источника в ZoneMinder. Подробное описание их можно найти в :doc:`definemonitor`.

source: We are done with the General tab. Move to the next tab by clicking on :guilabel:`Source`.
ru: Мы закончили с вкладкой "Общие". Перейдите к следующей вкладке, щелкнув по :guilabel:`Источник`.

source: Configuring Monitor - Source Tab
ru: Настройка Монитора - Таблица Источника
