Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/gettingstarted.po
Languages: ru

source: **Source Path**: Enter the URL for the camera stream you identified earlier. Note that if your URL contains camera authentication these may be automatically populated into the Username and Password fields.
ru: **Путь к источнику**: Введите URL для потокового видео камеры, который вы определили ранее. Обратите внимание, что если ваш URL содержит аутентификацию камеры, эти данные могут автоматически заполняться в полях Имя пользователя и Пароль.

source: **Capture Resolution:** Enter the resolution of the camera stream you are using. This example uses 1280x960 pixel resolution. The pulldown menu for this contains many commonly used camera resolutions or you can enter the horizontal and vertical resolution manually.
ru: **Разрешение захвата:** Введите разрешение потока камеры, который вы используете. Этот пример использует разрешение 1280x960 пикселей. Меню со списком содержит многие распространенные разрешения камер или вы можете ввести горизонтальное и вертикальное разрешение вручную.

source: Other options can be left as the default settings.
ru: Другие варианты можно оставить в качестве стандартных настроек.

source: We are done with the Source tab. Move to the next tab by clicking on :guilabel:`Recording` tab link.
ru: Мы закончили с вкладкой "Источник". Перейдите к следующей вкладке, щелкнув по ссылке на вкладку "Запись":

source: Configuring Monitor - Recording Tab
ru: Настройка Монитора - Записьная Таблица

source: **Recording:** For this example we want to only record events when motion is detected. Select :guilabel:`On Motion / Trigger / etc` from the dropdown menu.
ru: **Запись:** Для этого примера мы хотим записывать только события, когда обнаруживается движение. Выберите :guilabel:`On Motion / Trigger / etc` из выпадающего меню.

source: **Storage Area:** Select :guilabel:`Default`.
ru: **Секция хранения:** Выберите :guilabel:`По умолчанию`.

source: This completes a very simplified Monitor setup. Click on :guilabel:`Save`. As one can see there are a substantial number of configuration options available. Some additional configuration parameters beyond this simple Getting Started may be needed for your specific camera and hardware setup. Many of these options are discussed in detail later in the Documentation.
ru: Это завершает очень упрощенную настройку монитора. Нажмите на :guilabel:`Сохранить`. Как можно видеть, доступно значительное количество настроек конфигурации. Некоторые дополнительные параметры конфигурации, выходящие за рамки этого простого начала, могут потребоваться для вашей конкретной камеры и аппаратного обеспечения. Многие из этих параметров обсуждаются более подробно позже в документации.

source: You now have a configured monitor as seen below in the Console. To see if everything works, click on the :guilabel:`Garage` monitor you just added and you should be able to see the live feed. If you don't, inspect your ZoneMinder logs to debug.
ru: Теперь у вас есть настроенный монитор, как показано ниже в консоли. Чтобы увидеть, все ли работает, щелкните по монитору :guilabel:`Гараж`, который вы только что добавили, и вы должны увидеть прямую трансляцию. Если нет, проверьте журналы ZoneMinder для отладки.

source: Console with Configured Monitor
ru: Консоль с настроенным монитором

source: Adding Zones
ru: Добавление зон

source: After adding a Monitor the next step is to define Zones which will be used for image analysis. By default each added Monitor has one zone defined which covers the full area captured by the camera. In most cases this is not very useful, especially if you intend to capture specific events such as a door opening or an object entering a specific area. Let's define a new Zone appropriate for this Monitor. This new Zone will help to reduce the number of events captured and space required on your storage system.
ru: После добавления Монитора следующим шагом является определение Зон, которые будут использоваться для анализа изображений. По умолчанию каждый добавленный Монитор имеет одну зону, которая покрывает всю область, захваченную камерой. В большинстве случаев это не очень полезно, особенно если вы хотите захватить конкретные события, такие как открытие двери или вход объекта в определенную область. Давайте определим новую Зону, подходящую для этого Монитора. Эта новая Зона поможет уменьшить количество событий, захваченных и пространство, необходимое на вашей системе хранения.

source: Referring to the Console image above, click on the :guilabel:`1` on the right side of the Garage Monitor row. This brings up the Zones window for the Garage Monitor shown below.
ru: Обращаясь к изображению консоли выше, щелкните по метке :guilabel:`1` справа от строки Garage Monitor. Это открывает окно Зон для Garage Monitor, показанное ниже.

source: Configuring Zones - Zone List
ru: Настройка зон - список зон

source: Click on :guilabel:`+ADD NEW ZONE` to define a new Zone for this Monitor.
ru: Нажмите на :guilabel:`+ADD NEW ZONE`, чтобы определить новую зону для этого монитора.

source: Configuring Zones - Defining Zone Analysis and Zone Area
ru: Настройка зон - Определение анализа зоны и зоны области

source: **Name:** Enter a descriptive name for this specific Zone. In this example we want to limit the analysis to the driveway so let's use that as its name. Having well defined Zone names can be helpful when filtering events or reviewing logfiles.
ru: **Имя:** Введите описательное имя для этой конкретной Зоны. В этом примере мы хотим ограничить анализ дорожкой, поэтому давайте используем это как ее имя. Хорошо определенные имена зон могут быть полезны при фильтрации событий или просмотре лог-файлов.

source: **Preset:** For new users of ZoneMinder it is best to start with the available Presets and make changes from there. Zone definition and proper setting of the available parameters to optimize each unique camera stream takes some time to learn. From the Preset pulldown menu, select :guilabel:`Best, High Sensitivity` for this Zone example.
ru: **Пресет:** Для новых пользователей ZoneMinder лучше всего начать с доступных пресетов и внести изменения оттуда. Определение зоны и правильная настройка доступных параметров для оптимизации каждого уникального потокового видео требует некоторого времени для изучения. Из выпадающего меню "Пресет" выберите: `Лучший, Высокая чувствительность` для этого примера зоны.

source: **Points:** You can either drag the corner vertex points as required or enter the X and Y coordinates directly in the table. Additional points can be added by clicking the :guilabel:`+` on any existing point.
ru: **Пояснения:** Вы можете либо перемещать угловые вершины точек по мере необходимости, либо вводить координаты X и Y непосредственно в таблицу. Дополнительные точки можно добавить, щелкнув на любую существующую точку на кнопке :guilabel:`+`.

source: Click :guilabel:`Save` to complete the definition for the Driveway Zone.
ru: Нажмите :guilabel:`Сохранить`, чтобы завершить определение зоны подъездной дороги.

source: Configuring Zones - Deleting the Default All Zone
ru: Настройка зон - удаление основной зоны по умолчанию

source: Delete the initial default 'All' Zone by selecting the :guilabel:`Mark` checkbox in the 'All' Zone row. Click :guilabel:`Delete` to remove the Zone.
ru: Удалите начальную зону по умолчанию "Все" путем установки флажка :guilabel:`Mark` в строке "Все" зоны. Нажмите :guilabel:`Delete`, чтобы удалить зону.

source: Congratulations! You have now defined a Monitor and appropriate Zone for a typical use case.
ru: Поздравляю! Теперь вы определили Монитор и соответствующую Зону для типичного случая использования.

source: A Fully Configured Zone
ru: Полностью настроенная зона

source: Selecting Themes
ru: Выбор тем

source: When you first install ZoneMinder, the web interface uses what is called the Base theme. It is worthwhile to note that ZoneMinder has Base, Classic and Dark themes available. These themes are controlled by the Skin and CSS settings found in the Options menu.
ru: Когда вы впервые устанавливаете ZoneMinder, веб-интерфейс использует так называемую тему База. Стоит отметить, что ZoneMinder имеет темы База, Классическая и Темная. Эти темы контролируются настройками Шкурки и CSS, которые находятся в меню Настройки.

source: Click on the :guilabel:`Options` link on the top of the web interface Console.
ru: Нажмите на ссылку :guilabel:`Options` в верхней части веб-интерфейса Консоль.

source: This will bring you to the Options window as shown below. Click on the :guilabel:`System` tab to access the available CSS themes. Changes applied here will remain after you end the session. Note that the theme for the current session will not change, see the next steps to change the theme immediately for the current session.
ru: Это приведет вас к окну "Параметры", как показано ниже. Нажмите на вкладку :guilabel:`Система`, чтобы получить доступ к доступным темам CSS. Изменения, внесенные здесь, останутся после окончания сеанса. Обратите внимание, что тема для текущей сессии не изменится, см. следующие шаги для изменения темы немедленно для текущей сессии.

source: Click :guilabel:`Save` at the bottom if you decide to change the default theme.
ru: Нажмите :guilabel:`Сохранить` в нижней части, если вы решите изменить тему по умолчанию.

source: Now, switch to the :guilabel:`Display` tab. Changes applied here will only remain until you end the current session. This allows you to try out the different CSS themes available.
ru: Теперь переключитесь на вкладку :guilabel:`Отображение`. Изменения, внесенные здесь, останутся в силе только до конца текущей сессии. Это позволяет вам опробовать различные доступные темы CSS.

source: Click :guilabel:`Save` at the bottom if you decide to change the session theme.
ru: Нажмите :guilabel:`Сохранить` в нижней части, если вы решите изменить тему сеанса.

source: Example of Base Theme Console
ru: Пример темы базового консольного интерфейса

source: Example of Dark Theme Console
ru: Пример темной темы консоли

source: Example of Classic Theme Console
ru: Пример классической консольной темы

source: Conclusion
ru: Заключение

source: This was a quick Getting Started guide where you were introduced to the very basics of how to set your Timezone, setup Authentication, add a Monitor (camera), define a Zone and change the ZoneMinder display Theme. We've skipped many details to keep this concise. Please refer to :doc:`options` for details about setting the various Options, :doc:`definemonitor` for details about setting up Monitors and finally :doc:`definezone` for details about setting up Zones.
ru: Это был быстрый путеводитель по началу работы, где вы были представлены самым основам того, как установить свой часовой пояс, настроить аутентификацию, добавить монитор (камеру), определить зону и изменить тему ZoneMinder. Мы пропустили многие детали, чтобы сделать это кратким. Пожалуйста, обратитесь к :doc:`options` для получения подробной информации о настройке различных опций, :doc:`definemonitor` для получения подробной информации о настройке мониторов и наконец :doc:`definezone` для получения подробной информации о настройке зон.
