Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/logging.po
Languages: ru

source: Logging
ru: Логирование

source: Understanding how logging works in ZoneMinder is key to being able to isolate/pinpoint issues well. Please refer to :doc:`/userguide/options/options_logging` to read about how to customize logging.
ru: Понимание того, как работает логирование в ZoneMinder, является ключом к возможности хорошо изолировать/определить проблемы. Пожалуйста, обратитесь к :doc:`/userguide/options/options_logging`, чтобы узнать, как настроить логирование.

source: Most components of ZoneMinder can emit informational, warning, error and debug messages in a standard format. These messages can be logged in one or more locations. By default all messages produced by scripts are logged in <script name>.log files which are placed in the directory defined by the ``ZM_PATH_LOGS`` configuration variable. This is initially defined as ``/var/log/zm`` (on debian based systems) though it can be overridden to a custom path (the path is usually defined in ``/etc/zm/conf.d/01-system-paths.conf``, but to override it, you should create your own config file, not overwrite this file). So for example, the ``zmdc.pl`` script will output messages to ``/var/log/zmdc.log``, an example of these messages is::
ru: Большинство компонентов ZoneMinder могут генерировать информационные, предупреждающие, ошибки и сообщения отладки в стандартном формате. Эти сообщения могут быть записаны в одном или нескольких местах. По умолчанию все сообщения, генерируемые скриптами, записываются в файлы `.log`, которые находятся в каталоге, определенном переменной конфигурации `ZM_PATH_LOGS`. Это по умолчанию определено как `/var/log/zm` (на системах, основанных на Debian), хотя его можно переопределить на путь по умолчанию (путь обычно определяется в `/etc/zm/conf.d/01-system-paths.conf`, но для его переопределения вам следует создать свой собственный конфигурационный файл, а не перезаписывать этот файл). Например, скрипт `zmdc.pl` будет выводить сообщения в файл `/var/log/zmdc.log`, пример этих сообщений выглядит так::

source: where the first part refers to the date and time of the entry, the next section is the name (or an abbreviated version) of the script, followed by the process id in square brackets, a severity code (INF, WAR, ERR or DBG) and the debug text. If you change the location of the log directory, ensure it refers to an existing directory which the web user has permissions to write to. Also ensure that no logs are present in that directory the web user does not have permission to open. This can happen if you run commands or scripts as the root user for testing at some point. If this occurs then subsequent non-privileged runs will fails due to being unable to open the log files.
ru: В первой части указывается дата и время записи, следующая секция - это имя (или сокращенная версия) сценария, за которым следует процесс ID в квадратных скобках, код серьезности (INF, WAR, ERR или DBG) и текст отладки. Если вы измените расположение каталога журнала, убедитесь, что он ссылается на существующий каталог, к которому веб-пользователь имеет разрешения на запись. Также убедитесь, что в этом каталоге нет журналов, к которым веб-пользователь не имеет разрешения на открытие. Это может произойти, если вы когда-либо запускали команды или скрипты как пользователь root для тестирования. Если это произойдет, последующие неисключительные выполнения будут неудачными из-за невозможности открыть файлы журналов.

source: As well as specific script logging above, information, warning and error messages are logged via the system syslog service. This is a standard component on Linux systems and allows logging of all sorts of messages in a standard way and using a standard format. On most systems, unless otherwise configured, messages produced by ZoneMinder will go to the ``/var/log/messages`` or ``/var/log/syslog`` file. On some distributions they may end up in another file, but usually still in /var/log. Messages in this file are similar to those in the script log files but differ slightly. For example the above event in the system log file looks like::
ru: Кроме специфического логирования скриптов, информация, предупреждения и сообщения об ошибках записываются через систему системного журнала. Это стандартный компонент в системах Linux и позволяет записывать все виды сообщений в стандартном виде и с использованием стандартного формата. На большинстве систем, если не настроено иначе, сообщения, генерируемые ZoneMinder, будут записаны в файл ``/var/log/messages`` или ``/var/log/syslog``. На некоторых дистрибутивах они могут оказаться в другом файле, но обычно все еще находятся в /var/log. Сообщения в этом файле похожи на те, что в файлах журналов скриптов, но немного отличаются. Например, вышеупомянутое событие в журнале системы выглядит так::

source: where you can see that the date is formatted differently (and only to 1 second precision) and there is an additional field for the hostname (as syslog can operate over a network). As well as ZoneMinder entries in this file you may also see entries from various other system components. You should ensure that your syslogd daemon is running for syslog messages to be correctly handled.
ru: где вы можете увидеть, что дата форматируется по-другому (и только до 1 секунды точности) и есть дополнительное поле для имени хоста (так как syslog может работать по сети). Кроме записей ZoneMinder в этом файле вы также можете увидеть записи от различных других компонентов системы. Вам следует убедиться, что ваш демон syslogd работает, чтобы сообщения syslog обрабатывались правильно.

source: Customizing logging properly in ZoneMinder
ru: Правильная настройка журналов в ZoneMinder

source: Other Notes
ru: !привет

source: A number of users have asked how to suppress or redirect ZoneMinder messages that are written to this file. This most often occurs due to not wanting other system messages to be overwhelmed and obscured by the ZoneMinder produced ones (which can be quite frequent by default). In order to control syslog messages you need to locate and edit the syslog.conf file on your system. This will often be in the /etc directory. This file allows configuration of syslog so that certain classes and categories of messages are routed to different files or highlighted to a console, or just ignored. Full details of the format of this file is outside the scope of this document (typing ‘man syslog.conf’ will give you more information) but the most often requested changes are easy to implement.
ru: Некоторые пользователи спрашивают, как подавить или перенаправить сообщения ZoneMinder, записываемые в этот файл. Это чаще всего происходит из-за нежелания, чтобы другие системные сообщения были загромождены и затемнены сообщениями ZoneMinder (которые по умолчанию могут быть довольно частыми). Для управления сообщениями syslog вам необходимо найти и отредактировать файл syslog.conf на вашей системе. Это часто находится в каталоге /etc. Этот файл позволяет конфигурацию syslog таким образом, чтобы определенные классы и категории сообщений направлялись в разные файлы или выделялись на консоль, или просто игнорировались. Полные детали формата этого файла выходят за рамки данного документа (ввод ‘man syslog.conf’ даст вам больше информации), но наиболее часто запрашиваемые изменения легко реализовать.

source: The syslog service uses the concept of priorities and facilities where the former refers to the importance of the message and the latter refers to that part of the system from which it originated. Standard priorities include ‘info’, ‘warning’, ‘err’ and ‘debug’ and ZoneMinder uses these priorities when generating the corresponding class of message. Standard facilities include ‘mail’, ‘cron’ and ‘security’ etc but as well this, there are eight ‘local’ facilities that can be used by machine specific message generators. ZoneMinder produces it’s messages via the ‘local1’ facility.
ru: Сервис syslog использует концепцию приоритетов и служб, где первое относится к важности сообщения, а второе - к той части системы, из которой оно исходит. Стандартные приоритеты включают в себя «информацию», «предупреждение», «ошибку» и «отладку», а ZoneMinder использует эти приоритеты при генерации соответствующего класса сообщений. Стандартные службы включают в себя «почту», «cron» и «безопасность» и т. д., но помимо этого, есть восемь «локальных» служб, которые могут использоваться для генерации сообщений для конкретных машин. ZoneMinder генерирует свои сообщения через службу «local1».

source: So armed with the knowledge of the priority and facility of a message, the syslog.conf file can be amended to handle messages however you like.
ru: Итак, вооружившись знаниями о приоритете и удобстве сообщения, файл syslog.conf можно изменить, чтобы обрабатывать сообщения так, как вам нравится.

source: So to ensure that all ZoneMinder messages go to a specific log file you can add the following line near the top of your syslog.conf file:
ru: Чтобы гарантировать, что все сообщения ZoneMinder записываются в определенный файл журнала, вы можете добавить следующую строку в начале вашего файла конфигурации syslog.conf:

source: which will ensure that all messages produced with the local1 facility are routed to fhe /var/log/zm/zm.log file. However this does not necessarily prevent them also going into the standard system log. To do this you will need to modify the line that determines which messages are logged to this file. This may look something like:
ru: Это обеспечит, что все сообщения, произведенные с помощью локальной службы local1, будут маршрутизироваться в файл /var/log/zm/zm.log. Однако это не обязательно предотвращает их также попадание в стандартный системный журнал. Чтобы это сделать, вам потребуется изменить строку, которая определяет, какие сообщения записываются в этот файл. Это может выглядеть примерно так:

source: by default. To remove ZoneMinder messages altogether from this file you can modify this line to look like:
ru: по умолчанию. Чтобы полностью удалить сообщения ZoneMinder из этого файла, вы можете изменить эту строку, чтобы она выглядела так:

source: which instructs syslog to ignore any messages from the local1 facility. If however you still want warnings and errors to occur in the system log file, you could change it to:
ru: которое инструктирует syslog игнорировать любые сообщения от службы local1. Однако, если вы все еще хотите, чтобы предупреждения и ошибки происходили в файле системного журнала, вы могли бы изменить его на:

source: which follows the ignore instruction with a further one to indicate that any messages with a facility of local1 and a priority of warning or above should still go into the file.
ru: Следующий следует инструкции игнорирования с дальнейшей, чтобы указать, что любые сообщения с возможностью локальной 1 и приоритетом предупреждения или выше все равно должны попадать в файл.

source: These recipes are just examples of how you can modify the logging to suit your system, there are a lot of other modifications you could make. If you do make any changes to syslog.conf you should ensure you restart the syslogd process or send it a HUP signal to force it to reread its configuration file otherwise your changes will be ignored.
ru: Эти рецепты являются всего лишь примерами того, как вы можете модифицировать журнализацию, чтобы она соответствовала вашей системе, существует множество других модификаций, которые вы могли бы сделать. Если вы внесете какие-либо изменения в файл конфигурации syslog.conf, вам следует убедиться, что вы перезапустите процесс syslogd или отправьте ему сигнал HUP, чтобы заставить его повторно прочитать свой файл конфигурации, иначе ваши изменения будут проигнорированы.

source: The discussion of logging above began by describing how scripts produce error and debug messages. The way that the binaries work is slightly different. Binaries generate information, warning and error messages using syslog in exactly the same way as scripts and these messages will be handled identically. However debug output is somewhat different. For the scripts, if you want to enable debug you will need to edit the script file itself and change the DBG_LEVEL constant to have a value of 1. This will then cause debug messages to be written to the <script>.log file as well as the more important messages. Debug messages however are not routed via syslog. Scripts currently only have one level of debug so this will cause any and all debug messages to be generated. Binaries work slightly differently and while you can edit the call to zmDbgInit that is present in every binary’s ‘main’ function to update the initial value of the debug level, there are easier ways.
ru: Обсуждение логирования выше началось с описания того, как скрипты генерируют сообщения об ошибках и отладке. Работа бинарных файлов немного отличается. Бинарные файлы генерируют информацию, предупреждения и сообщения об ошибках с помощью syslog точно так же, как и скрипты, и эти сообщения будут обрабатываться одинаково. Однако вывод отладки несколько отличается. Для скриптов, если вы хотите включить отладку, вам придется отредактировать файл скрипта самостоятельно и изменить константу DBG_LEVEL на значение 1. Это приведет к тому, что сообщения отладки будут записаны в файл <script>.log, а также более важные сообщения. Однако сообщения отладки не передаются через syslog. Скрипты в настоящее время имеют только один уровень отладки, поэтому это приведет к генерации любых и всех сообщений отладки. Бинарные файлы работают немного иначе, и хотя вы можете изменить вызов zmDbgInit, присутствующий в каждой функции main бинарного файла, чтобы обновить начальное значение уровня отладки, есть и другие способы.

source: The simplest way of collecting debug output is to click on the Options link from the main ZoneMinder console view and then go to the Debug tab. There you will find a number of debug options. The first thing you should do is ensure that the ZM_EXTRA_DEBUG setting is switched on. This enables debug generally. The next thing you need to do is select the debug target, level and destination file using the relevant options. Click on the ‘?’ by each option for more information about valid settings. You will need to restart ZoneMinder as a whole or at least the component in question for logging to take effect. When you have finished debugging you should ensure you switch debug off by unchecking the ZM_EXTRA_DEBUG option and restarting ZoneMinder. You can leave the other options as you like as they are ignored if the master debug option is off.
ru: Самый простой способ сбора отладочной информации - это щелкнуть по ссылке "Настройки" с главной панели консоли ZoneMinder и перейти на вкладку "Отладка". Там вы найдете ряд опций отладки. Первое, что вам следует сделать, это убедиться, что параметр ZM_EXTRA_DEBUG установлен в положение "Включено". Это включает отладку в целом. Затем вам нужно выбрать целевой объект отладки, уровень и файл журнала с помощью соответствующих опций. Щелкните по значку вопроса рядом с каждой опцией для получения дополнительной информации о допустимых настройках. Вам придется перезапустить ZoneMinder в целом или, по крайней мере, компонент, о котором идет речь, для того чтобы ведение журнала начало работать. Когда вы закончите отладку, убедитесь, что вы отключили отладку, сняв флажок с параметра ZM_EXTRA_DEBUG, и перезапустите ZoneMinder. Вы можете оставить другие настройки как есть, так как они игнорируются, если параметр отладки мастера выключен.

source: Once you have debug being logged you can modify the level by sending USR1 and USR2 signals to the relevant binary (or binaries) to increase or decrease the level of debug being emitted with immediate effect. This modification will not persist if the binary gets restarted however.
ru: После того как вы включили отладку в журнале, вы можете изменить уровень, отправив сигналы USR1 и USR2 соответствующему исполняемому файлу (или файлам), чтобы увеличить или уменьшить уровень отладки, который будет немедленно выпущен. Это изменение не будет сохранено, если исполняемый файл будет перезапущен.

source: If you wish to run a binary directly from the command line to test specific functionality or scenarios, you can set the ZM_DBG_LEVEL and ZM_DBG_LOG environment variables to set the level and log file of the debug you wish to see, and the ZM_DBG_PRINT environment variable to 1 to output the debug directly to your terminal.
ru: Если вы хотите запускать исполняемый файл непосредственно из командной строки для тестирования конкретной функциональности или сценариев, вы можете установить переменные окружения ZM_DBG_LEVEL и ZM_DBG_LOG для уровня отладки и имени файла журнала, которые вы хотите видеть, и переменную окружения ZM_DBG_PRINT в 1 для вывода отладки непосредственно в терминал.

source: All ZoneMinder logs can now be rotated by logrotate. A sample logrotate config file is shown below:
ru: Все журналы ZoneMinder теперь можно перенаправить с помощью logrotate. Приведен ниже пример конфигурационного файла logrotate:
