Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/mobile.po
Languages: ru

source: Mobile Devices
ru: Мобильные устройства

source: Here are some options for using ZoneMinder on Mobile devices:
ru: Вот некоторые варианты использования ZoneMinder на мобильных устройствах:

source: Third party mobile clients
ru: Клиенты мобильных устройств сторонних производителей

source: zmNinja (`source code <https://github.com/zoneminder/zmNinja>`__, needs APIs to be installed to work)
ru: zmNinja (`source code <https://github.com/zoneminder/zmNinja>`, требует установки API для работы)

source: Available in App Store, Play Store and for Desktops - `website <https://zmninja.zoneminder.com/>`__
ru: Доступно в App Store, Play Store и для настольных компьютеров - `сайт <https://zmninja.zoneminder.com/>`__

source: Using the existing web console
ru: Используя существующую веб-консоль

source: You can directly use the ZoneMinder interface by launching a browser and going to the ZoneMinder server just like you do on the Desktop
ru: Вы можете напрямую использовать интерфейс ZoneMinder, запустив браузер и перейдя на сервер ZoneMinder так же, как вы делаете это на рабочем столе

source: Discontinued clients
ru: Прекратившие обслуживание клиенты

source: The following are a list of clients that do not work and have not been updated:
ru: Ниже представлен список клиентов, которые не работают и не были обновлены:

source: eyeZM
ru: !глазаМ
