Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/tags.po
Languages: ru

source: Tags
ru: Теги

source: Tags are a simple quick way to categorize events so that you can identify them easier.
ru: Теги - это простой и быстрый способ классифицировать события, чтобы их было легче идентифицировать.

source: Creating New Tags
ru: Создание новых тегов

source: Creating new tags is as easy as typing a word in the tags field (located just above the video). Pressing the space bar, comma, or Enter will create the new tag and add it to the event.
ru: Создание новых тегов так же просто, как ввод слова в поле тегов (расположенном прямо над видео). Нажатие клавиши пробела, запятой или Enter создаст новый тег и добавит его к событию.

source: Adding Existing Tags to an Event
ru: Добавление существующих тегов к событию

source: Clicking in the tags field will show a dropdown list of all of the available tags in descending order of when they were last added to an event.
ru: Нажатие в поле тегов отобразит выпадающий список всех доступных тегов в порядке убывания даты последнего добавления их к событию.

source: An existing tag can be added to the event by clicking it from the dropdown or by using the down/up arrow keys to highlight the desired tag and pressing Enter.
ru: Существующая метка может быть добавлена к событию путем выбора ее из выпадающего списка или путем использования стрелок вниз/вверх для выделения желаемой метки и нажатия Enter.

source: <Ctrl-Down Arrow> will add the tag most recently added to any event to the current event.
ru: <Ctrl-Down Arrow> добавит тег, недавно добавленный к любому событию, к текущему событию.

source: Typing in the tags field will filter the available tags to the ones that contain the text typed.
ru: Ввод тегов в поле фильтрации позволит отобразить только те теги, которые содержат введенный текст.

source: Since you can use the right/left arrows to move between events when the tags field doesn't have focus, you can quickly add the most recent tag with <Ctrl-Down Arrow> and then move to the next event with Right Arrow. You can also use the Down Arrow to bring up the available tags to add a different tag before pressing the Right Arrow to move to the next event.
ru: Поскольку вы можете использовать стрелки вправо/влево для перемещения между событиями, когда поле тегов не имеет фокуса, вы можете быстро добавить последний тег с помощью <Ctrl-Вниз Стрелка> и затем перейти к следующему событию с помощью Стрелка Вправо. Вы также можете использовать Стрелка Вниз для отображения доступных тегов для добавления другого тега перед нажатием Стрелка Вправо для перехода к следующему событию.

source: Removing Tags from an Event
ru: Удаление тегов из события

source: Pressing the "x" to the right of a tag will remove it from the event. When the tag is removed from the last event, the tag will be deleted from the available tags.
ru: Нажатие на "x" справа от тега удалит его из события. Когда тег удаляется из последнего события, тег будет удален из доступных тегов.

source: Filtering with Tags
ru: Фильтрация по тегам

source: Current Limitations
ru: Существующие ограничения

source: Filtering for multiple tags is an OR search (Goal is to make this an AND search)
ru: Фильтрация по нескольким тегам является поиском OR (Цель - сделать это поиском AND)

source: Resulting events only display the tags that were searched (Goal is to display all of the tags on the resulting events)
ru: События, полученные в результате, отображают только те теги, которые были найдены (цель - отобразить все теги в полученных событиях)

source: There is no way to search for events that don't have any tag (Goal is to provide search criteria for events with no tag)
ru: Нет способа искать события, которые не имеют никаких меток (Цель - предоставить критерии поиска для событий без метки)

source: There is no way to search for events with ONLY the specified tag or tags (Goal is to provide search criteria to search for events with ONLY the specified tag or tags)
ru: Нет способа искать события только с указанным тегом или тегами (Цель - предоставить критерии поиска для поиска событий только с указанным тегом или тегами)
