Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/viewmonitors.po
Languages: ru

source: Add or remove columns for the Monitor Events list.
ru: Добавить или удалить столбцы для списка событий Монитора.

source: [C] Download Event Information
ru: [C] Загрузить информацию об событии

source: Download a file containing the monitor event list. Various file formats are available.
ru: Скачайте файл, содержащий список событий монитора. Доступны различные форматы файлов.

source: [D] Delete Event
ru: [D] Удалить Событие

source: Delete individual event.
ru: Удалить индивидуальное событие.

source: [E] Display Event
ru: [E] Показ События

source: Display event image stream by selecting either event Id or Name.
ru: Вывод потока изображений события путем выбора либо идентификатора события, либо имени.

source: [F] Display Frames
ru: [F] Отображение кадров

source: Display a list of frames for the event.
ru: Вывести список кадров для события.

source: [G] Max. Score
ru: [G] Макс. Оценка

source: Display frame with maximum alarm score.
ru: Вывести раму с максимальным показателем тревоги.

source: [H] Thumbnail
ru: [H] Заголовок

source: Display event image stream by clicking on thumbnail image.
ru: Вывод потока изображений события при нажатии на миниатюру изображения.
