Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/userguide/viewmonitors.po
Languages: ru

source: Viewing Monitors
ru: Просмотр мониторов

source: Several methods for viewing live streams from monitors are available in ZoneMinder. The common entry points for viewing monitors are highlighted in the Console as shown below.
ru: Доступно несколько методов просмотра прямых трансляций с мониторов в ZoneMinder. Общие точки входа для просмотра мониторов отмечены в консоли, как показано ниже.

source: Methods for Viewing Monitors
ru: Методы просмотра мониторов

source: Monitor View
ru: Монитор просмотра

source: The `Monitor View`_ displays a live feed for a single selected monitor. There are several ways to enter the Monitor View.
ru: `Monitor View`_ отображает живую трансляцию для одного выбранного монитора. Есть несколько способов попасть в Монитор просмотра.

source: Monitor Id: Click on any available monitor Id such as :guilabel:`3` in the example above to display a live feed.
ru: Монитор Id: Щелкните по любому доступному монитору Id, например: :guilabel:`3` в примере выше, чтобы отобразить прямую трансляцию.

source: Name: Click on any available monitor Name such as :guilabel:`Driveway` to display a live feed.
ru: Имя: Нажмите на любой доступный монитор, например: :guilabel:`Driveway`, чтобы отобразить прямую трансляцию.

source: Thumbnail: Click on any available monitor thumbnail image to display a live feed.
ru: Миниатюра: Щелкните по любой доступной миниатюре монитора, чтобы отобразить живой поток.

source: Cycle
ru: Цикл

source: The `Cycle`_ monitor view displays a rotating view for each selected monitor. Click on :guilabel:`Cycle` to open the Cycle view.
ru: `Cycle`_ отображает вращающийся вид для каждого выбранного монитора. Щелкните по :guilabel:`Cycle`, чтобы открыть вид "Цикл".

source: Montage
ru: Сборка

source: The `Montage`_ monitor view displays several monitors simultaneously. The Montage view is highly configurable and is useful for applications where a continuous monitor view is needed. Click on :guilabel:`Montage` to open the Montage view.
ru: `Montage`_ вид отображает несколько мониторов одновременно. Монтажный вид очень настраиваемый и полезен для приложений, где требуется непрерывный мониторинг. Нажмите на :guilabel:`Montage`, чтобы открыть вид Монтаж.

source: Montage Review
ru: Обзор сборки

source: The `Montage Review`_ monitor view is similar to Montage view but provides access to viewing the available events captured by each monitor. Click on :guilabel:`Montage Review` to open the Montage Review view.
ru: `Montage Review`_ похож на вид Монтажа, но предоставляет доступ к просмотру событий, захваченных каждым монитором. Щелкните по :guilabel:`Montage Review`, чтобы открыть вид "Обзор Монтажа".

source: The Monitor View is useful for continuous viewing of a single monitor live stream. The currently displayed monitor can be changed by selecting a new one in the Monitor input field of the Console Filter. By default, if the Monitor View window is minimized or other windows are in front, the Monitor View will move to the foreground if the monitor enters Alarm state. This behaviour can be disabled with the **WEB_POPUP_ON_ALARM** option. Additionally, a sound can be played when the monitor enters Alarm state. This can be enabled with the **WEB_SOUND_ON_ALARM** and **WEB_ALARM_SOUND** options. A list of events will be shown below the monitor live stream if the monitor has recording enabled. Please refer to the :doc:`viewevents` section for information about viewing events as this part of the Monitor View will not be discussed in this section.
ru: Монитор виджета полезен для непрерывного просмотра потока одного монитора в реальном времени. Текущий отображаемый монитор можно изменить, выбрав новый в поле ввода монитора консольного фильтра. По умолчанию, если окно виджета Монитор свернуто или другие окна находятся перед ним, виджет Монитор переместится на передний план, когда монитор войдет в состояние тревоги. Это поведение можно отключить с помощью опции **WEB_POPUP_ON_ALARM**. Кроме того, можно воспроизвести звук, когда монитор входит в состояние тревоги. Это можно сделать с помощью опций **WEB_SOUND_ON_ALARM** и **WEB_ALARM_SOUND**. Будет показана список событий под потоком живого мониторинга, если монитор имеет функцию записи включена. Пожалуйста, обратитесь к разделу :doc:`viewevents` для получения информации о просмотре событий, поскольку эта часть виджета Монитор не будет обсуждаться в этом разделе.

source: [A] Monitor View
ru: [A] Монитор вид

source: Shows the selected monitor live view. The view can be adjusted using the mouse as follows. Use left mouse button :kbd:`LMB` to zoom in, use :kbd:`CTRL-LMB` to zoom out and use :kbd:`SHIFT-LMB` to pan.
ru: Отображает живой вид выбранного монитора. Вид можно настроить с помощью мыши следующим образом. Используйте левую кнопку мыши :kbd:`LMB` для увеличения, используйте :kbd:`CTRL-LMB` для уменьшения масштаба и используйте :kbd:`SHIFT-LMB` для панорамирования.

source: [B] Console Filter
ru: [B] Консольный фильтр

source: The Console Filter is available in the Monitor view at the top of the display. However, the only relevant filter item while in Monitor View is Monitor which can be used to change the live view to another available monitor.
ru: Фильтр консоли доступен в разделе "Монитор" в верхней части дисплея. Однако единственным релевантным элементом фильтра при просмотре "Монитор" является "Монитор", который можно использовать для изменения текущего живого просмотра на другой доступный монитор.

source: [C] Scale
ru: [C] Шкала

source: Sets the relative size of Monitor live view in the web interface. Scale factors from :guilabel:`1/8x` to :guilabel:`4x` are available. Note that the :guilabel:`Auto` scale will allow the Monitor live view to fill the screen when Fullscreen is activated.
ru: Устанавливает относительный размер живого просмотра монитора в веб-интерфейсе. Доступны масштабирующие коэффициенты от :guilabel:`1/8x` до :guilabel:`4x`. Обратите внимание, что :guilabel:`Автоматический` масштаб позволит монитору заполнить экран при активации полноэкранного режима.

source: [D] Width/Height
ru: [D] Ширина/Высота

source: Allows manual control of the individual width and height of Monitor live view. Various useful sizes based on pixel units are available. Note that this only applies for viewing and does not change the monitor setting.
ru: Позволяет вручную управлять индивидуальной шириной и высотой отображения монитора в режиме реального времени. Доступны различные полезные размеры на основе пиксельных единиц. Обратите внимание, что это применимо только для просмотра и не изменяет настройки монитора.

source: [E] Rate
ru: [E] Оценка

source: Sets the rate at which monitor live view image is updated. This is useful for reducing the update frequency in order to reduce CPU resources. Rates from :guilabel:`1 fps` to :guilabel:`20 fps` are available. The default :guilabel:`Unlimited` sets the display rate to the monitor's defined frame rate. Note that this only applies for viewing. This does not change the frame rate of the monitor itself.
ru: Устанавливает скорость обновления изображения в режиме живого просмотра монитора. Это полезно для снижения частоты обновления, чтобы снизить использование ресурсов ЦП. Доступны скорости от :guilabel:`1 кадр/с` до :guilabel:`20 кадров/с`. Значение по умолчанию :guilabel:`Неограниченное` устанавливает скорость отображения на мониторе в соответствии с его заданной частотой кадров. Обратите внимание, что это применимо только для просмотра. Это не изменяет частоту кадров монитора.

source: [F] PTZ Controls Sidebar
ru: [F] Панель управления PTZ

source: Activates the PTZ Control Sidebar if the monitor is configured to use Controls. See :doc:`cameracontrol` for more information about Camera Control.
ru: Активирует боковую панель управления PTZ, если монитор настроен на использование элементов управления. См. :doc:`cameracontrol` для получения дополнительной информации о управлении камерой.

source: [G] Cycle View Sidebar
ru: [G] Цикл Вид Боковой Панели

source: Activates the Cycle View Sidebar. Essentially this changes viewing mode to `Cycle`_.
ru: Активирует боковую панель просмотра цикла. По сути, это изменяет режим просмотра на `Cycle`_.

source: [H] Force Alarm
ru: [H] Сигнализация о принуждении

source: Manually triggers an alarm for the monitor. Useful for setup and debug of monitors and events. Click once to trigger the alarm. Second click ends the alarm.
ru: Ручное включение сигнала тревоги для монитора. Полезно при настройке и отладке мониторов и событий. Нажмите один раз, чтобы включить сигнал тревоги. Второй щелчок заканчивает сигнал тревоги.

source: [I] Disable Alarms
ru: [I] Отключить будильники

source: Manually disable alarms for the monitor. Note that this is only for viewing and does not change the monitor settings related to alarm triggering.
ru: Ручное отключение будильников для монитора. Обратите внимание, что это только для просмотра и не изменяет настройки монитора, связанные с триггером будильника.

source: [J] Local Monitor Settings
ru: [J] Настройки локального монитора

source: Access to local monitor settings. Only applies to Local (USB webcam) monitor types and is greyed out for all other monitor types.
ru: Доступ к настройкам локального монитора. Применяется только для типов локальных мониторов (веб-камер USB) и затемняется для всех других типов мониторов.

source: [K] Refresh
ru: [K] Обновить

source: Refresh the Monitor View interface.
ru: Обновите интерфейс монитора.

source: Return to previous web interface page.
ru: Вернуться на предыдущую веб-страницу интерфейса.

source: [M] Monitor Status
ru: [M] Монитор Статус

source: Displays basic monitor status: alarm state, viewing FPS, capturing FPS and analysis FPS. The status has three states: ``Idle``, ``Alarm`` or ``Alert`` depending on the function of the Monitor and its defined zones. ``Idle`` is the default state when no activity is detected in the defined zones, ``Alarm`` means there is an alarm in progress and ``Alert`` means that an alarm has recently ended. If another alarm is generated during this time it will be appended to the event. The Monitor Status is colour coded in black for ``Idle``, red for ``Alarm`` and amber for ``Alert``.
ru: Отображает базовые параметры монитора: состояние тревоги, количество кадров в секунду при просмотре, количество кадров в секунду при захвате и анализ кадров в секунду. Состояние имеет три состояния: «Ожидание», «Тревога» или «Предупреждение» в зависимости от функции монитора и его определенных зон. «Ожидание» - это состояние по умолчанию, когда никакая активность не обнаружена в определенных зонах, «Тревога» означает, что идет тревога, а «Предупреждение» означает, что тревога только что закончилась. Если во время этого события будет сгенерирована еще одна тревога, она будет добавлена к событию. Состояние монитора цветное: черное для «Ожидания», красное для «Тревоги» и оранжевое для «Предупреждения».

source: [N] Pause/Play
ru: [N] Пауза/воспроизведение

source: Pause live view of monitor by clicking pause icon. Note that this only for viewing and does not change the monitor setting. Play will restart live view streaming of monitor after Pause has been activated.
ru: Пауза прямого просмотра монитора путем нажатия кнопки паузы. Обратите внимание, что это только для просмотра и не изменяет настройки монитора. Воспроизведение возобновит прямой просмотр потока монитора после активации паузы.

source: [O] Zoom Out
ru: [O] Выход из полноэкранного режима

source: Zoom Out the monitor live view. This is only useful if the view has previously been zoomed in. Zoom Out will stop when the full image size has been reached.
ru: Уменьшить масштаб отображения монитора в реальном времени. Это полезно только в том случае, если ранее изображение было увеличено. Уменьшение масштаба прекратится, когда будет достигнуто полное изображение.

source: [P] Fullscreen
ru: [P] Полный экран

source: Enter Fullscreen monitor display mode. Note that the monitor live stream will not utilize the entire screen as the Pause, Play, Zoom and Exit Fullscreen icons will always be placed at bottom of screen. The monitor event list may also be placed at bottom of screen if Scale or Width/Height is not set to :guilabel:`Auto`. Press :kbd:`ESC` or the Exit Fullscreen icon to exit Fullscreen mode.
ru: Перейти в полноэкранный режим монитора. Обратите внимание, что прямая трансляция монитора не будет использовать всю площадь экрана, так как значки Пауза, Воспроизведение, Увеличение и Выход из полноэкранного режима всегда будут располагаться в нижней части экрана. Список событий монитора также может быть расположен в нижней части экрана, если Масштаб или Ширина/Высота не установлены в :guilabel:`Авто`. Нажмите :kbd:`ESC` или значок Выход из полноэкранного режима, чтобы выйти из полноэкранного режима.

source: Monitor Cycle View
ru: Мониторинг цикла просмотра

source: The Cycle view is essentially the same as the `Monitor View`_ except that it sequences through a list of monitors. The example above has monitors ``3``, ``6`` and ``7`` selected for a Cycle view. The list of monitors to include in a Cycle view are selectable as well as the display time for each monitor. Please note that the functions and control icons remain the same as `Monitor View`_ except for the ones listed below.
ru: Вид цикла практически такой же, как и у `Monitor View`_, за исключением того, что он проходит через список мониторов. Пример выше имеет выбранными мониторы ``3``, ``6`` и ``7`` для вида цикла. Список мониторов, которые следует включить в вид цикла, а также время отображения каждого монитора, также можно выбрать. Пожалуйста, обратите внимание, что функции и значки управления остаются такими же, как и в `Monitor View`_, за исключением указанных ниже.

source: [A] Display Time
ru: [A] Время отображения

source: Selects length of display time for each monitor before changing to next monitor. Display time can be set between :guilabel:`5 seconds` and :guilabel:`5 minutes`.
ru: Выбирает длительность отображения времени для каждого монитора перед переходом к следующему монитору. Время отображения может быть установлено между :guilabel:`5 секунд` и :guilabel:`5 минут`.

source: [B] Pause/Play/Back/Forward
ru: [B] Пауза/Воспроизведение/Назад/Вперед

source: Pause the Cycle at the currently displayed monitor. Play icon re-starts the rotation of monitor views. Back and forward icons will immediately move to the previous or next monitor live stream.
ru: Пауза в цикле на текущем отображаемом мониторе. Иконка воспроизведения возобновляет вращение мониторов. Иконки назад и вперед немедленно перемещаются к предыдущему или следующему живому потоку монитора.

source: [C] Monitor
ru: [C] Монитор

source: Currently displayed monitor live stream is highlighted in blue.
ru: На данный момент отображаемый монитор прямой трансляции выделен синим цветом.

source: Monitor Montage View
ru: Монитор Монтаж Вид

source: The Montage view is similar to the `Monitor View`_ except that it displays several monitors simultaneously. The Console Filter is fully available and can be used to filter and select the monitors to be included in the Montage view. The example above has monitors ``3``, ``6`` and ``7`` selected for a Montage view. Please note that the functions and control icons remain the same as `Monitor View`_ except for the ones listed below.
ru: Вид монтажа похож на `Monitor View`_, за исключением того, что он отображает несколько мониторов одновременно. Фильтр консоли полностью доступен и может быть использован для фильтрации и выбора мониторов, которые будут включены в вид монтажа. Пример выше имеет выбранными мониторы ``3``, ``6`` и ``7`` для вида монтажа. Пожалуйста, обратите внимание, что функции и значки управления остаются такими же, как и в `Monitor View`_, за исключением указанных ниже.

source: [A] Layout
ru: [A] Макет

source: Select layout preset arrangement of monitor displays.
ru: Выберите предустановку расположения дисплеев монитора.

source: [B] Edit Layout
ru: [B] Редактировать Макет

source: Customized montage view settings can be edited and saved.
ru: Настройка пользовательского вида монтажа может быть изменена и сохранена.

source: [C] Show/Hide Zones
ru: [C] Показать/скрыть зоны

source: Enable or disable overlay of currently defined zone regions on each monitor live stream.
ru: Включить или отключить отображение текущих определённых зон на каждом мониторе в прямом эфире.

source: The Montage Review view builds upon the `Montage`_ view by adding access to saved events. The example above has monitors ``3``, ``6`` and ``7`` selected for a Montage Review view. The Montage Review provides flexible methods for reviewing saved events. The primary method to set the timeline for reviewing events is to use the timeline icons to set the scope of the timeline. The secondary method is to use the calendar pop-up function from the Start Date/Time entry box to set specific dates and times for the scope of the timeline.
ru: Обзорная страница просмотра строится на основе `обзора`_ страницы, добавляя доступ к сохраненным событиям. Пример выше имеет мониторы "3", "6" и "7" выбранными для обзора просмотра. Обзорный просмотр предоставляет гибкие методы для обзора сохраненных событий. Основной метод для установки временной шкалы для обзора событий - это использование значков временной шкалы для определения области временной шкалы. Вторичный метод - использование всплывающего календаря из поля ввода "Начало даты/время" для установки конкретных дат и времени для области временной шкалы.

source: [A] Speed
ru: [A] Скорость

source: Adjusts the playback speed for the monitor views using a slider. Playback speed can be adjusted between :guilabel:`0.10x` and :guilabel:`50.00x`. To pause the display, select :guilabel:`0.00x`.
ru: Настраивает скорость воспроизведения для отображения на мониторе с помощью ползунка. Скорость воспроизведения может быть установлена в диапазоне от :guilabel:`0.10x` до :guilabel:`50.00x`. Чтобы приостановить отображение, выберите :guilabel:`0.00x`.

source: [B] Archive Status
ru: [B] Статус архива

source: Selection to display only :guilabel:`Archived` or :guilabel:`Unarchived` events using a pull-down menu. Default setting is :guilabel:`All` which will display both Archived and Unarchived events in the timeline.
ru: Выбор для отображения только :guilabel:`Архивированные` или :guilabel:`Неархивированные` события с помощью выпадающего меню. По умолчанию установлено :guilabel:`Все`, что будет отображать как архивированные, так и неархивированные события в временной шкале.

source: Calendar Input for Date/Time
ru: Календарь для даты/времени

source: [C] Start Date/Time >= and Start Date/Time <=
ru: [C] Дата начала/время >= и Дата начала/время <=

source: Displays the timeline span in terms of date and time. Default setting for the timeline is a one-hour span that ends with the current time. The start and end times for the span can be manually selected by clicking on the entry form. A calendar window will pop up to define the desired date and time.
ru: Выводит временной диапазон в терминах даты и времени. По умолчанию для временного диапазона установлен один-часовой интервал, заканчивающийся текущим временем. Начало и конец интервала можно выбрать вручную, щелкнув по форме ввода. Появится окно календаря для определения желаемой даты и времени.

source: [D] Timeline Controls
ru: [D] Управление временной шкалой

source: Control functions are available to set the timeline span (:guilabel:`24 HOUR`, :guilabel:`8 HOUR`, :guilabel:`1 HOUR`, and :guilabel:`ALL EVENTS`) as well as pan and zoom (:guilabel:`< PAN`, :guilabel:`PAN >`, :guilabel:`IN +`, :guilabel:`OUT -`). Switch to monitor live-streaming view using :guilabel:`LIVE`.
ru: Функции управления доступны для установки временного диапазона (24 часа, 8 часов, 1 час и все события) а также панорамирования и масштабирования (< ПАН>, ПАН >, ВПЕРЕД +, НАЗАД -). Переключитесь на просмотр прямого эфира с помощью LIVE.

source: [D] Scale/Fit
ru: [D] Масштаб/Подогнать

source: Changes the display size of the monitor views using a slider when :guilabel:`SCALE` is clicked. Scale values of :guilabel:`0.10x` to :guilabel:`1.00x` are available. This is useful to either reduce or increase the relative size of the monitor views to fit better on the Montage Review view. Use the :guilabel:`FIT` button to automatically fit the monitor views to the Montage Review display. Note that the :guilabel:`FIT` button is only available after :guilabel:`SCALE` has been activated.
ru: Изменяет размер отображения мониторных видов с помощью ползунка при нажатии на :guilabel:`SCALE`. Доступны значения масштабирования :guilabel:`0.10x` до :guilabel:`1.00x`. Это полезно для уменьшения или увеличения относительного размера мониторных видов, чтобы они лучше подходили к просмотру Монтаж Обзора. Используйте кнопку :guilabel:`FIT`, чтобы автоматически подогнать мониторные виды под дисплей Монтаж Обзора. Примечание: кнопка :guilabel:`FIT` доступна только после активации :guilabel:`SCALE`.

source: [E] Download Video
ru: [E] Скачать видео

source: Downloads the events shown in the timeline. A filename will be automatically generated. Select between ``tar`` and ``zip`` archive formats for the file export.
ru: Загружает события, показанные в временной шкале. Будет автоматически сгенерировано имя файла. Выберите формат архива ``tar`` или ``zip``.

source: [F] Timeline
ru: [F] Шкала времени

source: Displays the events available in the currently selected span. Events for each monitor are indicated by a distinct colour band. The timeline pointer indicated by yellow box indicates the currently displayed events in the monitor views. If there are no events within the timeline pointer, a **No Event** overlay is shown in the monitor view. In this case, the monitor view may display the final frame of previously viewed event.
ru: Выводит доступные события в текущем выбранном интервале. События для каждого монитора обозначены цветной полосой. Указатель времени, отмеченный желтой рамкой, указывает на текущие события, отображаемые в мониторе. Если в пределах указателя времени нет событий, поверх монитора отображается надпись "Нет события". В этом случае монитор может отображать последний кадр ранее просмотренного события.

source: [G] Monitor Display
ru: [G] Монитор Дисплей

source: Displays the currently selected event based on the timeline pointer. If there are no events within the timeline pointer, a **No Event** overlay is shown in the monitor view. In this case, the monitor view may display the final frame of previously played event.
ru: Отображает текущее событие, основанное на указателе временной шкалы. Если в пределах указателя временной шкалы нет событий, отображается **Нет события** в мониторе просмотра. В этом случае монитор просмотра может отображать последний кадр ранее проигранного события.

source: Monitor Events
ru: Мониторинг событий

source: Monitor View Events List
ru: Просмотр событий монитора

source: If recorded events are available, they will be presented below the monitor images for both Monitor View and Cycle modes. This section will only introduce some of the features of the Monitor Events list. For a more in-depth description of Monitor Events, please see the :doc:`viewevents` section of the User Guide.
ru: Если доступны записанные события, они будут представлены ниже изображений монитора для обоих режимов Мониторного вида и Циклического режима. Этот раздел только познакомит вас с некоторыми функциями списка событий монитора. Для более подробного описания событий монитора см. раздел :doc:`viewevents` Руководства пользователя.

source: [A] Refresh
ru: [A] Обновить

source: Refresh the Monitor Events list.
ru: Обновите список событий монитора.
