Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/installationguide/debian.po
Languages: ru

source: Contents
ru: Содержимое

source: This procedure will guide you through the installation of ZoneMinder on Debian 12 (Bookworm).
ru: Этот процесс поможет вам установить ZoneMinder на Debian 12 (Bookworm).

source: **Step 1:** Setup Sudo (optional but recommended)
ru: **Шаг 1:** Настройка sudo (необязательно, но рекомендуется)

source: By default Debian does not come with sudo, so you have to install it and configure it manually. This step is optional but recommended and the following instructions assume that you have setup sudo. If you prefer to setup ZoneMinder as root, do it at your own risk and adapt the following instructions accordingly.
ru: По умолчанию Debian не поставляется с sudo, поэтому вам необходимо установить его и настроить вручную. Этот шаг является опциональным, но рекомендуется, и следующие инструкции предполагают, что вы уже настроили sudo. Если вы предпочитаете настроить ZoneMinder как root, сделайте это на свой страх и риск и адаптируйте следующие инструкции соответствующим образом.

source: Now your terminal session is back under your normal user. You can check that you are now part of the sudo group with the command ``groups``, "sudo" should appear in the list. If not, run ``newgrp sudo`` and check again with ``groups``.
ru: Теперь ваша сессия терминала снова находится под вашим обычным пользователем. Вы можете проверить, что теперь вы являетесь частью группы "sudo", с помощью команды ``groups``, "sudo" должно появиться в списке. Если нет, выполните ``newgrp sudo`` и снова проверьте с помощью ``groups``.

source: **Step 2:** Update system
ru: **Шаг 2:** Обновите систему

source: Run the following commands.
ru: Выполните следующие команды.

source: **Step 3:** Install MariaDB and do initial database configuration
ru: **Шаг 3:** Установите MariaDB и выполните первоначальную конфигурацию базы данных

source: Switch into root user and create database and database user
ru: Войдите в пользователя root и создайте базу данных и пользователя базы данных

source: By default MariaDB uses `unix socket authentication`_, so no root user password is required (root MariaDB user access only available to local root Linux user). If you wish, you can set a root MariaDB password (and apply other security tweaks) by running `mariadb-secure-installation`_.
ru: По умолчанию MariaDB использует аутентификацию по сокету Unix_, поэтому пароль администратора root не требуется (доступ к учетной записи администратора MariaDB доступен только локальному корневому пользователю Linux). Если вы хотите, вы можете установить пароль администратора MariaDB (и применить другие меры безопасности) путем запуска `mariadb-secure-installation`_.

source: **Step 4:** Install zoneminder
ru: **Шаг 4:** Установите zoneminder

source: By default Debian will install the version published in Debian (stable). However there may be newer versions by using backports. At the time of this writing, bookworm (stable) ships with v.1.36.33.
ru: По умолчанию Debian установит версию, опубликованную в Debian (стабильная). Однако можно использовать обновления для получения более новых версий. На момент написания этого текста, bookworm (стабильный) поставляется с версией v.1.36.33.

source: To install the version in bookworm stable, just run the following command.
ru: Для установки версии в стабильном книгоеде, просто выполните следующую команду.

source: If instead you prefer to install the newer version using backports, run the following commands. The first line will add this bookworm-backports repository. The backports repository is deactivated by default, so with the second line we explicitly state we want the backported version of zoneminder.
ru: Если вместо этого вы предпочитаете установить более новую версию, используя backports, выполните следующие команды. Первая строка добавит репозиторий bookworm-backports. Репозиторий backports по умолчанию отключен, поэтому со второй строкой мы явно заявляем, что хотим версию Zoneminder из backports.

source: **Step 5:** Configure database
ru: **Шаг 5:** Настройка базы данных

source: **Step 6:** Setup permissions for zm.conf
ru: **Шаг 6:** Настройте разрешения для файла zm.conf

source: To make sure zoneminder can read the configuration file, run the following command.
ru: Чтобы убедиться, что ZoneMinder может читать конфигурационный файл, выполните следующую команду.

source: **Step 7:** Tweak Apache configuration
ru: **Шаг 7:** Подстройка конфигурации Apache

source: If the zoneminder.service show to be active and without any errors, you should be able to access zoneminder at ``http://yourhostname/zm``
ru: Если сервис ZoneMinder показывает, что он активен и без ошибок, вы должны иметь возможность получить доступ к ZoneMinder по адресу "http://ваш_хост/zm"

source: This procedure will guide you through the installation of ZoneMinder on Debian 11 (Bullseye).
ru: Этот процесс поможет вам установить ZoneMinder на Debian 11 (Bullseye).

source: By default Debian will install the version published in Debian (stable). However you also have the option to install a newer version using backports. For example, at the time of this writing, bullseye (stable) ships with v.1.34.x and bullseye-backports with v.1.36.x.
ru: По умолчанию Debian установит версию, опубликованную в Debian (стабильная). Однако у вас также есть возможность установить более новую версию, используя бэкпорты. Например, на момент написания этого текста, bullseye (stable) поставляется с v.1.34.x и bullseye-backports с v.1.36.x.

source: To install the version in bullseye stable, just run the following command.
ru: Для установки версии в стабильной bullseye просто выполните следующую команду.

source: If instead you prefer to install the newer version using backports, run the following commands. The first line will add bullseye-backports repository. The backports repository is deactivated by default, so with the second line we explicitly state we want the backported version of zoneminder.
ru: Если вместо этого вы предпочитаете установить более новую версию, используя бэкпорты, выполните следующие команды. Первая строка добавит репозиторий bullseye-backports. Репозиторий бэкпортов по умолчанию отключен, поэтому во второй строке мы явно указываем, что хотим версию zoneminder с бэкпортами.

source: This procedure will guide you through the installation of ZoneMinder on Debian 10 (Buster).
ru: Этот процесс поможет вам установить ZoneMinder на Debian 10 (Buster).

source: **Step 1:** Make sure your system is up to date
ru: **Шаг 1:** Убедитесь, что ваша система обновлена

source: Open a console and use ``su`` command to become root.
ru: Откройте консоль и используйте команду `su`, чтобы стать суперпользователем.

source: **Step 2:** Setup Sudo (optional but recommended)
ru: **Шаг 2:** Настройка sudo (необязательно, но рекомендуется)

source: **Step 3:** Install Apache and MySQL
ru: **Шаг 3:** Установите Apache и MySQL

source: These are not dependencies for the ZoneMinder package as they could be installed elsewhere. If they are not installed yet in your system, you have to trigger their installation manually.
ru: Эти зависимости не являются зависимостями для пакета ZoneMinder, так как их можно установить в другом месте. Если они еще не установлены в вашей системе, вам придется вручную запустить их установку.

source: **Step 4:** Add ZoneMinder's Package repository to your apt sources
ru: **Шаг 4:** Добавьте репозиторий пакета ZoneMinder в источники apt

source: ZoneMinder's Debian packages are not included in Debian's official package repositories. To be able to install ZoneMinder with APT, you have to edit the list of apt sources and add ZoneMinder's repository.
ru: Пакеты ZoneMinder для Debian не включены в официальные репозитории Debian. Чтобы установить ZoneMinder с помощью APT, вам нужно отредактировать список источников APT и добавить репозиторий ZoneMinder.

source: Add the following to the /etc/apt/sources.list.d/zoneminder.list file
ru: Добавить следующее в файл /etc/apt/sources.list.d/zoneminder.list

source: You can do this using:
ru: Вы можете сделать это, используя:

source: Because ZoneMinder's package repository provides a secure connection through HTTPS, apt must be enabled for HTTPS. ::
ru: Поскольку пакетный репозиторий ZoneMinder обеспечивает безопасное соединение через HTTPS, для HTTPS должен быть включен apt.

source: Ensure you have gnupg installed before importing the apt key in the following step. ::
ru: Убедитесь, что у вас установлен gnupg перед импортом ключа apt в следующем шаге. ::

source: Finally, download the GPG key for ZoneMinder's repository: ::
ru: Наконец, загрузите ключ GPG для репозитория ZoneMinder: ::

source: **Step 5:** Install ZoneMinder
ru: **Шаг 5:** Установите ZoneMinder

source: **Step 6:** Read the Readme
ru: **Шаг 6:** Прочитайте README

source: The rest of the install process is covered in the README.Debian, so feel free to have a read.
ru: Остальная часть процесса установки описана в README.Debian, поэтому не стесняйтесь прочитать это.

source: **Step 7:** Enable ZoneMinder service
ru: **Шаг 7:** Включить службу ZoneMinder

source: **Step 8:** Configure Apache
ru: **Шаг 8:** Настройка Apache

source: The following commands will setup the default /zm virtual directory and configure required apache modules.
ru: Следующие команды настроят по умолчанию виртуальную директорию /zm и конфигурируют необходимые модули Apache.

source: **Step 9:** Edit Timezone in PHP
ru: **Шаг 9:** Измените часовой пояс в PHP

source: Automated way: ::
ru: Автоматизированный способ: ::

source: Manual way ::
ru: Ручной способ ::

source: Search for [Date] (Ctrl + w then type Date and press Enter) and change date.timezone for your time zone. Don't forget to remove the ; from in front of date.timezone.
ru: Поиск [Дата] (Ctrl + w затем введите Дата и нажмите Enter) и измените дату.времязон для вашего часового пояса. Не забудьте удалить ; перед датой.времязон.

source: CTRL+o then [Enter] to save
ru: !CTRL+o затем [Ввод] для сохранения

source: CTRL+x to exit
ru: CTRL+x для выхода

source: **Step 10:** Start ZoneMinder
ru: **Шаг 10:** Запустите ZoneMinder

source: Reload Apache to enable your changes and then start ZoneMinder.
ru: Перезагрузите Apache, чтобы применить ваши изменения, а затем запустите ZoneMinder.

source: You are now ready to go with ZoneMinder. Open a browser and type either ``localhost/zm`` one the local machine or ``{IP-OF-ZM-SERVER}/zm`` if you connect from a remote computer.
ru: Вы теперь готовы работать с ZoneMinder. Откройте браузер и введите либо ``localhost/zm`` на локальной машине, либо ``{IP-OF-ZM-SERVER}/zm``, если вы подключаетесь с удаленного компьютера.

source: This procedure will guide you through the installation of ZoneMinder on Debian 9 (Stretch). This section has been tested with ZoneMinder 1.36 on Debian 9.8.
ru: Этот процесс поможет вам установить ZoneMinder на Debian 9 (Stretch). Этот раздел был протестирован с ZoneMinder 1.36 на Debian 9.8.

source: Open a console and use ``su`` command to become Root.
ru: Откройте консоль и используйте команду `su`, чтобы стать root.

source: Add the following to the bottom of the file
ru: !добавить следующее в конец файла

source: CTRL+o and <Enter> to save CTRL+x to exit
ru: !CTRL+o и <Enter> для сохранения CTRL+x для выхода
