Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/installationguide/packpack.po
Languages: ru

source: All Distros - A Docker Way to Build ZoneMinder
ru: Все дистрибутивы - Docker-способ создания ZoneMinder

source: If you are looking for an easy way to run ZoneMinder and not interested in building your own docker image, please refer to :doc:`easydocker`.
ru: Если вы ищете простой способ запуска ZoneMinder и не заинтересованы в создании собственного образа Docker, пожалуйста, обратитесь к :doc:`easydocker`.

source: Contents
ru: Содержимое

source: These instructions represent an alternative way to build ZoneMinder for any supported distro.
ru: Эти инструкции представляют собой альтернативный способ сборки ZoneMinder для любой поддерживаемой дистрибутивы.

source: Advantages:
ru: Преимущества:

source: Fewer steps and therefore much simpler
ru: Меньше шагов, а значит, намного проще

source: Target distro agnostic - the steps are the same regardless of the target distro
ru: !Операционная система-мишень безразлична - шаги одинаковы независимо от целевой операционной системы

source: Host distro agnostic - the steps described here should work on any host Linux distro capable of running Bash and Docker
ru: Хост-независимый дистрибутив - описанные здесь шаги должны работать на любом хост-дистрибутиве Linux, способном запускать Bash и Docker

source: Background
ru: Бэкграунд

source: These instructions leverage the power of the automated build system recently implemented in the ZoneMinder project. Behind the scenes, a project called `packpack <https://github.com/packpack/packpack>`_ is utilized, to build ZoneMinder inside a Docker container.
ru: Эти инструкции используют мощь автоматизированной системы сборки, недавно внедренной в проект ZoneMinder. За кулисами используется проект под названием `packpack <https://github.com/packpack/packpack>`_, чтобы собрать ZoneMinder внутри контейнера Docker.

source: Procedure
ru: Процедура

source: **Step 1:** Verify the target distro.
ru: **Шаг 1:** Проверьте целевую ОС.

source: Open the project's `.travis.yml file <https://github.com/ZoneMinder/ZoneMinder/blob/master/.travis.yml#L27>`_ and verify the distro you want to build ZoneMinder for appears in the build matrix. The distros shown in the matrix are those known to build on ZoneMinder. If the distro you desire is in the list then continue to step two.
ru: Откройте файл `.travis.yml` проекта <https://github.com/ZoneMinder/ZoneMinder/blob/master/.travis.yml#L27>`_ и проверьте, появляется ли дистрибутив, для которого вы хотите собрать ZoneMinder, в матрице сборки. Дистрибутивы, показанные в матрице, - это те, которые известны как работающие на ZoneMinder. Если дистрибутив, который вы хотите, есть в списке, переходите к шагу два.

source: If the desired distro is not in the first list, then open the `packpack project README <https://github.com/packpack/packpack/blob/master/README.md>`_ and check if the desired distro is theoretically supported. If it is, then continue to step 2 with the understanding that you are heading out into uncharted territory. There could be problems.
ru: Если желаемая дистрибутива не входит в первый список, откройте README проекта `packpack <https://github.com/packpack/packpack/blob/master/README.md>` и проверьте, теоретически ли поддерживается желаемая дистрибутива. Если да, то продолжайте шаг 2 с пониманием того, что вы идете в неизведанные воды. Могут возникнуть проблемы.

source: If the desired distro does not appear in either list, then unfortunately you cannot use the procedure described here.
ru: Если желаемая дистрибутива не появляется ни в одном из списков, то, к сожалению, вы не можете использовать описанную здесь процедуру.

source: If the desired distro architecture is arm, refer to `Appendix A - Enable Qemu On the Host`_ to enable qemu emulation on your amd64 host machine.
ru: Если желаемая архитектура дистрибутива - arm, обратитесь к разделу `Приложение A - Включение Qemu на хосте`_, чтобы включить эмуляцию qemu на вашей машине с архитектурой amd64.

source: **Step 2:** Install Docker.
ru: **Шаг 2:** Установите Docker.

source: You need to have a working installation of Docker so head over to the `Docker site <https://docs.docker.com/engine/installation/>`_ and get it working. Before continuing to the next step, verify you can run the Docker "Hello World" container as a normal user. To run a Docker container as a normal user, issue the following:
ru: Вам необходимо иметь работающую установку Docker, поэтому перейдите на страницу `Docker <https://docs.docker.com/engine/installation/>` и сделайте ее рабочей. Прежде чем переходить к следующему шагу, убедитесь, что вы можете запустить контейнер Docker "Hello World" как обычный пользователь. Чтобы запустить контейнер Docker как обычный пользователь, выполните следующее:

source: Where <username> is, you guessed it, the user name you log in with.
ru: Где <имя пользователя>, вы догадались, имя пользователя, с которым вы входите.

source: **Step 3:** Git clone the ZoneMinder project.
ru: **Шаг 3:** Загрузите проект ZoneMinder с помощью Git.

source: Clone the ZoneMinder project if you have not done so already.
ru: Скопируйте проект ZoneMinder, если вы этого еще не сделали.

source: Alternatively, if you have already cloned the repo and wish to update it, do the following.
ru: Альтернативно, если вы уже клонировали репозиторий и хотите его обновить, выполните следующие действия.

source: **Step 4:** Checkout the revision of ZoneMinder you wish to build.
ru: **Шаг 4:** Проверьте версию ZoneMinder, которую вы хотите собрать.

source: A freshly cloned ZoneMinder git repo already points to the most recent commit in the master branch. If you want the latest development code then continue to the next step. If instead, you want to build a stable release then perform the following step.
ru: Только что клонированный репозиторий ZoneMinder git уже указывает на самую последнюю коммитацию в ветке master. Если вы хотите последнюю версию разработки, перейдите к следующему шагу. Если вместо этого вы хотите создать стабильную версию, выполните следующий шаг.

source: Where <releasename> is one of the official ZoneMinder releases shown on the `releases page <https://github.com/ZoneMinder/ZoneMinder/releases>`_, such as 1.30.4.
ru: Где <releasename> является одним из официальных релизов ZoneMinder, показанных на странице `releases <https://github.com/ZoneMinder/ZoneMinder/releases>` , таких как 1.30.4.

source: **Step 5:** Build ZoneMinder
ru: **Шаг 5:** Постройте ZoneMinder

source: To start the build, simply execute the following command from the root folder of the local git repo:
ru: Для начала сборки просто выполните следующую команду из корневой папки локального репозитория git:

source: Where <distroname> is the name of the distro you wish to build on, such as fedora, and <distrorel> is the release name or number of the distro you wish to build on. Redhat distros expect a number for <distrorel> while Debian and Ubuntu distros expect a name. For example:
ru: Где <имя_дистрибутива> - это имя дистрибутива, который вы хотите построить, например fedora, и <номер_выпуска_дистрибутива> - это номер выпуска или номер дистрибутива, который вы хотите построить. Дистрибутивы Redhat ожидают номер для <номер_выпуска_дистрибутива>, а дистрибутивы Debian и Ubuntu ожидают имя. Например:

source: Once you enter the appropriate command, go get a coffee while a ZoneMinder package is built. When the build finished, you can find the resulting packages under a subfolder called "build".
ru: После того как вы введете соответствующую команду, возьмите кофе и подождите, пока будет построен пакет ZoneMinder. Когда сборка будет завершена, вы сможете найти полученные пакеты в подпапке, называемой "build".

source: Note that this will build packages with x86_64 architecture. This build method can also build on some distros (debian & ubuntu only at the moment) using i386 architecture. You can do that by adding "ARCH=i386" parameter.
ru: Обратите внимание, что это будет строить пакеты с архитектурой x86_64. Этот метод сборки также может работать на некоторых дистрибутивах (только debian и ubuntu в настоящее время), используя архитектуру i386. Вы можете это сделать, добавив параметр "ARCH=i386".

source: For advanced users who really want to go out into uncharted waters, it is theoretically possible to build arm packages as well, as long as the host architecture is compatible.
ru: Для продвинутых пользователей, которые действительно хотят выйти в неизведанные воды, теоретически возможно создание пакетов ARM, при условии, что архитектура хоста совместима.

source: Building arm packages in this manner has not been tested by us, however.
ru: Создание пакетов таким образом не было протестировано нами, однако.

source: Appendix A - Enable Qemu On the Host
ru: Приложение A - Включение Qemu на хосте

source: If you intend to build ZoneMinder packages for arm on an amd64 host, then Debian users can following these steps to enable transparent Qemu emulation:
ru: Если вы намерены создать пакеты ZoneMinder для arm на хосте amd64, то пользователи Debian могут следовать этим шагам, чтобы включить прозрачное эмуляцию Qemu:

source: Verify arm emulation is enabled by issuing:
ru: Проверьте, что эмуляция ARM включена, выполнив команду:

source: You may get a message stating emulation for this processor is already enabled.
ru: Вы можете получить сообщение о том, что эмуляция для этого процессора уже включена.

source: More testing needs to be done for Redhat distros but it appears Fedora users can just run:
ru: Необходимо провести больше тестирования для дистрибутивов Red Hat, но, похоже, пользователи Fedora могут просто выполнить:

source: Todo
ru: Все

source: Verify the details behind enabling qemu emulation on redhat distros. Pull requests are welcome.
ru: Проверьте детали, связанные с включением эмуляции QEMU в дистрибутивах Red Hat. Приветствуются предложения по улучшению.
