Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/installationguide/redhat.po
Languages: ru

source: Contents
ru: Содержимое

source: These instructions apply to all Redhat distros and their clones, including but not limited to: Fedora, RHEL, Rocky Linux, Alma Linux, and others. While the installation instructions are the same for each distro, the reason why one might use one distro over the other is different. A short description follows, which is intended to help you chose what distro best fits your needs.
ru: Эти инструкции применяются ко всем дистрибутивам Red Hat и их клонам, включая, но не ограничиваясь: Fedora, RHEL, Rocky Linux, Alma Linux и другие. Хотя инструкции по установке одинаковы для каждого дистрибутива, причина, по которой один человек может использовать один дистрибутив вместо другого, различна. Краткое описание следует, которое предназначено для того, чтобы помочь вам выбрать, какой дистрибутив лучше всего соответствует вашим потребностям.

source: Background: RHEL, Rocky Linux, and Clones
ru: Бэкграунд: RHEL, Rocky Linux и клоны

source: These distributions are classified as enterprise operating systems and have a long operating lifetime of many years. By design, they will not have the latest and greatest versions of any package. Instead, stable packages are the emphasis.
ru: Эти дистрибутивы классифицируются как корпоративные операционные системы и имеют долгий срок службы в несколько лет. По замыслу, они не будут иметь последних и лучших версий любого пакета. Вместо этого акцент делается на стабильных пакетах.

source: Replacing any core package in these distributions with a newer package from a third party is expressly verboten. The ZoneMinder development team will not do this, and neither should you. If you have the perception that you've got to have a newer version of php, mysql, gnome, apache, etc. then, rather than upgrade these packages, you should instead consider using a different distribution such as Fedora.
ru: Замена любого основного пакета в этих дистрибутивах на более новый пакет от третьей стороны строго запрещена. Команда разработчиков ZoneMinder этого не сделает, и вам тоже не следует. Если у вас сложилось впечатление, что вам нужна более новая версия PHP, MySQL, GNOME, Apache и т.д., то вместо обновления этих пакетов лучше рассмотреть использование другого дистрибутива, такого как Fedora.

source: The ZoneMinder team will not provide support for systems which have had any core package replaced with a package from a third party.
ru: Команда ZoneMinder не будет оказывать поддержку системам, в которых были заменены любые основные пакеты на пакеты от третьей стороны.

source: Background: Fedora
ru: Бэкграунд: Fedora

source: One can think of Fedora as RHEL Beta. This is, in fact, what it is. Fedora is primarily geared towards development and testing of newer, sometimes bleeding edge, packages. The ZoneMinder team uses this distro to determine the interoperability of ZoneMinder with the latest and greatest versions of packages like mysql, apache, systemd, and others. If a problem is detected, it will be addressed long before it makes it way into RHEL.
ru: Можно рассматривать Fedora как бета-версию RHEL. Это, по сути, то, чем она является. Fedora в первую очередь ориентирована на разработку и тестирование новых, иногда передовых пакетов. Команда ZoneMinder использует эту дистрибутивную версию для определения совместимости ZoneMinder с последними и лучшими версиями пакетов, таких как MySQL, Apache, systemd и других. Если обнаруживается проблема, она будет устранена задолго до того, как попадет в RHEL.

source: Fedora has a short life-cycle of just 6 months. Fedora 36 is the last release supporting armv7 architecture, and consequently Raspberry Pis earlier than the Raspberry Pi 2 v 1.2. F36 is end-of-life in May 2023.
ru: Жизненный цикл Fedora составляет всего 6 месяцев. Fedora 36 - это последний выпуск, поддерживающий архитектуру armv7, и, следовательно, Raspberry Pis, выпущенные до Raspberry Pi 2 v 1.2. F36 снята с производства в мае 2023 года.

source: If you desire newer packages than what is available in RHEL or its clones, you should consider using Fedora.
ru: Если вы хотите использовать пакеты, более новые, чем те, которые доступны в RHEL или его клонах, вам следует рассмотреть возможность использования Fedora.

source: How To Avoid Known Installation Problems
ru: Как избежать известных проблем установки

source: The following notes are based on real problems which have occurred by those who came before you:
ru: Следующие заметки основаны на реальных проблемах, которые возникли у тех, кто пришел до вас:

source: Zmrepo assumes you have installed the underlying distribution **using the official installation media for that distro**. Third party "Spins" may not work correctly.
ru: Zmrepo предполагает, что у вас установлена базовая распределение **с использованием официальных средств установки для этой дистрибуции**. "Spins" третьих сторон могут не работать корректно.

source: ZoneMinder is intended to be installed in an environment dedicated to ZoneMinder. While ZoneMinder will play well with many applications, some invariably will not. Asterisk is one such example.
ru: ZoneMinder предназначен для установки в среде, специально выделенной для ZoneMinder. Хотя ZoneMinder будет хорошо работать со многими приложениями, некоторые из них неизбежно не будут. Asterisk - один из таких примеров.

source: Be advised that you need to start with a clean system before installing ZoneMinder.
ru: Обратите внимание, что перед установкой ZoneMinder вам необходимо начать с чистой системы.

source: If you have previously installed ZoneMinder from-source, then your system is **NOT** clean. You must manually search for and delete all ZoneMinder related files first (look under /usr/local). Issuing a "make uninstall" helps, but it will not do this for you correctly. You **WILL** have problems if you ignore this step.
ru: Если вы ранее установили ZoneMinder из исходников, то ваша система **НЕ** чистая. Вам необходимо вручную искать и удалять все связанные с ZoneMinder файлы (посмотрите в /usr/local). Выполнение команды "make uninstall" помогает, но она не сделает это за вас правильно. У вас **БУДУТ** проблемы, если вы проигнорируете этот шаг.

source: Unlike Debian/Ubuntu distros, it is not necessary, and not recommended, to install a LAMP stack ahead of time.
ru: В отличие от дистрибутивов Debian/Ubuntu, нет необходимости и не рекомендуется устанавливать стеки LAMP заранее.

source: Disable any other third party repos and uninstall any of ZoneMinder's third party dependencies, which might already be on the system, especially ffmpeg and vlc. Attempting to install dependencies yourself often causes problems.
ru: Отключить любые другие репозитории сторонних разработчиков и удалить любые зависимости ZoneMinder от сторонних разработчиков, которые уже могут быть установлены на системе, особенно ffmpeg и vlc. Попытка установить зависимости самостоятельно часто приводит к проблемам.

source: Each ZoneMinder rpm includes a README file under /usr/share/doc. You must follow all the steps in this README file, precisely, each and every time ZoneMinder is installed or upgraded. **Failure to do so is guaranteed to result in a non-functional system.**
ru: Каждый пакет ZoneMinder включает файл README под /usr/share/doc. Вам необходимо выполнить все шаги этого файла README точно, каждый раз при установке или обновлении ZoneMinder. **Несоблюдение этого гарантированно приведет к неработоспособности системы.**

source: How to Install ZoneMinder
ru: Как установить ZoneMinder

source: ZoneMinder releases are hosted at RPM Fusion. New users should navigate to the `RPM Fusion site <https://rpmfusion.org>`__ then follow the instructions to enable that repo.
ru: Выпуски ZoneMinder размещаются на RPM Fusion. Новые пользователи должны перейти на сайт `RPM Fusion <https://rpmfusion.org>`__ и следовать инструкциям по включению этого репозитория.

source: In addition to `RPM Fusion <https://rpmfusion.org>`__, RHEL users must enable the EPEL repo:
ru: Кроме `RPM Fusion <https://rpmfusion.org>`__, пользователи RHEL должны включить репозиторий EPEL:

source: RHEL 8 users must also enable the powertools repo:
ru: Пользователям RHEL 8 также следует включить репозиторий powertools:

source: RHEL 9 users must also enable the crb repo:
ru: Пользователям RHEL 9 также следует включить репозиторий crb:

source: Once the additional repos are enabled, install ZoneMinder from the commandline. Choose the package that matches the desired web server.
ru: После активации дополнительных репозиториев установите ZoneMinder из командной строки. Выберите пакет, соответствующий желаемому веб-серверу.

source: Install ZoneMinder for Apache web server:
ru: Установите ZoneMinder для веб-сервера Apache:

source: Note
ru: Заметка

source: A virtual package called zoneminder exists. This package contains no files and will pull in the zoneminder-httpd package for backwards compatibility.
ru: Существует виртуальный пакет под названием ZoneMinder. Этот пакет не содержит файлов и будет подтягивать упаковку ZoneMinder-httpd для обратной совместимости.

source: Install ZoneMinder for Nginx web server:
ru: Установка ZoneMinder для веб-сервера Nginx:

source: Once ZoneMinder has been installed, you **must** read the README file to complete the installation. Fedora users can find the README under /usr/share/doc/zoneminder-common. RHEL users can find the README under /usr/share/doc/zoneminder-common-x.xx where x.xx is the version of zoneminder.
ru: После установки ZoneMinder вам необходимо прочитать файл README для завершения установки. Пользователи Fedora могут найти README в /usr/share/doc/zoneminder-common. Пользователи RHEL могут найти README в /usr/share/doc/zoneminder-common-x.xx, где x.xx - это версия ZoneMinder.

source: **ZoneMinder will NOT run without completing the steps shown in the README!**
ru: **ZoneMinder не будет работать без выполнения шагов, описанных в README!**

source: How to Install Nightly Development Builds
ru: Как установить ночные сборки разработки

source: ZoneMinder development packages, which represent the most recent build from our master branch, are available from `zmrepo <https://www.zoneminder.com>`_.
ru: Пакеты разработки ZoneMinder, представляющие последнюю сборку из нашей ветки мастеров, доступны с `zmrepo <https://www.zoneminder.com>`.

source: The feedback we get from those who use these development packages is extremely helpful. However, please understand these packages are intended for testing the latest master branch only. They are not intended to be used on any production system. There will be new bugs, and new features may not be documented. This is bleeding edge, and there might be breakage. Please keep that in mind when using this repo. We know from our user forum that this can't be stated enough.
ru: Обратная связь, которую мы получаем от тех, кто использует эти пакеты разработки, чрезвычайно полезна. Однако, пожалуйста, поймите, что эти пакеты предназначены только для тестирования последней ветки мастер. Они не предназначены для использования на любой производственной системе. Будут новые ошибки, и новые функции могут не быть документированы. Это передний край, и может быть повреждение. Пожалуйста, учтите это, когда используете этот репозиторий. Мы знаем из нашего форума пользователей, что это нельзя сказать достаточно.

source: How to Build Your Own ZoneMinder Package
ru: Как создать собственный пакет ZoneMinder

source: If you are looking to do development or the available packages just don't suit you, then you can follow these steps to build your own ZoneMinder RPM.
ru: Если вы хотите заняться разработкой или имеющиеся пакеты просто не подходят вам, то вы можете следовать этим шагам для создания собственного пакета ZoneMinder RPM.

source: Background
ru: Бэкграунд

source: The following method documents how to build ZoneMinder into an RPM package, for Fedora, Redhat, Rocky Linux, and other compatible clones. This is exactly how the RPMS in zmrepo are built.
ru: Следующий метод описывает, как собрать ZoneMinder в пакет RPM для Fedora, Red Hat, Rocky Linux и других совместимых клонов. Это именно так, как строятся пакеты в zmrepo.

source: The method documented below was chosen because:
ru: Метод, описанный ниже, был выбран потому, что:

source: All of ZoneMinder's dependencies are downloaded and installed automatically
ru: Все зависимости ZoneMinder загружаются и устанавливаются автоматически

source: Cross platform capable. The build host does not have to be the same distro or release version as the target.
ru: Кросс-платформенная совместимость. Компьютер для сборки не должен быть той же версией дистрибутива или выпуска, что и цель.

source: Once your build environment is set up, few steps are required to run the build again in the future.
ru: После того как ваша среда для сборки будет настроена, потребуется выполнить несколько шагов, чтобы запустить сборку снова в будущем.

source: Troubleshooting becomes easier if we are all building ZoneMinder the same way.
ru: Диагностика становится проще, если мы все строим ZoneMinder одним и тем же способом.

source: ***IMPORTANT*** Certain commands in these instructions require root privileges while other commands do not. Pay close attention to this. If the instructions below state to issue a command without a “sudo” prefix, then you should *not* be root while issuing the command. Getting this incorrect will result in a failed build, or worse a broken system.
ru: ***ВАЖНО*** Некоторые команды в этих инструкциях требуют привилегий суперпользователя, в то время как другие команды их не требуют. Обратите на это особое внимание. Если в инструкциях ниже указано выдать команду без префикса ``sudo``, то вам не следует быть суперпользователем при выдаче этой команды. Неправильное выполнение этого может привести к неудачной сборке, а в худшем случае - к повреждению системы.

source: Set Up Your Environment
ru: Настройте свою среду

source: Before you begin, set up an rpmbuild environment by following `this guide <https://wiki.centos.org/HowTos/SetupRpmBuildEnvironment>`_ by the CentOS developers. These instructions apply to Rocky Linux and clones as well.
ru: Перед началом работы настройте среду rpmbuild, следуя руководству `CentOS developers <https://wiki.centos.org/HowTos/SetupRpmBuildEnvironment>`_. Эти инструкции применимы к Rocky Linux и его клонам.

source: In addition, make sure RPM Fusion is enabled as described in the previous section `How to Install ZoneMinder`_.
ru: Кроме того, убедитесь, что RPM Fusion включен так, как описано в предыдущем разделе `Как установить ZoneMinder`_.

source: With RPM Fusion enabled, issue the following command:
ru: С RPM Fusion включенным, выполните следующую команду:

source: Add your user account to the group mock:
ru: Добавьте учетную запись пользователя в группу mock:

source: Your build environment is now set up.
ru: Ваша среда разработки теперь настроена.

source: Build from SRPM
ru: Сборка из RPM

source: To continue, you need a ZoneMinder SRPM. If you wish to rebuild a ZoneMinder release, then browse the `RPM Fusion site <https://rpmfusion.org/>`__. If instead you wish to rebuild the latest source rpm from our master branch then browse the `Zmrepo site <http://zmrepo.zoneminder.com/>`_.
ru: Для продолжения вам потребуется пакет ZoneMinder SRPM. Если вы хотите пересобрать выпуск ZoneMinder, то перейдите на сайт `RPM Fusion <https://rpmfusion.org/>`. Если же вы хотите пересобрать последний rpm-пакет от нашей мастер-ветки, то перейдите на сайт `Zmrepo <http://zmrepo.zoneminder.com/>`.

source: For this example, I'll use one of the source rpms from zmrepo:
ru: Для этого примера я использую один из исходных rpm-файлов из zmrepo:

source: Now comes the fun part. To build ZoneMinder, issue the following command:
ru: Теперь начинается веселая часть. Для создания ZoneMinder выполните следующую команду:

source: Want to build ZoneMinder for Fedora, instead of RHEL, from the same host? Once you download the Fedora SRPM, issue the following:
ru: Хотите построить ZoneMinder для Fedora, а не для RHEL, на том же хосте? Как только вы загрузите пакет Fedora SRPM, выполните следующее:

source: Notice that the mock tool requires the following parameters:
ru: Обратите внимание, что инструмент-симулятор требует следующих параметров:

source: The list of available Mock config files are available here:
ru: Список доступных файлов конфигурации Mock доступен здесь:

source: You choose the config file based on the desired distro (e.g. el7, f29, f30) and basearch (e.g. x86, x86_64, arhmhfp). Notice that, when specifying the Mock config as a commandline parameter, you should leave off the ".cfg" filename extension.
ru: Вы выбираете файл конфигурации, исходя из желаемой дистрибуции (например, el7, f29, f30) и базового архитектуры (например, x86, x86_64, armhfp). Обратите внимание, что, указывая конфигурацию Mock в качестве параметра командной строки, вы должны опустить расширение имени файла ".cfg".

source: Installation
ru: Установка

source: Once the build completes, you will be presented with a message stating where the newly built rpms can be found. It will look similar to this:
ru: После завершения сборки вам будет представлен сообщение, указывающее, где можно найти новые rpm-файлы. Оно будет выглядеть примерно так:

source: Copy the newly built ZoneMinder RPMs to the desired system, enable RPM Fusion as described in `How to Install ZoneMinder`_, and then install the rpm by issuing the appropriate yum/dnf install command. Finish the installation by following the zoneminder setup instructions in the distro specific readme file, named README.{distroname}, which will be installed into the /usr/share/doc/zoneminder* folder.
ru: Скопируйте только что построенные пакеты ZoneMinder на желаемую систему, активируйте RPM Fusion, как описано в `How to Install ZoneMinder`_, и затем установите rpm, выдав соответствующую команду yum/dnf install. Завершите установку, следуя инструкциям по настройке ZoneMinder в файле справки дистрибутива, название которого будет README.{distroname}, который будет установлен в папку /usr/share/doc/zoneminder*.

source: Finally, you may want to consider editing the rpmfusion repo file under /etc/yum.repos.d and placing an “exclude=zoneminder*” line into the config file. This will prevent your system from overwriting your manually built RPM with the ZoneMinder RPM found in the repo.
ru: Наконец, вы можете рассмотреть возможность редактирования файла репозитория rpmfusion под /etc/yum.repos.d и добавления строки "exclude=zoneminder*" в конфигурационный файл. Это предотвратит перезапись вашей вручную построенного RPM с RPM ZoneMinder, найденным в репозитории.

source: How to Create Your Own Source RPM
ru: Как создать собственный пакет Source RPM

source: In the previous section we described how to rebuild an existing ZoneMinder SRPM. The instructions which follow show how to build the ZoneMinder git source tree into a source rpm, which can be used in the previous section to build an rpm.
ru: В предыдущем разделе мы описали, как пересобрать существующий пакет ZoneMinder SRPM. Следующие инструкции показывают, как построить исходный репозиторий Git ZoneMinder в источник RPM, который можно использовать в предыдущем разделе для создания RPM.

source: Make sure git and rpmdevtools are installed:
ru: Убедитесь, что установлены git и rpmdevtools:

source: Now clone the ZoneMinder git repository from your home folder:
ru: Теперь клонируйте репозиторий Git ZoneMinder из вашей домашней папки:

source: This will create a sub-folder called zoneminder, which will contain the latest development source code.
ru: Это создаст подпапку с названием ZoneMinder, которая будет содержать последнюю версию исходного кода разработки.

source: If you have previously cloned the ZoneMinder git repo and wish to update it to the most recent, then issue these commands instead:
ru: Если вы ранее клонировали репозиторий ZoneMinder с помощью git и хотите обновить его до последней версии, выполните следующие команды:

source: Get the crud submodule tarball:
ru: Получите архив подмодуля CRUD:

source: Get the cakephp-enum-behavior submodule tarball:
ru: Получите архив подмодуля cakephp-enum-behavior:

source: Get the Rtsp-Server submodule tarball:
ru: Получите архив с подмодулем Rtsp-сервера:

source: At this point, you can make changes to the source code. Depending on what you want to do with those changes, you generally want to create a new branch first:
ru: На данном этапе вы можете вносить изменения в исходный код. В зависимости от того, что вы хотите делать с этими изменениями, обычно вам следует сначала создать новую ветку:

source: Again, depending on what you want to do with those changes, you may want to commit your changes:
ru: Опять же, в зависимости от того, что вы хотите делать с этими изменениями, вам может потребоваться сохранить свои изменения:

source: Once you have made your changes, it is time to turn your work into a new tarball, but first we need to look in the rpm specfile:
ru: После того как вы внесли изменения, пришло время преобразовать вашу работу в новый tarball, но сначала нам нужно взглянуть на файл спецификации rpm:

source: Scroll down until you see the Version field. Note the value, which will be in the format x.xx.x. Now create the tarball with the following command:
ru: Прокрутите вниз до поля "Версия", обратите внимание на значение, которое будет в формате x.xx.x. Затем создайте архив с помощью следующей команды:

source: Replace "1.33.4" with the Version shown in the rpm specfile.
ru: Замените "1.33.4" на версию, указанную в файле спецификации rpm.

source: From the root of the local ZoneMinder git repo, execute the following:
ru: Из корневой директории репозитория Git ZoneMinder выполните следующее:

source: This step will create a source rpm and it will tell you where it was saved. For example:
ru: Этот шаг создаст исходный RPM-файл и сообщит вам, где он был сохранен. Например:

source: Now follow the previous instructions `Build from SRPM`_ which describe how to build that source rpm into an rpm.
ru: Теперь следуйте предыдущим инструкциям `Build from SRPM`_, которые описывают, как собрать этот source RPM в RPM.
