Repository: computervisioning/zoneminder
Catalog: docs/locale/*/LC_MESSAGES/installationguide/ubuntu.po
Languages: ru

source: Contents
ru: Содержимое

source: These instructions are for a brand new ubuntu 22.04 LTS system which does not have ZM installed.
ru: Эти инструкции предназначены для новой системы Ubuntu 22.04 LTS, которая не имеет ZM установленной.

source: **Step 1:** Update system
ru: **Шаг 1:** Обновление системы

source: **Step 2:** Update repositories (Optional)
ru: **Шаг 2:** Обновите репозитории (Опционально)

source: ZoneMinder is part of the current standard Ubuntu repository, but sometimes the official repository can lag behind. To find out check our `releases page <https://github.com/ZoneMinder/zoneminder/releases>`_ for the latest release.
ru: Зонембер - это часть текущего стандартного репозитория Ubuntu, но иногда официальный репозиторий может отставать. Чтобы узнать об этом, проверьте нашу страницу релизов `<https://github.com/ZoneMinder/zoneminder/releases>`_ для последней версии.

source: Alternatively, the ZoneMinder project team maintains a `PPA <https://askubuntu.com/questions/4983/what-are-ppas-and-how-do-i-use-them>`_, which is updated immediately following a new release of ZoneMinder. To use this repository instead of the official Ubuntu repository, enter the following commands:
ru: Альтернативно, команда проекта ZoneMinder поддерживает `PPA <https://askubuntu.com/questions/4983/what-are-ppas-and-how-do-i-use-them>`_, который обновляется сразу после выпуска новой версии ZoneMinder. Чтобы использовать этот репозиторий вместо официального репозитория Ubuntu, введите следующие команды:

source: **Step 3:** Install Zoneminder
ru: **Шаг 3:** Установите Zoneminder

source: **Step 4:** Configure Apache correctly:
ru: **Шаг 4:** Правильно настройте Apache:

source: **Step 5:** Enable and start zoneminder
ru: **Шаг 5:** Включить и запустить ZoneMinder

source: **Step 6:** Open Zoneminder
ru: **Шаг 6:** Откройте Zoneminder

source: Open up a browser and go to ``http://hostname_or_ip/zm`` to open the ZoneMinder Console.
ru: Откройте браузер и перейдите по ссылке ``http://hostname_or_ip/zm`` для открытия консоли ZoneMinder.

source: Ubuntu 18.04 (Bionic)
ru: Ubuntu 18.04 (Бинион)

source: These instructions are for a brand new ubuntu 18.04 system which does not have ZM installed.
ru: Эти инструкции предназначены для новой системы Ubuntu 18.04, которая не имеет ZM установленной.

source: It is recommended that you use an Ubuntu Server install and select the LAMP option during install to install Apache, MySQL and PHP. If you failed to do this you can achieve the same result by running:
ru: Рекомендуется использовать установку сервера Ubuntu и выбрать опцию LAMP во время установки для установки Apache, MySQL и PHP. Если вы этого не сделали, вы можете добиться того же результата, выполнив следующее:

source: Installing LAMP is not ZoneMinder specific so you will find plenty of resources to guide you with a quick search.
ru: Установка LAMP не специфична для ZoneMinder, поэтому вы найдете множество ресурсов, которые помогут вам, если проведете быстрый поиск.

source: **Step 1:** Either run commands in this install using sudo or use the below to become root ::
ru: **Шаг 1:** Выполните команды в этой установке с помощью sudo или используйте приведенное ниже для перехода в режим root:

source: **Step 2:** Update Repos
ru: **Шаг 2:** Обновите репозитории

source: Latest Release
ru: Последняя версия

source: ZoneMinder is now part of the current standard Ubuntu repository, but sometimes the official repository can lag behind. To find out check our `releases page <https://github.com/ZoneMinder/zoneminder/releases>`_ for the latest release.
ru: Зонембер теперь входит в текущий стандартный репозиторий Ubuntu, но иногда официальный репозиторий может отставать. Чтобы узнать об этом, проверьте страницу релизов `на нашем сайте <https://github.com/ZoneMinder/zoneminder/releases>`_.

source: Alternatively, the ZoneMinder project team maintains a `PPA <https://askubuntu.com/questions/4983/what-are-ppas-and-how-do-i-use-them>`_, which is updated immediately following a new release of ZoneMinder. To use this repository instead of the official Ubuntu repository, enter the following from the command line:
ru: Альтернативно, команда проекта ZoneMinder поддерживает `PPA <https://askubuntu.com/questions/4983/what-are-ppas-and-how-do-i-use-them>`_, который обновляется сразу после выпуска новой версии ZoneMinder. Чтобы использовать этот репозиторий вместо официального репозитория Ubuntu, введите следующее с командной строки:

source: Update repo and upgrade.
ru: Обновите репозиторий и обновите.

source: **Step 3:** Configure MySQL
ru: **Шаг 3:** Настройка MySQL

source: The MySQL default configuration file (/etc/mysql/mysql.cnf) is read through several symbolic links beginning with /etc/mysql/my.cnf as follows:
ru: Файл конфигурации MySQL по умолчанию (/etc/mysql/mysql.cnf) читается через несколько символьных ссылок, начинающихся с /etc/mysql/my.cnf, следующим образом:

source: /etc/mysql/mysql.cnf is a basic file
ru: /etc/mysql/mysql.cnf - это базовый файл

source: Certain new defaults in MySQL 5.7 cause some issues with ZoneMinder < 1.32.0, the workaround is to modify the sql_mode setting of MySQL. Please note that these changes are NOT required for ZoneMinder 1.32+ and some people have reported them causing problems in 1.32.0.
ru: Некоторые новые настройки по умолчанию в MySQL 5.7 вызывают некоторые проблемы с ZoneMinder < 1.32.0, обходной путь - изменить настройку sql_mode MySQL. Пожалуйста, обратите внимание, что эти изменения НЕ требуются для ZoneMinder 1.32+ и некоторые люди сообщили о проблемах с ними в 1.32.0.

source: To better manage the MySQL server it is recommended to copy the sample config file and replace the default my.cnf symbolic link.
ru: Для более эффективного управления сервером MySQL рекомендуется скопировать образец конфигурационного файла и заменить символическую ссылку my.cnf по умолчанию.

source: To change MySQL settings:
ru: Для изменения настроек MySQL:

source: In the [mysqld] section add the following
ru: В разделе [mysqld] добавьте следующее

source: CTRL+o then [Enter] to save
ru: !CTRL+o затем [Ввод] для сохранения

source: CTRL+x to exit
ru: CTRL+x для выхода

source: Restart MySQL
ru: Перезапустить MySQL

source: **Step 4:** Install ZoneMinder
ru: **Шаг 4:** Установите ZoneMinder

source: **Step 5:** Configure the ZoneMinder Database
ru: **Шаг 5:** Настройка базы данных ZoneMinder

source: This step should not be required on ZoneMinder 1.32.0.
ru: Этот шаг не должен быть необходим для ZoneMinder 1.32.0.

source: **Step 6:** Set permissions
ru: **Шаг 6:** Установите разрешения

source: Set /etc/zm/zm.conf to root:www-data 740 and www-data access to content
ru: Установите /etc/zm/zm.conf в root:www-data 740 и предоставьте доступ www-data к содержимому

source: **Step 7:** Configure Apache correctly:
ru: **Шаг 7:** Правильно настройте Apache:

source: You may also want to enable to following modules to improve caching performance
ru: Вы также можете включить следующие модули для улучшения производительности кэширования

source: **Step 8:** Enable and start Zoneminder
ru: **Шаг 8:** Включить и запустить Zoneminder

source: **Step 10:** Reload Apache service
ru: **Шаг 10:** Перезагрузите службу Apache

source: **Step 11:** Making sure ZoneMinder works
ru: **Шаг 11:** Проверка работы ZoneMinder

source: Open up a browser and go to ``http://hostname_or_ip/zm`` - should bring up ZoneMinder Console
ru: Откройте браузер и перейдите по ссылке ``http://hostname_or_ip/zm`` - должен открыться интерфейс ZoneMinder.

source: (Optional API Check)Open up a tab in the same browser and go to ``http://hostname_or_ip/zm/api/host/getVersion.json``
ru: (Проверка API) Откройте новую вкладку в том же браузере и перейдите по ссылке "http://имя_хоста_или_ip/zm/api/host/getVersion.json"

source: If it is working correctly you should get version information similar to the example below:
ru: Если все работает правильно, вы должны получить информацию о версии, аналогичную приведенному ниже примеру:

source: **Congratulations** Your installation is complete
ru: **Поздравляю** Ваша установка завершена

source: PPA install may need some tweaking of ZMS_PATH in ZoneMinder options. `Socket_sendto or no live streaming`_
ru: Установка PPA может потребовать некоторой настройки ZMS_PATH в настройках ZoneMinder. `Сокет_отправить или нет живого потокового вещания`

source: Harder Way: Build Package From Source (Discouraged)
ru: Сложный способ: сборка пакета из исходного кода (не рекомендуется)

source: Historically, installing ZoneMinder onto your system required building from source code by issuing the traditional configure, make, make install commands. To get ZoneMinder to build, all of its dependencies had to be determined and installed beforehand. Init and logrotate scripts had to be manually copied into place following the build. Optional packages such as jscalendar and Cambozola had to be manually installed. Uninstalls could leave stale files around, which could cause problems during an upgrade. Speaking of upgrades, when it comes time to upgrade all these manual steps must be repeated again.
ru: Исторически установка ZoneMinder на вашу систему требовала сборки из исходного кода путем выполнения традиционных команд конфигурации, компиляции и установки. Для того чтобы ZoneMinder мог быть построен, все его зависимости должны были быть определены и установлены заранее. Файлы init и logrotate должны были быть скопированы вручную в нужное место после сборки. Дополнительные пакеты, такие как jscalendar и Cambozola, должны были быть установлены вручную. Удаление могло оставить старые файлы, что могло вызвать проблемы при обновлении. Говоря об обновлениях, когда приходит время обновить все эти ручные шаги, их снова нужно повторить.

source: Better methods exist today that do much of this for you. The current development team, along with other volunteers, have taken great strides in providing the resources necessary to avoid building from source.
ru: Существуют более совершенные методы, которые позволяют выполнять большую часть этой работы за вас. Текущая команда разработчиков, а также другие добровольцы, предприняли значительные усилия для предоставления необходимых ресурсов, чтобы избежать необходимости разработки из исходного кода.

source: (These instructions assume installation from source on a ubuntu 15.x+ system)
ru: (Эти инструкции предполагают установку из источника на системе Ubuntu 15.x+.)

source: **Step 1:** Grab the package installer script
ru: **Шаг 1:** Загрузите скрипт установщика пакета

source: **Step 2:** Update the system
ru: **Шаг 2:** Обновите систему

source: **Step 3** Create the package
ru: **Шаг 3** Создайте пакет

source: To build the latest master snapshot:
ru: Для создания последней контрольной точки:

source: To build the latest stable release:
ru: Для создания последней стабильной версии:

source: Note that the distribution will be guessed using ``lsb_release -a 2>/dev/null | grep Codename | awk '{print $2}'`` which simply extracts your distribution name - like "bionic", "hirsute" etc. You can always specify it using --distro=your distro name if you know it. As far as the script goes, it checks if your distro is "trusty" in which case it pulls in pre-systemd release configurations and if its not "trusty" it assumes its based on systemd and pulls in systemd related config files.
ru: Обратите внимание, что распределение будет угадано с помощью команды `lsb_release -a 2>/dev/null | grep Codename | awk '{print $2}`, которая просто извлекает имя вашего дистрибутива - например, "бионичный", "хирург" и т.д. Вы всегда можете указать его с помощью опции `--дистрибуция=имя вашего дистрибутива`, если вы знаете его. Что касается скрипта, он проверяет, является ли ваша версия "трасти", в этом случае он загружает предварительные конфигурации системы до systemd, а если это не "трасти", он предполагает, что это основано на systemd, и загружает файлы конфигурации systemd.

source: (At the end the script will ask if you want to retain the checked out version of ZoneMinder. If you are a developer and are making local changes, make sure you select "y" so that the next time you do the build process mentioned here, it keeps your changes. Selecting any other value than "y" or "Y" will delete the checked out code and only retain the package)
ru: (В конце скрипт спросит, хотите ли вы сохранить версию ZoneMinder, взятую напрокат. Если вы разработчик и вносите локальные изменения, убедитесь, что вы выберете "y", чтобы при следующем выполнении процесса сборки, упомянутого здесь, он сохранил ваши изменения. Выбрав любое другое значение, отличное от "y" или "Y", вы удалите взятый напрокат код и сохраните только пакет)

source: This should now create a bunch of .deb files
ru: Теперь это должно создать кучу файлов .deb

source: **Step 4:** Install the package
ru: **Шаг 4:** Установите пакет

source: **This will report DB errors - ignore - you need to configure the DB and some other stuff**
ru: **Это сообщит об ошибках базы данных - игнорировать - вам нужно настроить базу данных и еще несколько вещей**

source: **Step 5:** Post install configuration
ru: **Шаг 5:** После установки конфигурация

source: Now that you have installed from your own package you can resume following the standard install guide for your version, start at the step after Install Zoneminder.
ru: Теперь, когда вы установили из своего пакета, вы можете продолжить следовать стандартному руководству по установке для вашей версии, начиная с шага после Установка ZoneMinder.

source: Make sure ZoneMinder and APIs work with security
ru: Убедитесь, что ZoneMinder и API работают с безопасностью

source: Enable OPT_AUTH in ZoneMinder
ru: Включить OPT_AUTH в ZoneMinder

source: Log out of ZoneMinder in browser
ru: Выход из ZoneMinder в браузере

source: Open a new tab in the *same browser* (important) and go to ``http://localhost/zm/api/host/getVersion.json`` - should give you "Unauthorized" along with a lot more of text
ru: Откройте новую вкладку в том же браузере (важно) и перейдите по адресу ``http://localhost/zm/api/host/getVersion.json`` - должен дать вам "Неавторизованный" вместе с большим количеством текста

source: Go to another tab in the SAME BROWSER (important) and log into ZM
ru: Перейдите на другую вкладку в том же браузере (важно) и войдите в ZM

source: Repeat step 3 and it should give you the ZM and API version
ru: Повторите шаг 3, и это должно дать вам ZM и версию API

source: Socket_sendto or no live streaming
ru: Сокет_отправить или нет живого стриминга

source: After you have setup your camera make sure you can view Monitor streams, if not check some of the common causes:
ru: После того как вы настроили свою камеру, убедитесь, что вы можете просматривать потоки монитора, если нет, проверьте некоторые из наиболее распространенных причин:

source: Check Apache cgi module is enabled.
ru: Проверьте, включена ли модуль Apache cgi.

source: Check Apache /etc/apache2/conf-enabled/zoneminder.conf ScriptAlias matches PATH_ZMS.
ru: Проверьте скрипт /etc/apache2/conf-enabled/zoneminder.conf, который соответствует перенаправлению PATH_ZMS.

source: From console go to ``Options->Path`` and make sure PATH_ZMS is set to **/zm/cgi-bin/**\ nph-zms.
ru: Из консоли перейдите в "Настройки->Путь" и убедитесь, что PATH_ZMS установлен в **/zm/cgi-bin/** \ nph-zms.

source: Changed Default DB User
ru: Изменил пользователя по умолчанию для базы данных

source: If you have changed your DB login/password from zmuser/zmpass, you need to update these values in zm.conf.
ru: Если вы изменили пароль для входа в базу данных с zmuser/zmpass, вам необходимо обновить эти значения в файле zm.conf.

source: Edit zm.conf to change ZM_DB_USER and ZM_DB_PASS to the values you used.
ru: Измените файл zm.conf, чтобы изменить ZM_DB_USER и ZM_DB_PASS на значения, которые вы использовали.
